@extends(@env('TEMPLATE_NAME').'.App')

@section('head')
<link rel="stylesheet" type="text/css" href="{{ asset('/ProDesign.css') }}">
@endsection

@section('Content')

<section class="breadcrumb mb-0">
    <div class="flex one  ">
        <div class="p-0">
            <a href="/">خانه </a>
            @foreach($breadcrumb as $key=>$item)
            <span>></span>
            <a href="{{$item['slug']}}">{{$item['title']}}</a>
            @endforeach
        </div>
    </div>
</section>



<section class="pro-design-intro m-0 pt-0">
    <div class="flex one">
        <div>
            <div class="flex one two-700 two-900 center">
                <div class="align-right web-design-title">
                    <h1>طراحی سایت حرفه ای</h1>
                    <h3>ما از طرح های جسورانه و کد نشانه گذاری فوق العاده تمیز برای تولید وب سایت هایی استفاده می کنیم که شگفت آور به نظر می رسند.
                    </h3>
                    <a class="button button-purple">تعرفه پکیج طراحی سایت حرفه ای</a>
                </div>
                <div class="index-h1">
                    <img src="{{ asset('img/home/pc.png') }}">
                </div>
            </div>

        </div>
    </div>

</section>

<section class="pro-design-feature mt-3">
    <div class="flex one two-500 three-900 center align-center">
        <div>
            <h2>طراحی صفحات سفارشی</h2>
            <p>وب سایتهای سفارشی که ساختیم برای تجربیات مختلف بهینه شده اند. ما با طراحی و توسعه وب کار می کنیم و راه حلهایی را متناسب با نیازهای شما ایجاد می کنیم و نیازهای تجاری و بی نظیر صنعت شما را برطرف می کنیم.</p>
        </div>
        <div>
            <h2>طراحی سایت با کیفیت</h2>
            <p>در وب ، هدف ما رضایت شما است. ما برای ساختن وب سایت های عالی بسیار سخت کار می کنیم - و حتی ایجاد روابط عالی با مشتری هایمان حتی سخت تر. تیم ما روی ارائه خدمات بسیار عالی متمرکز شده و ابتکاری ترین راه حل های صنعت را از طریق گرافیک های خیره کننده ، کد منبع و استراتژی های سئو کلاه سفید ارائه می دهد.</p>
        </div>
        <div>
            <h2>کدهای بهینه شده</h2>
            <p>بسیار ماهر ، پرشور و سازنده برای ساختن وب سایت های شگفت انگیز. این تخصصی است که توسعه دهندگان طرح و وب ما دارند - همیشه آماده نوشتن خطوط بهینه از کد ، افزونه های جذاب یا راه حل های هوشمندانه برای یک مشکل هستند.</p>
        </div>
        <div>
            <h2>کدهای بهینه برای سئو</h2>
            <p>بهینه سازی موتور جستجو (SEO) دیگر یک امتیاز نیست ، یک نیاز مشترک است. طراحی وب ما مطابق با آخرین اصول سئو ، به شما کمک می کند در مکان های برتر در گوگل ، بینگ و یاهو قرار بگیرید.</p>
        </div>
        <div>
            <h2>طراحی واکنشگرا</h2>
            <p>ما طراحی وب سایت پاسخگو موبایل را برای نام تجاری شما ایجاد می کنیم ، که بهینه شده است تا عالی به نظر برسد و روی موبایل ، تبلت ، لپ تاپ و دسک تاپ خوب کار کند.
            </p>
        </div>
        <div>
            <h2>کدهای بهینه شده</h2>
            <p>بسیار ماهر ، پرشور و سازنده برای ساختن وب سایت های شگفت انگیز. این تخصصی است که توسعه دهندگان طرح و وب ما دارند - همیشه آماده نوشتن خطوط بهینه از کد ، افزونه های جذاب یا راه حل های هوشمندانه برای یک مشکل هستند.</p>
        </div>
    </div>
</section>




<svg viewbox="0 0 100 25">
    <path fill="#5E16B0" opacity="0.5" d="M0 30 V15 Q30 3 60 15 V30z" />
    <path fill="#5E16B0" d="M0 30 V12 Q30 17 55 12 T100 11 V30z" />
</svg>
<section class="pro-design-website mt-0 mb-0  pb-0">
    <div class="flex one align-center ">
        <div class="p-0">
            <p>آیا به دنبال یک آژانس طراحی وب معتبر هستید؟
                شما در صفحه صحیح فرود آمده اید - با تماس با ما امروز شروع کنید.
            </p>
            <a class="button button-white color-purple">تماس با ما</a>
        </div>
    </div>

</section>
<svg class="svg-purple-bottom" viewbox="0 0 100 15">
    <path fill="#fff" d="M0 30 V12 Q30 17 55 12 T100 11 V30z" />
</svg>


<section class="mt-7">
    <div class="flex one">
        <div>
            <div class="flex one two-500">
                <div>
                    <h3 class="font-3 p-0 pl-2">هدف ما ایجاد وب سایتی است که به شما در رشد کمک می کند.</h3>
                </div>
                <div>
                    <p>گروه ما از متخصصان و طراحان وب توسعه حرفه ای به ایجاد وب سایت های قدرتمند ، موثر و جذاب اختصاص داده اند. این که آیا شما تازه شروع کرده اید یا سالها حضور آنلاین داشته اید ، توسعه وب در طرح و وب می تواند به شما کمک کند. سفارشی و مطابق با نیازهای شما می تواند با اهداف بی نظیر تجاری شما هماهنگ باشد و نتایج وب سایت های زیبا و کاربردی هستند که به شما کمک می کنند تا در رقابت باشید.</p>
                    <p>خدمات طراحی وب استثنایی ما بر ارائه تجربه بهینه مخاطبان خود در طیف گسترده ای از دستگاه ها تمرکز دارد. وب سایت شما با یک طراحی مدرن حرفه ای و متمایز است و با روشهای اثبات شده SEO ما بازدید کنندگان شما را به سمت شما سوق می دهد.</p>
                </div>
            </div>
        </div>
    </div>

</section>
<svg viewbox="0 0 100 15">
    <path fill="#ececec" d="M0 30 V12 Q30 17 70 12 T100 11 V30z" />
</svg>


@endsection
