@extends(@env('TEMPLATE_NAME').'.App')


@section('assets')

<link rel="stylesheet" type="text/css" href="{{ asset('/Seo.css') }}">
@endsection

@section('Content')


<section class="breadcrumb mb-0">
    <div class="flex one  ">
        <div class="p-0">
            <a href="/">خانه </a>
            @foreach($breadcrumb as $key=>$item)
            <span>></span>
            <a href="{{$item['slug']}}">{{$item['title']}}</a>
            @endforeach

        </div>
    </div>
</section>

<section class="custom-web-design mb-0 mt-3 p-0">


    <div class="flex one two-700 three-900 center align-center">
        <div>
            <a href="{{url('/نمونه-کار-سئو')}}">
                <img src="{{asset('img/home/design.jpg')}}">
                <h2>نمونه کار سئو</h2>
            </a>
        </div>

    </div>

    <svg viewbox="0 0 100 25">
        <path fill="#00C31F" opacity="0.5" d="M0 30 V15 Q30 3 60 15 V30z" />
        <path fill="#00C31F" d="M0 30 V12 Q30 17 55 12 T100 11 V30z" />
    </svg>
</section>

<section class="custom-web-design-menu mt-0  mb-0 ">

    <div class="flex one align-center ">
        <div class="">
            <h1>سئو سایت</h1>
            <p>آیا به دنبال ایجاد یک وب سایت هستید؟ راه اندازی وب سایت می تواند یک فکر وحشتناک باشد مخصوصاً وقتی که شما متخصص نیستید. نگران نباشید ، تنها نیستید. ما به شما در این زمینه کمک میکنیم تا سایت خود را به صورت حرفه ای یا وردپرس داشته باشید.</p>
        </div>

    </div>

</section>
<svg class="svg-purple-bottom" viewbox="0 0 100 15">
    <path fill="#fff" d="M0 30 V12 Q30 17 55 12 T100 11 V30z" />
</svg>

<section class="p-0 mb-0">
    <div class="flex one">
        <div>
            <div class="flex one three-500   ">

                <h3>بهترین طراحی سایت</h3>
                طراحی یک سایت اصولی از جمله بهترین راه های برای کسب در آمد بیشتر است. از آنجایی که سایت شما نمایش دهنده و ویترین کالاها و خدمات شما می باشد با انتخاب یک سایت با امکانات بالا شما خود را به مشتری معرفی کرده و می توانید در آمد خود را افزایش دهید. میلیون ها نفر از سراسر جهان با طراحی وب سایت برای شغل و کمپانی خود راه را برای پیشرفت خود هموار می کتت. اگر به دنبال یک طراح وب با استعداد برای پروژه خود هستید ، می توانید نمونه طراحی های ما را در این زمینه مرور کنید. طراحی سایت در 2 زمینه طراحی سایت حرفه ای و طراحی سایت وردپرس می باشدو شما براساس نوع فعالیت خود و نوع نیاز خود می توانید گزینه ای که در این زمینه به شما کمک کند را پیدا کنید.



                <h3>پیشرو در طراحی وب سایت</h3>

                طرح و وب با یک وب سایت حرفه ای و یا وردپرس به شما کمک می کند تا بتوانید فروشگاه آنلاین یا نمونه کارها بصورت آنلاین فروش برسانید. ایده های خود را به واقعیت تبدیل کنید و در شغل خود پیشرفت کنید . امروزه به دلیل مسائل مختلف اجتماعی و همینطور پیشرفت علم و مشکل تازه به وجود آمده از جمله بیماری کرونا بیشتر مشاغل نیاز خود را نسبت به داشتن یک سایت برای معرفی شغل خود و همینطور فروش به آنلاین احساس می کنند. شما نیز می توانید راه خود را برای معرفی شرکت خود پیدا کنید.



                <h3>پرتفوی انعطاف پذیر</h3>
                کار خود را با استفاده از طرح های حرفه ای و نمونه کارها طرح و وب ارائه دهید. نمایش پروژه ها در گالری های قابل تنظیم و اضافه کردن صفحات ، سرعت بالای سایت مناسب در زمینه سئو ، تضمین امنیت سایت شما ، حجم بسیار کم و همینطور طراحی در مدل های مختلف مورد نیاز شما از جمله مزایای استفاده از طراحی سایت حرفه ای ما می باشد.



                <h3>محتوای خود را به نمایش بگذارید</h3>
                با استفاده از ابزارهای قدرتمند وبلاگ نویسی ما برای به اشتراک گذاشتن داستان ، ارسال اخبار شرکت یا اعلام یک محصول و مقالات خود استفاده کنید. طبقه بندی ، اشتراک گذاری و برنامه ریزی پست های خود را انجام دهید تا محتوای شما برای شما کار کند.



                <h3>طراحی سایت برای مشاغل مختلف</h3>
                شما در هر زمینه کاری که هستید می توانید در شغل خود پیشرفت کنید. ما طراحی وب سایت شما را از جمله طراحی سایت شرکت ها – مغازه و مراکز تجاری – دانشگاه ها – موسسات آموزشی – فروشگاه آنلاین لباس – تجهیزات و طراحی ساختمان و ... در سریعترین زمان و بهترین طراحی از جمله سرعت سایت و حجم کم مناسب برای سئو شما انجام می دهید.

            </div>

        </div>
    </div>
    <svg viewbox="0 0 100 15">
        <path fill="#ececec" opacity="0.5" d="M0 30 V1 Q50 10 100 10 V30z" />
        <path fill="#ececec" d="M0 30 V12 Q30 17 70 12 T100 11 V30z" />
    </svg>
</section>



@endsection
