@extends(@env('TEMPLATE_NAME').'.App')


@section('assets')

<link rel="stylesheet" type="text/css" href="{{ asset('/home.css') }}">
@endsection

@section('Content')


<section id="index-intro">

    <div class="flex one two-700 two-900 center">
        <div class="align-left">

        </div>
        <div class="index-h1">
            <h1>آژانس طراحی سایت</h1>
            <h3>تیم خلاق و حرفه ای برای طراحی سایت و سئو در طرح و وب </h3>
            <a href="/طراحی-سایت" class="button button-blue">برای شروع کلیک کنید ...</a>
        </div>
    </div>
</section>



<section class="index-info">
    <div class="flex onx">
        <div>
            <h2 class="mb-05">خدمات طراحی سایت و سئو طرح و وب</h2>
            <p>ما سعی داریم از طریق ایده های خلاقانه و استراتژی هایی که قلب و ذهن مخاطبان شما را به خود جلب می کند ، ارزش دارایی های شرکت شما را به مشتریان ارائه دهیم. ما متعهد هستیم که ترکیب کاملی از استعداد خلاق و تفکر استراتژیک را به مشتریان خود ارائه دهیم تا هر پروژه موفقیت بزرگی کسب کند. ما برند شما را بررسی می کنیم و تعیین می کنیم چه چیزی مخاطب شما را تحریک می کند و چه چیزی می تواند پروژه شما را متمایز و منحصر به فرد جلوه دهد. ما در آژانس طراحی و بازاریابی دیجیتال وب سایت طرح و وب بر این باوریم
                که خدمات اصلی شما باید به روایت های انگیزشی ترجمه شوند و این دقیقا ً همان کاری است که ما می کنیم تا شما بدرخشید.</p>
        </div>
    </div>
</section>


<section class="web-design">
    <div class="flex one">
        <div>
            <div class="flex one two-700 two-900 center">
                <div class="align-right web-design-title">
                    <h2>طراحی سایت حرفه ای،
                        طراحی سایت وردپرس و
                        نمونه کارهای ما را
                        مشاهده نمایید
                    </h2>
                    <a href="/تماس-با-ما" class="button button-blue">تماس با تیم طرح و وب</a>
                </div>
                <div class="index-h1">
                    <img src="{{ asset('img/home/pc.jpg') }}">
                </div>
            </div>
            <div class="flex one three-700 three-900 center align-center">
                <div>
                    <h3>طراحی سایت حرفه ای</h3>
                    <p>طراحی وب سایت بخش مهمی برای موفقیت تجاری یک تجارت آنلاین است. ما با یک طراحی منحصر به فرد در دنیای دیجیتال ، یک راه حل ارزشمند را برای شما ارائه می دهیم. ما اشتیاق داریم طراحی وب سایت سفارشی شما را بسازیم ، بنابراین این فقط کار ما نیست بلکه این علاقه ی ما در طراحی وب سایت طرح و وب است.</p>
                </div>
                <div>
                    <h3>طراحی سایت وردپرس</h3>
                    <p>علاوه بر این ، ما به کمک تیم خود از توسعه وردپرس ، سیستم عامل های وردپرس با مقیاس بالا ساخت و نگهداری می کنیم. تیم مهندسین وردپرس ما تجربه گسترده ای در ساخت وب سایت های وردپرس با رده بالا برای تقریباً تمام صنایع (رسانه ، آموزش ، امور مالی و غیره) دارند</p>
                </div>
                <div>
                    <h3>نمونه کارها</h3>
                    <p>ما شرکتی برای کارآفرینانی هستیم که به دنبال ایجاد یک تجربه جالب در برند هستند. ما با نوآوری سیستم عامل های جدید طراحی و بازاریابی دیجیتال ، اصطلاح برندسازی را دوباره تعریف کرده ایم. تیم ما در تلاش است تا جهت و رشد و پیشرفت شما را جهت و صوت مورد نیاز كسب و كار خود قرار دهد.</p>
                </div>
            </div>
        </div>
    </div>
</section>


<section class="seo mb-0">
    <div class="flex one two-700 two-900 center">
        <div>
            <h2>خدمات SEO و بهینه سازی سایت حرفه ای و سایت وردپرس</h2>
            <img src="{{asset('img/home/seo1.jpg')}}">
        </div>
        <div class="align-center">
            <div>
                <h3>سئو سایت</h3>
                <h4>Search Engine Optimisation</h4>
                <p>مشاوران بهینه سازی موتور جستجو ما معتقدند که مناسب ترین وب سایت ها همان وب سایت هایی هستند که رتبه برتر را در نتایج جستجو نشان می دهند. مشاورین سئو ما به شما کمک می کنند تا با یک استراتژی عالی سئو، ترافیک ارگانیک وب سایت و تبلیغ خود را بهبود بخشید.</p>
            </div>
            <div>
                <h3>بازاریابی موتور جستجو</h3>
                <h4>Search Engine Marketing</h4>
                <p>از این رو ، به راحتی می توان دریافت که بازاریابی موتورهای جستجو (SEM) باید یک بخش اساسی در موفقیت آنلاین شما باشد. به عنوان یک صاحب مشاغل، باید بدانید که این زمینه شامل هر فعالیتی است که مربوط به ایجاد وب سایت شما در فضای آنلاین باشد.</p>
            </div>
        </div>
    </div>
</section>


<section class="package mb-2">
    <div class="align-center ">
        <h2 class="mb-3">پکیج طراحی سایت و سئو</h2>
    </div>
    <div class="flex one two-700 three-900 center align-center">
        <div>
            <img src="{{asset('img/home/seo.jpg')}}">
            <h3>قیمت طراحی سایت حرفه ای</h3>
            <p>ما معتقدیم که داشتن یک وب سایت خوب کافی نیست ، بنابراین بسته های وب سایت ما برای تجارت های کوچک و متوسط مناسب هستند. ما چندین بسته وب سایت متناسب با نیاز و بودجه شما ارائه می دهیم. طراحی وب سایت طرح و وب</p>
            <a href="/تعرفه-طراحی-سایت">مشاهده تعرفه ها</a>
        </div>
        <div>
            <img src="{{asset('img/home/moshavere.jpg')}}">
            <h3>قیمت طراحی سایت وردپرس </h3>
            <p>ما طراحی، توسعه و مدیریت سایت وردپرس سفارشی برای مشاغل شما را در ابعاد مختلف انجام می دهیم. دانش و تجربه ما در زمینه توسعه وردپرس شامل رشته ها و بخش های مختلفی است.</p>
            <a href="/تعرفه-طراحی-سایت">مشاهده تعرفه ها</a>
        </div>
        <div>
            <img src="{{asset('img/home/design.jpg')}}">
            <h3>تعرفه سئو سایت</h3>
            <p>مشاوران بهینه سازی موتور جستجو ما معتقدند که مناسب ترین وب سایت ها همان وب سایت هایی هستند که رتبه برتر را در نتایج جستجو نشان می دهند. مشاورین سئو ما به شما کمک می کنند تا با یک استراتژی عالی سئو، ترافیک ارگانیک وب سایت و تبلیغ خود را بهبود بخشید.</p>
            <a href="/تعرفه-سئو-سایت">مشاهده تعرفه ها</a>
        </div>
    </div>
</section>

<section class="customer">
    <div class="flex one two-700 two-900 center">
        <div class="fifth">
            <h2>برخی مشتریان</h2>
        </div>
        <div class="four-fifth">
            <div class="items">
                <img src="{{asset('img/customer/1.jpg')}}">
                <img src="{{asset('img/customer/2.jpg')}}">
                <img src="{{asset('img/customer/3.jpg')}}">
                <img src="{{asset('img/customer/4.png')}}">
                <img src="{{asset('img/customer/5.png')}}">
            </div>
        </div>
    </div>
</section>



@endsection
