# ************************************************************
# Sequel Pro SQL dump
# Version 5446
#
# https://www.sequelpro.com/
# https://github.com/sequelpro/sequelpro
#
# Host: 127.0.0.1 (MySQL 8.0.17)
# Database: corepo
# Generation Time: 2020-09-04 16:54:41 +0000
# ************************************************************


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
SET NAMES utf8mb4;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


# Dump of table contents
# ------------------------------------------------------------

DROP TABLE IF EXISTS `contents`;

CREATE TABLE `contents` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(191) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `slug` varchar(191) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `brief_description` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `description` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `status` int(11) NOT NULL,
  `publish_date` datetime DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `type` varchar(2) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `parent_id` int(11) DEFAULT '1',
  `meta_keywords` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `meta_description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `images` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `viewCount` int(11) NOT NULL DEFAULT '0',
  `commentCount` int(11) NOT NULL DEFAULT '0',
  `attr_type` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `attr` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `meta_title` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=61 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC;

LOCK TABLES `contents` WRITE;
/*!40000 ALTER TABLE `contents` DISABLE KEYS */;

INSERT INTO `contents` (`id`, `title`, `slug`, `brief_description`, `description`, `status`, `publish_date`, `created_at`, `updated_at`, `type`, `parent_id`, `meta_keywords`, `meta_description`, `images`, `viewCount`, `commentCount`, `attr_type`, `attr`, `meta_title`)
VALUES
	(35,'درباره ما','درباره-ما',NULL,'<p>ما سعی داریم از طریق ایده های خلاقانه و استراتژی هایی که قلب و ذهن مخاطبان شما را به خود جلب می کند ، ارزش دارایی های شرکت شما را به مشتریان ارائه دهیم. ما متعهد هستیم که ترکیب کاملی از استعداد خلاق و تفکر استراتژیک را به مشتریان خود ارائه دهیم تا هر پروژه موفقیت بزرگی کسب کند. ما برند شما را بررسی می کنیم و تعیین می کنیم چه چیزی مخاطب شما را تحریک می کند و چه چیزی می تواند پروژه شما را متمایز و منحصر به فرد جلوه دهد. ما در آژانس طراحی و بازاریابی دیجیتال وب سایت طرح و وب بر این باوریم</p><p>که خدمات اصلی شما باید به روایت های انگیزشی ترجمه شوند و این دقیقا ً همان کاری است که ما می کنیم تا شما بدرخشید.</p>',1,'2020-07-04 00:00:00','2020-07-03 19:30:27','2020-08-22 14:58:09','1',0,NULL,NULL,'\"\"',80,0,NULL,NULL,NULL),
	(39,'تعرفه','تعرفه',NULL,NULL,1,'2020-07-05 00:00:00','2020-07-04 22:18:54','2020-08-22 17:12:41','1',0,NULL,NULL,'\"\"',85,0,NULL,NULL,NULL),
	(44,'وبلاگ','وبلاگ',NULL,NULL,1,'2020-07-15 00:00:00','2020-07-14 20:46:33','2020-08-25 10:44:18','1',0,NULL,NULL,'\"\"',148,0,NULL,NULL,NULL),
	(46,'طراحی سایت طرح و وب','طراحی-سایت-طرح-و-وب','<p>برای یاد گیری express نیاز به موارد پیش نیاز هست.</p>','<figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/Screen Shot 2020-07-28 at 8.18.54 PM_1595952172.png\"></figure><p>موارد پیش نیاز برای شروع کار با فریم ورک محبوب express:</p><ul><li>نصب node , npm</li><li>آشنایی route</li><li>آشنایی با mvc</li></ul><p>برای اجرای فایل اصلی حتما از دستور npm start استفاده شود. تا از پوشه bin فایل www اجرا شود.</p>',1,'2020-07-21 00:00:00','2020-07-20 18:00:47','2020-09-04 16:42:42','2',44,'آموزش node',NULL,'{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/express-js.png\",\"300\":\"\\/upload\\/images\\/2020\\/300_express-js.png\",\"600\":\"\\/upload\\/images\\/2020\\/600_express-js.png\",\"900\":\"\\/upload\\/images\\/2020\\/900_express-js.png\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_express-js.png\"}',34,0,'article',NULL,NULL),
	(47,'دسته بندی','دسته-بندی','<p>یکی از بخش های مهم در سئو سایت تکنیکال می باشد. زمانی که شما در این زمینه سایت خود را بهینه سازی نکرده باشید نمی توانید حتی با محتوای بسیار جالب و اصولی رتبه را کسب کنید. اما برای اینکه بتوانید سایت خود را از نظر سئو تکنیکال بهی</p>','<p>یکی از بخش های مهم در سئو سایت تکنیکال می باشد. زمانی که شما در این زمینه سایت خود را بهینه سازی نکرده باشید نمی توانید حتی با محتوای بسیار جالب و اصولی رتبه را کسب کنید. اما برای اینکه بتوانید سایت خود را از نظر سئو تکنیکال بهینه سازی کنید نیاز هست تا با index ، url، پارامترها و موارد دیگر آشنایی داشته باشید.&nbsp;</p><figure class=\"image image-style-align-left image_resized\" style=\"width:25.31%;\"><img src=\"http://remotyadak.local.ir/upload/images/2020/Screen Shot 2017-03-20 at 10.48.48 AM_1598976896.png\"></figure><p>سبل</p><p>سیبلسپدیبلتدذنبی</p><p>سویبپلدتسذیبلتاذتاسیذبتال</p><p>سمبینلنستیدبلنسبلب</p>',1,'2020-07-21 00:00:00','2020-07-20 19:23:06','2020-09-04 14:53:11','1',0,'سئو تکنیکال,بهینه سازی سایت تکنیکال','یکی از بخش های مهم در سئو سایت تکنیکال می باشد. زمانی که شما در این زمینه سایت خود را بهینه سازی نکرده باشید نمی توانید حتی با محتوای بسیار جالب و اصولی رتبه را کسب کنید. اما برای اینکه بتوانید سایت خود را از نظر سئو تکنیکال بهینه سازی کنید نیاز هست تا با index ، url، پارامترها و موارد دیگر آشنایی داشته باشید.','\"\"',89,0,NULL,NULL,NULL),
	(48,'فروشگاه','فروشگاه',NULL,NULL,1,'2020-07-21 00:00:00','2020-07-20 19:25:26','2020-09-04 14:42:24','1',47,NULL,NULL,'{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/shopping.png\",\"300\":\"\\/upload\\/images\\/2020\\/300_shopping.png\",\"600\":\"\\/upload\\/images\\/2020\\/600_shopping.png\",\"900\":\"\\/upload\\/images\\/2020\\/900_shopping.png\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_shopping.png\"}',30,0,NULL,NULL,NULL),
	(49,'خودرو','خودرو','<p>برای پیدا کردن کلمت کلیدی مناسب شما نیاز به استراتژی درست در این زمینه دارید. شما باید اطلاعات لازم را در زمینه چگونگی پیدا کردن کلمات کلیدی ، ابزارهای مناسب در این زمینه ، چگونگی استفاده از کلید واژه در محتوا و میزان استفاده از آن ، انواع کلمات کلیدی ،پیدا کردن کلمات کلیدی دارای رقابت ، میزان سختی کلمات کلیدی بدست آورده و همینطور با کلید واژه های دم بلند و یا طولانی آشنا شوید.&nbsp;</p>','<p>برای پیدا کردن کلمت کلیدی مناسب شما نیاز به استراتژی درست در این زمینه دارید. شما باید اطلاعات لازم را در زمینه چگونگی پیدا کردن کلمات کلیدی ، ابزارهای مناسب در این زمینه ، چگونگی استفاده از کلید واژه در محتوا و میزان استفاده از آن ، انواع کلمات کلیدی ،پیدا کردن کلمات کلیدی دارای رقابت ، میزان سختی کلمات کلیدی بدست آورده و همینطور با کلید واژه های دم بلند و یا طولانی آشنا شوید.&nbsp;</p><ul><li>کلمه کلیدی در سئو چی هست و اینکه چه نکاتی را برای تحقیق عبارات باید مدنظر قرار دهیم.</li><li>راهنمایی برای پیدا کردن کلمات دارای رقابت و راه های پیدا کردن این کلمات</li><li>آموزش مرحله به مرحله برای انتخاب یک کلمه کلیدی برای محتوا ، مقاله و محصولات خود</li><li>چگونه می توان کلمات طولانی و به اصطلاح long tail keyword را برای سایت خود پیدا کرده و از آنها استفاده کنیم.</li></ul><p>&nbsp;</p>',1,'2020-07-21 00:00:00','2020-07-20 19:25:56','2020-09-04 14:50:34','1',47,'استراتژِی کلمات کلیدی,راهنمای استفاده از کلمات کلیدی','برای پیدا کردن کلمت کلیدی مناسب شما نیاز به استراتژی درست در این زمینه دارید. شما باید اطلاعات لازم را در زمینه چگونگی پیدا کردن کلمات کلیدی ، ابزارهای مناسب در این زمینه ، چگونگی استفاده از کلید واژه در محتوا و میزان استفاده از آن ، انواع کلمات کلیدی ،پیدا کردن کلمات کلیدی دارای رقابت ، میزان سختی کلمات کلیدی بدست آورده و همینطور با کلید واژه های دم بلند و یا طولانی آشنا شوید.','{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/car.png\",\"300\":\"\\/upload\\/images\\/2020\\/300_car.png\",\"600\":\"\\/upload\\/images\\/2020\\/600_car.png\",\"900\":\"\\/upload\\/images\\/2020\\/900_car.png\"},\"thumb\":\"\\/upload\\/images\\/2020\\/car.png\"}',47,0,NULL,NULL,NULL),
	(50,'دکوراسیون','دکوراسیون','<p>اگر می خواهید ترافیک سایت خود را افزایش دهید بهینه سازی وبسایت بهترین روش برای هدایت بازدید کننده به سایت می باشد.بر طبق آمار آخیر ۵۷٪ ترافیک وبسایت ها از موتور جستجوی گوگل منشا می گیرد.بنابراین&nbsp;SEO یا بهینه سازی وبسایت مهمترین امر در حال حاضر برای افزایش ترافیک طبیعی به سایت می باشد.در این بخش تمامی نکاتی که لازم است درباره سئو اولیه مانند آشنایی با کارکرد موتورهای جستجو&nbsp;, فاکتور های کلیدی رتبه بندی گوگل و غیره را بدانید&nbsp;,توضیح خواهیم داد.</p>','<p>اگر می خواهید ترافیک سایت خود را افزایش دهید بهینه سازی وبسایت بهترین روش برای هدایت بازدید کننده به سایت می باشد.بر طبق آمار آخیر ۵۷٪ ترافیک وبسایت ها از موتور جستجوی گوگل منشا می گیرد.بنابراین&nbsp;SEO یا بهینه سازی وبسایت مهمترین امر در حال حاضر برای افزایش ترافیک طبیعی به سایت می باشد.در این بخش تمامی نکاتی که لازم است درباره سئو اولیه مانند آشنایی با کارکرد موتورهای جستجو&nbsp;, فاکتور های کلیدی رتبه بندی گوگل و غیره را بدانید&nbsp;,توضیح خواهیم داد. عناوین به شرح زیر می باشد:</p><ul><li>سئو یا SEO چیست</li><li>فرق SEO با SEM چیست</li><li>فاکتورهای رتبه بندی موتورهای جستجو</li><li>طراحی سایت User-friendly</li></ul><p>&nbsp;</p>',1,'2020-07-21 00:00:00','2020-07-20 19:26:13','2020-09-04 14:42:51','1',47,NULL,NULL,'{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/decor.png\",\"300\":\"\\/upload\\/images\\/2020\\/300_decor.png\",\"600\":\"\\/upload\\/images\\/2020\\/600_decor.png\",\"900\":\"\\/upload\\/images\\/2020\\/900_decor.png\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_decor.png\"}',66,0,NULL,NULL,NULL),
	(51,'گردشگری','گردشگری',NULL,NULL,1,'2020-07-21 00:00:00','2020-07-20 19:26:45','2020-09-04 14:43:02','1',47,NULL,NULL,'{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/travel.png\",\"300\":\"\\/upload\\/images\\/2020\\/300_travel.png\",\"600\":\"\\/upload\\/images\\/2020\\/600_travel.png\",\"900\":\"\\/upload\\/images\\/2020\\/900_travel.png\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_travel.png\"}',30,0,NULL,NULL,NULL),
	(52,'آموزشگاه','آموزشگاه',NULL,NULL,1,'2020-07-21 00:00:00','2020-07-20 19:27:03','2020-09-04 14:43:13','1',47,NULL,NULL,'{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/education.png\",\"300\":\"\\/upload\\/images\\/2020\\/300_education.png\",\"600\":\"\\/upload\\/images\\/2020\\/600_education.png\",\"900\":\"\\/upload\\/images\\/2020\\/900_education.png\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_education.png\"}',31,0,NULL,NULL,NULL),
	(53,'ساختار و معماری سایت','ساختار-و-معماری-سایت','<p>در این مقاله شما در رابطه با معماری سایت و عوامل داخلی آن از جمله عوامل اصلی برای داشتن یک معماری مناسب برای سایت ، بهترین معماری برای سایت ما ، لینک سازی داخلی ، سایت مپ و قرار دادن لینک های مناسب برای شناسایی توسط الگوریتم های گوگل و قرار دادن آن در صفحه serp آشنا شوید.</p>','<h3>به نظرشما معماری یک وب سایت برای سئو تاثیر گذار است؟</h3><p>منظور از معماری وب سایت صفحات موجود در آن و همینطور لینک داخلی بین این صفحات می باشد. بهترین حالت برای یک سایت این است که کاربران به راحتی بتوانند به صفحه مورد نظر خود برسند و همینطور موتور ها و خزندگان گوگل از طریق ارتباط بین صفحات بتوانند به تمامی سایت راه پیدا کرده و کل سایت را ایندکس کنند.&nbsp;</p><p>منظور از معماری وب سایت صفحات موجود در آن و همینطور لینک داخلی بین این صفحات می باشد. بهترین حالت برای یک سایت این است که کاربران به راحتی بتوانند به صفحه مورد نظر خود برسند و همینطور موتور ها و خزندگان گوگل از طریق ارتباط بین صفحات بتوانند به تمامی سایت راه پیدا کرده و کل سایت را ایندکس کنند. اگر سایت شما از نظر کاربر سایتی ایده آل باشد و کاربر نیاز مورد نظر خود را از این قسمت پیدا کند و حتی درموردهای بعدی باز هم به سایت شما مراجعه کند ، از نظر گوگل به این صورت دیده می شود که سایت شما برای کاربران مناسب بوده است. پس معماری سایت و لینک سازی داخلی یکی از مهم ترین بخش های سایت شما برای شروع است.&nbsp;</p><h3>آیا معماری سایت مهم است؟</h3><p>جواب سوال شما بله است نظرات مختلفی وجود دارد که به شما ثابت می کند معماری یک سایت در سئو ان تاثیر زیادی دارد . 3 مورد از آن ها را برای شما ذکر میکنیم :</p><p>1: در یک معماری خوب عنکوب های خزنده گوگل می توانند به تمام صفحات سایت شما دسترسی پیدا کنند و کل سایت شما را ببینند. یعنی اگر صفحات شما به درستی از طریق لینک داخلی به هم متصل باشند خزنده گوگل از یک صفحه به صفحه دیگر راه پیدا کرده و می تواند صفحات شما را دنبال کند بدون اینکه حتی یک صفحه را از دست بدهد.</p><p>2: به وسیله معماری وب سایت خود شما می توانید صفحاتی را که دارای الویت بهتری مشخص کرده و همینطور قدرت صفحات دیگر را از طریق لینک دادن به آن صفحه منتقل می کنیم که این کار در رتبه بندی سایت ما و بالا بردن اعتبار ما در گوگل نقش بسیار مهمی دارد.</p><p>3: و در گزینه آخر که مهم ترین گزینه می باشد این است که کاربران به راحتی می توانند به بخشی که به ان نیاز دارند دسترسی پیدا کنند. با این کار علاوه بر اینکه زمان ماندگاری در سایت بیشتر خواهد شد ، گوگل نیز سایت ما را به عنوان یک سایت معتبر که نیازهای کاربر را در سریعترین زمان در اختیار آن قرار می دهد شناخته و اعتبار ما را بیشتر می کند.</p><h3>بهترین روش های برای معاری سایت</h3><p>از روش&nbsp;flat برای این کار استفاده کنید:&nbsp;</p><p>از نظر سئو برای معماری سایت بهترین روش فلت flat می باشد . در این روش شما با حداکثر4 کلیک می توانید به صفحه مورد نظرخود برسید. و همینطور در این معماری عمق بسیار کمی وجود دارد و این به این معنی است که شما می توانید از صفحاتی که امکان ایجاد بک لینک های بیشتری دارند مانند صفحه اصلی ، لینک به صفحاتی که نیاز به رتبه بندی و بالا آمدن در گوگل دارند مانند محصولات یا خدمات شما و همینطور مقالات می باشد.</p><p>شما برای اینکه در گوگل رتبه بگیرید به این نیاز دارید که حتما عنکبوت های گوگل حتما تمام صفحات سایت شما را پیدا کنند و این روش بهترین روش برای سریعترین رسیدن به این نقطه است.</p><p>پس بهترین راه برای شما استفاده از ساده ترین روش برای معماری سایت شما می باشد. تا کاربر با کمترین کلیک و سریعترین زمان به&nbsp; هدف خود برسد. پس از ابتدا برای دسته بندی مطالب خود و معماری سایت خود برنامه داشته باشید تا با بزرگتر شدن سایت شما دچار بهم ریختگی نشوید.</p><p>از صفحات دسته بندی خود استفاده کنید:</p><p>به وسیله صفحه دسته بندی ایجاد شده شما می توانید سایت خود را مرتب کنید.&nbsp;&nbsp;می خواهید صفحه جدیدی را ایجاد کنید؟ براساس دسته بندی هایی که دارید می توانید مطلب را در دسته بندی خاص خود قرار دهید و از این طریق لینک داخلی برای مطلب خود ایجاد کنید.زیرا در صورتی که شما دسته بندی نداشته باشید سایت شما دچار بی نظمی می شود.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/Flat-site-architecture-portraying-good-web-design-practice_1596562537.png\"></figure><p>&nbsp;</p><h3>آدرس های سایت</h3><p>برای سئو شما بهتر است که&nbsp;url&nbsp;&nbsp;ها هم از دسته بندی سایت شما پیروی کنند . یعنی شما باید از دسته بندی های خود در این&nbsp;url استفاده کنید.&nbsp;</p><p><i>https://example.com/category/subcategory/keyword-keyword</i></p><p>&nbsp;</p><h3>لینک سازی داخلی</h3><p>یکی از بخش های مهم سایت لینک سازی داخلی آن می باشد. شما باید از منو خود به صفحات سایت لینک بدهید . به این صورت که شما ابتدا به صفحه دسته بندی اصلی خود از منو لینک داده و از صفحه دسته بندی با صفحات سایت خود ارتباط برقرار کنید.&nbsp;</p><p>مثلا شما باید از صفحه اصلی خود به صفحه دسته بندی یک محصول که تمام آن محصولات در آن صفحه وجود دارد لینک دهید و در این صفحه به تمامی محصولات خود پیوند ایجاد کنید.&nbsp;</p><p>همچنین شما می توانید از صفحات محصولات خود یا نوشته های خود به صفحات دیگر محصولات و نوشته های خود و بخش هایی که با هم ارتباط دارند پیوند ایجاد کنید. تا راه راحتی تری را برای افرادی که دنبال موضوع خاصی هستند ایجاد کنید.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/internal link_1596562573.jpg\"></figure><p>&nbsp;</p><h3>استفاده از نقشه سایت در معماری</h3><p>یکی از بهترین کارهایی که می توانید انجام دهید تا گوگل تمام صفحات شما را پیدا کند و عنکبوت های خزنده گوگل آنها را شناسایی کنند استفاده از نقشه سایت است. شما در این روش می توانید تمامی دسته بندی های ، زیر دسته بندی ها ، محصولات و شاخه ها را نمایش دهید.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/site map_1596562573.png\"></figure><p>&nbsp;</p><h3>نمایش لینک صفحات سایت در گوگل</h3><p>ارتباطاتی که بین صفحات یک سایت می باشد نشان دهنده ارتباط قوی و همینطور معماری یک سایت است . هیچ حالت خاصی برای انتخاب شما وجود ندارد به جز اینکه کاملا به صورت اتفاقی و خودکار این بخش ها در صفحه گوگل نمایش داده می شود. شما می توانید نمونه این لینک ها را در تصویر زیر مشاهده نمایید.</p><p>گوگل صفحاتی را که در یک موضوع به هم ارتباط دارند براساس الگوریتم های خود انتخاب می کنند و نمایش می دهد. اگر شما بتوانید لینک سازی داخلی مناسبی برای سایت خود داشته باشید بر همین اساس گوگل از ارتباط بین لینک های سایت شما می تواند بهترین و مهم ترین بخش ها را در سایت شما مورد بررسی قرار دهد و لینک های مورد نظر را براساس الگورتیم های خود برای نمایش انتخاب کند.&nbsp;</p>',1,'2020-07-25 00:00:00','2020-07-24 20:17:09','2020-08-25 17:16:59','2',47,'معماری سایت,ساختار سایت,معماری داخلی سایت,سایت مپ,لینک سازی داخلی','در این مقاله شما در رابطه با معماری سایت و عوامل داخلی آن از جمله عوامل اصلی برای داشتن یک معماری مناسب برای سایت ، بهترین معماری برای سایت ما ، لینک سازی داخلی ، سایت مپ و قرار دادن لینک های مناسب برای شناسایی توسط الگوریتم های گوگل و قرار دادن آن در صفحه جستجو آشنا شوید.','\"\"',58,0,'article',NULL,NULL),
	(54,'فروشگاه دیجیکالا','فروشگاه-دیجیکالا','<p>اگر بخواهیم سئو&nbsp;و یا به اصطلاح انگلیسی&nbsp;Search engine optimization (SEO) &nbsp;را به ساده ترین زبان تعریف کنیم عبارت است از جا به جایی رتبه در نتایج موتورهای جستجو مانند گوگل از طریق بهینه سازی سایت&nbsp;که منجر به&nbsp;افزایش ترافیک سایت می شود.</p>','<h3>تعریف سئو(SEO) ویا بهینه سازی سایت چیست؟</h3><p>اگر بخواهیم سئو&nbsp;و یا به اصطلاح انگلیسی&nbsp;Search engine optimization &nbsp;را به ساده ترین زبان تعریف کنیم عبارت است از جا به جایی رتبه در نتایج موتورهای جستجو مانند گوگل از طریق <strong>بهینه سازی سایت</strong>&nbsp;که منجر به&nbsp;افزایش ترافیک سایت می شود.</p><p>سئو&nbsp;وظایف متفاوتی دارد که متداول ترین آنها ایجاد محتوا با کیفیت بالا، بهینه سازی محتوا برای کلمات کلیدی خاص و ایجاد بک لینک و .... را می توان نام برد. مهمترین مزیت سئو سایت یا بهینه سازی سایت این است که شما برای یک کلمه کلیدی خاص&nbsp;,ماه به ماه ترافیک رایگان به سمت سایت خود هدایت می کنید.</p><p>در این مقاله سعی خواهیم کرد مطالب و مفاهیم ابتدایی و اولیه سئو را به شما معرفی کنیم.</p><p>۱-چگونه موتور های جستجو کار می کنند؟</p><p>۲-عمکرد سئو چگونه است؟</p><p>۳-فرق آگهی های پولی گوگل با نتایج معمولی سرچ گوگل در چیست؟</p><figure class=\"image\"><img src=\"https://www.tarhoweb.com/upload/images/2020/1-what-is-seo_1597238627.png\"></figure><p>خوب حالا که کمی با تعریف سئو در بالا آشنا شدیم کمی تخصصی تر به موتورهای جستجو مانند گوگل نگاه می اندازیم .</p><h3>چگونه موتور های جستجو کار می کنند؟</h3><p>زمانیکه کلمه ای (keyword ) در گوگل یا موتور جستجوی دیگری جستجو می شود ، یک الگوریتم که مختص به همان موتور جستجو می باشد در کمترین زمان ممکن بهترین نتیجه را برای شما لیست می کند.برای مثال گوگل از بین صد ها میلیارد صفحه موجود در فضای اینترنت , مجموعه ای از بهترین نتایج را به شما نشان می دهد.<br>منظوره ما از بهترین نتایج گوگل چیست؟</p><ul><li>مرتبط بودن کلمه کلیدی سرچ شده &nbsp;با محتوای سایت</li></ul><p>فرض کنید در گوگل کلمه&nbsp;&nbsp;“سئو” را سرچ کرده اید ,انتظار ندارید که نتایج نمایش داده شده در مورد کلمه\"چیپس\" باشد به همین دلیل گوگل به دنبال صفحاتی است که به کلمه کلیدی جستجو شده نزدیک باشد.از طرفی علاوه بررتبه بندی صفحات مناسب و بهینه شده&nbsp; ,صفحات دیگری که مرتبط هستند را نیز نمایش می دهد.برای مثال&nbsp;“SEO” در جستجوی گوگل حدود ۶۴۰۰۰۰۰۰۰ میلیون نتیجه جستجو دارد چه صفحه ای سئو شده باشد چه نباشد.</p><figure class=\"image\"><img src=\"https://www.tarhoweb.com/upload/images/2020/2-relative-search_1597240493.png\"></figure><p>&nbsp;</p><ul><li>معتبر بودن صفحه از نظر گوگل</li></ul><p>یکی دیگر از روش هایی که موتور جستجو با آن سرو کار دارد این است که گوگل به صفحه ای که تعدادی صفحه دیگر به آن لینک شده اند اعتبار می دهد(به این لینک ها&nbsp;backlink&nbsp;&nbsp;گفته می شود).حالا این اعتبار به صفحه ی وب سایت شما کمک می کند تا کمی نزده گوگل شیرین شود .</p><figure class=\"image\"><img src=\"https://www.tarhoweb.com/upload/images/2020/3-Authority-backlinks_1597239446.png\"></figure><p>&nbsp;</p><figure class=\"image\"><img src=\"https://www.tarhoweb.com/upload/images/2020/4-more-backlinks_1597240325.png\"></figure><ul><li>مفید بودن محتوای سرچ شده سایت</li></ul><p>مهمترین نکته ای که باید رعایت شود این است که شاید یک مطلب هم مرتبط با کلمه کلیدی باشد و هم دارای بک لینک های معتبر اما اگر از نظره خواننده مفید نباشد و به اصطلاح سئو کاران برای گوگل نوشته شود نمی تواند در جایگاه خوبی قرار بگیرد.برای مثال فرض کنید&nbsp;“چرا سئو اهمیت دارد؟” را جستجو کرده اید.&nbsp;در لیستی که گوگل در اختیار شما قرار می دهد وارد نفر اول لیست می شوید که توسط یک متخصص سئو نوشته شده است و دارای متنی طولانی بدون هیچ گونه استراتژی و تکنیکی&nbsp; مانند نمونه زیر و از طرفی بک لینک های زیادی برای سایت توسط دیگران ایجاد شده است .</p><figure class=\"image\"><img src=\"https://www.tarhoweb.com/upload/images/2020/5-unorganised-content_1597240274.png\"></figure><p>و حالا نمونه زیر توسط فردی عادی در زمینه&nbsp;“چرا سئو اهمیت دارد؟” نوشته شده است و بک لینک زیادی ندارد اما چون متن را مرتب و به چند بخش تقسیم کرده و با اصول سئو نوشته شده (در ادامه توضیح می دهیم که یک محتوای تکنیکی چگونه نوشته می شود) و هر پاراگراف تیتر مخصوص به خود دارد از نظرخواننده مفید محسوب می شود .اگر عکس زیر را با عکس بالا مقایسه کنید خواهید دید که که هر پاراگراف دارای تیتر و عکس جداگانه می باشد .</p><figure class=\"image\"><img src=\"https://www.tarhoweb.com/upload/images/2020/6-useful-content_1597240986.png\"></figure><p>نتیجه:</p><p>سایتی خلق کنید که مردم آن را دوست داشته باشند نه گوگل ! .گوگل به دنبال سایت هایی هست که سیگنال بیشتری از مردم گرفته باشد و خواننده آن سایت را بیشتر دوست دارد.پس سعی کنید سیگنال های واقعی را جایگزین سیگنال های مصنوعی کنید و این امر باعث جا به جایی در رنکینگ گوگل می شود.</p><h3>عملکرد سئو چگونه است :</h3><p>سئو با بهینه سازی سایت برای موتور های جستجو مانند&nbsp;Google&nbsp;،Bing&nbsp;&nbsp;کار می کند.&nbsp;وظیفه شما این است که مطمئن شوید موتورهای جستجو سایت شما را به عنوان بهترین نتیجه ببیند و این نقش را الگوریتمی ایفا می کند که وظیفه آن بررسی مرتبط و معتبر بودن&nbsp; محتوای جستجو شده &nbsp;با کلمه کلیدی است. در بیشتر مواقع هنگامی که صحبت از بهینه سازی موتورهای جستجو است در واقع تمامی توجهات به سمت&nbsp; “سئو گوگل&nbsp;“ پیش می رود که در نتیجه به ما این امکان را داد تا روی سئوگوگل بیشتر تمرکز کنیم.</p><h3>فرق آگهی های پولی گوگل (PPC) با نتایج معمولی سرچ (Organic Results):</h3><p>صفحات نتایج جستجوی گوگل به دو بخش جستجوی مجزا تقسیم می شوند :آگهی های پولی گوگل و نتایج معمولی گوگل</p><ul><li>نتایج معمولی گوگل :</li></ul><p>نتایج جستجوی معمولی (که بعضاً به عنوان نتایج \"طبیعی\" خوانده می شوند) لیستی از سایت&nbsp; هایی هستند که براساس معیار های گوگل ، 100٪ رتبه بندی می شوند.</p><p>موتورهای جستجو مانند گوگل&nbsp;,نتایج جستجوی اصلی را بر اساس صد&nbsp;ها فاکتور رتبه بندی مختلف, رتبه بندی می کنند. اما به طور کلی ، نتایج اصلی از نظر گوگل به عنوان قابل اعتماد ترین و معتبرترین وب سایت ها یا صفحات وب مربوط به این موضوع و یا کلمه کلیدی جستجو شده, شناخته شده است.</p><p>جزئیات بیشتر درباره نحوه کارالگوریتم موتور های جستجو را بعدا توضیح خواهیم داد ولی در حال حاضر تنها نکته ای که باید در نظر داشته باشیم این است که وقتی صحبت از سئو می شود منظور همان رتبه بندی وب سایت شما در نتایج اصلی است نه نتایج پولی . در ضمن این نکته رانیز نبایدفراموش کرد که نتایج لیست شده در جستجوی اصلی و معمولی گوگل از سئو بهتری برخوردار می باشند تا نتایج پولی نمایش داده گوگل.</p><ul><li>نتایج پولی گوگل (PPC) :</li></ul><p>نتایج پولی گوگل در بالا و یا در پایین لیست نتایج جستجو شده معمولی گوگل به صورت تبلیغات (یک آیکون&nbsp;Ad سبز رنگ در کنار آن قرار دارد)نمایش داده می شود. تبلیغات پولی گوگل کاملا مستقل از لیست جستجوی اصلی گوگل است و نحوه کار آن پرداخت در ازای کلیک بروی تبلیغ می باشد.در این نوع تبلیغ هزینه بر اساس قیمت کلیک تعریف شده است که به این معنی می باشد که شما هزینه ای به ازای هر فردی که وارد سایت شما می شود پرداخت می کنید و گوگل سایت شما را در صدر نتایج نمایش می دهد.</p>',1,'2020-07-29 00:00:00','2020-07-28 21:44:33','2020-09-04 16:52:30','2',50,'سئو,بهینه سازی,seo,سئو چیست,بهینه سازی سایت,عملکرد سئو','اگر بخواهیم سئو و یا به اصطلاح انگلیسی Search engine optimization (SEO)  را به ساده ترین زبان تعریف کنیم عبارت است از جا به جایی رتبه در نتایج موتورهای جستجو مانند گوگل از طریق بهینه سازی سایت که منجر به افزایش ترافیک سایت می شود.','{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/bt.jpg\",\"300\":\"\\/upload\\/images\\/2020\\/300_bt.jpg\",\"600\":\"\\/upload\\/images\\/2020\\/600_bt.jpg\",\"900\":\"\\/upload\\/images\\/2020\\/900_bt.jpg\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_bt.jpg\"}',71,0,'article',NULL,NULL),
	(55,'تماس با ما','تماس-با-ما',NULL,'<p>شماره تماس: <a href=\"tel:02188421318\">۰۲۱۸۸۴۲۱۳۱۸</a></p><p>شماره همراه: <a href=\"tel:09331181877\">۰۹۳۳۱۱۸۱۸۷۷</a></p><p>تماس با پشتیبانی از ساعت ۸ تا ۲۴</p>',1,'2020-08-02 00:00:00','2020-08-01 23:02:37','2020-08-25 17:15:09','1',0,NULL,NULL,'\"\"',59,0,NULL,NULL,NULL),
	(56,'فروشگاه اینترنتی خانومی','فروشگاه-اینترنتی-خانومی','<p>شما برای اینکه در گوگل رتبه بگیرید باید برای صفحات و مقالات خود کلمات کلیدی را درنظر بگیرید. اگر می خواهید کلمات کلیدی را شناسایی کنید نیاز به تحقیق در این زمینه دارید . شما می توانید برای پیدا کردن کلمات کلید از حجم</p>','<h3>چطور می توانیم کلمات کلیدی را سئو کنیم؟</h3><p>شما برای اینکه در گوگل رتبه بگیرید باید برای صفحات و مقالات خود کلمات کلیدی را درنظر بگیرید. اگر می خواهید کلمات کلیدی را شناسایی کنید نیاز به تحقیق در این زمینه دارید . شما می توانید برای پیدا کردن کلمات کلید از حجم جستجو ، میزان رقابت و ... انتخاب کنید. برای اینکه مقاله و صفحات سایت شما در یک کلمه خاص درگوگل رتبه بیاورد شما نیاز دارید تا این کلمه را شناسایی کنید و صفحه را برای این کلمه کلیدی بهینه کنید تا رتبه بالاتری بگیرید.</p><p>با این کار شما می توانید ترافیک هدفمند را به سمت سایت خود بفرستید و این در صورتی هست که شما رتبه بالاتری را در&nbsp;serp داشته باشید. برای همین این کار از مهم ترین وظایف در انجام کار سئو است که شما لیستی از مناسب ترین کلمات کلیدی پیدا کنید.</p><p>در ابتدا <strong>معماری سایت</strong>&nbsp;خود را کاملا مشخص کنید.</p><p>ابتدا دسته بندی های خود را کاملا مشخص کرده و بر همین اساس صفحات محصولات خود را ایجاد نمایید.</p><p>برای پست های خود در وبلاگ می توانید محتوا مناسب ایجاد کنید.</p><p>صفحات فرود خود&nbsp;landing page و همینطور صفحات فروش و محصولات خود را بهینه سازی کنید.</p><p>&nbsp;</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/keywords-research-banner-laptop-with-folder-documents-graphs-key_80328-154_1596564279.jpg\"><figcaption>استراتزِی یافتن کلمات کلیدی</figcaption></figure><p>&nbsp;</p><h3>بهترین روش برای پیدا کردن کلمات کلیدی</h3><p>&nbsp;</p><p>از گزینه های پیشنهادی گوگل&nbsp;google suggest استفاده کنید.</p><p>شما باید از کلمات طولانی و به اصطلاح&nbsp;long tail keyword استفاده کنید. استفاده از کلمات کلیدی که رقابت بسیار زیادی دارند دور از دسترس نیست اما این کار به زمان زیادی نیاز دارد تا رتبه بندی مورد نظر شما را به دست بیاورد.</p><p>&nbsp;</p><p>کلمات کلیدی بلند حدود 3 تا 4 کلمه باشند که این کلمات برای سایت هایی که به تازگی کار خود را شروع میکنند بسیار مناسب است.&nbsp; زمانی که شما یک کلمه کلیدی با رقابت بالا را در گوگل سرچ میکنید گوگل به شما پیشنهاداتی می دهد که شما با انتخاب این گزینه ها می توانید صفحات خود را برای این&nbsp;keywords بهینه سازی کنید.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/-ساجست_1596563727.JPG\"></figure><h3>پیدا کردن کلمات کلیدی مبتنی بر سوال</h3><p>اگر برای پست ها و مقالات خود دنبال کلمات کلیدی مبتنی بر سوال هستید می توانید از ذو ابزار در این زمینه استفاده کنید و بوسیله این دو ابزار رایگان کلمات کلیدی مناسب برای مطالب خود پیدا کنید و صفحات سایت و بلاگ خود را سئو کنید.</p><p>اولین ابزار برای پیدا کردن کلمات کلیدی مبتنی بر سوال&nbsp;<strong>AnswerThePublic.com&nbsp;</strong>نام دارد. این ابزار برای پیدا کردن سوالات کاربران در زمینه مورد نظر شما می باشد و سوالات بسیاری را در این زمینه به شما ارائه می دهد.</p><p>ابزار دوم برای یافتن کلمات کلیدی سوال&nbsp;Question DB&nbsp;&nbsp;نام دارد. این گزینه هم موارد بسیار زیادی از سوالات را برای ما پیدا کرده و نمایش می دهد. کلمات کلیدی در این ابزار معمولا کلمات کلیدی طولانی هستند که در گوگل دارای رقابت بالایی نمی باشند.</p><p>&nbsp;</p><h3>استراتژی یافتن کلمات کلیدی خلاقانه</h3><p>&nbsp;</p><p>شما می توانید برای یافتن کلمه کلیدی مورد نظر خود از هر ابزاری استقاده کنید و برای یافتن کلمات کلیدی خلاقانه که برای سئو کردن صفحات سایت شما بسیار مناسب باشد من به شما ابزار ساده و همچنین رایگان&nbsp;<strong>SeedKeywords.com</strong> را معرفی می کنم . در این سایت شما می توانید به عباراتی دست پیدا کنید که شاید خود شما به تنهایی نمی توانستید به آنها برسید.</p><p>همچنین شما می توانید برای یافتن عباراتو کلمات کلیدی تجارت الکترونیک مورد نظر خود از سایت آمازون استفاده کنید. شما برای&nbsp; پیدا کردن کلمات کلیدی برای محصول خود می توانید از گزینه های پیشنهادی در آمازون استفاده کنید و این کار دقیقا مانند پیشنهادات گوگل می باشد.&nbsp;</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/seo-data-analytics-keyword-process_34708-51_1596564278.jpg\"></figure><p>&nbsp;</p><h3>کلمات کلیدی رقبای خود را تحلیل کنید</h3><p>برای پیدا کردن کلمات کلیدی شما می توانید سایت رقبای خود را در این زمینه تحلیل کنید. این کار لیستی را برای شما از یک دامنه قابل رقابت ایجاد می کند. برای اینکه شانس خود را برای رقابت بالا ببرید مشابه سایت خود را پیدا کنید تا بهترین عبارات را برای سایت خود ایجاد نمایید.</p><p>&nbsp;</p><h3>از ابزارkeyword planner استفاده کنید</h3><p>برای استفاده از این ابزار باید یک حساب&nbsp;google ads ایجاد کنید. در غیر اینصورت یک کمپین اجرا کنید و حجم جستجوهای ماهانه را هم می توانید ببینید.</p><p>اگر شما یک حساب&nbsp;google ads میسازید به این معنی نیست که در حال حاضر می خواهید تبلیغی را اجرا نمایید . این کار برای دسترسی به ابزار تحلیل کلمات کلیدی می باشد. شما می توانید کلمه خود را وارد کنید و میزان سرچ کلمه در ماه را در قسمت پلن مشاهده نمایید.&nbsp;</p><p>&nbsp;</p><h3>استفاده ازgoogle trends برای پیدا کردن کلمات کلیدی</h3><p>پیدا کردن حجم جستجو ماهانه مهم است ،شما در گوگل&nbsp;trends می توانید روند و میزان سرچ یک کلمه را مشاهده کنید.&nbsp;&nbsp;شما می توانید حجم جستجوی ماهانه یک کلمه را پیدا کنید و میزانی که این کلمه امکان رشد دارد را به شما نمایش نمی دهد. شما باید تلاش خود را برای اصطلاحاتی که محبوبیت دارند انجام دهید ، این کلمات در حال رشد هستند.</p><p>&nbsp;&nbsp;</p><h3>یافتن کلمات کلیدی ازBuzzSumo</h3><p>این ابزار صرفا برای تحقیق یک کلمه کلیدی نمی باشد اما اگر استفاده از آن را یاد بگیرید می توانید راهی برای یافتن این اصطلاحات پیدا کنید. شما صفحه اصلی رقیب خود را در این سایت قرار می دهید و مطالبی را که برای این سایت مهم هستند و بهترین عملکرد را دارند نمایش داده می شود. شما می توانید با مشاهده بهترین محتواهای یک سایت بهترین کلمات کلیدی را برای سایت و مقالات خود انتخاب کنید.&nbsp;</p><p>&nbsp;</p><h3>استفاده از کلمات کلیدی در محتوا</h3><p>در ابتدا برای کلمه اصلی خود تمصمیم گیری نمایید و در یک صفحه از چند کلمه کلیدی استفاده نکنید زیرا جوابگو نیست. از کلمه کلیدی در عنوان صفحه خود استفاده کنید به طور مثال اگر صفحه شما در رابطه با راهنما برای نوشتن پست بلاگ است می توانید از عبارات چگونه یک پست بلاگ بنویسیم استفاده کنیم . به این صورت مقاله ما برای این کلمه کلیدی شناخته می شود . در مرحله بعد شما می توانید از کلید واژه اصلی در محتوای مقاله خود استفاده کنیم. نیاز به اینکه بارها در طول متن از کلیمه کلیدی استفاده کنید نیست فقط چندمرتبه در سایت خود از کلید واژه مورد نظر استفاده کنید تا گوگل متوجه شود که تمرکز شما در این مقاله بر روی این کلمه است.</p><p>همینطور کاملا مطمئن شوید که کلمه کلیدی شما حتما در&nbsp;url&nbsp;&nbsp;و همینطور عنوان&nbsp;tilte آورده شده است . سپس در این مرحله کلید واژه خود را در توضیحات&nbsp;meta description نیز بیاورید. با این کار به کاربران نشان می دهید که متن شما در چه زمینه ای می باشد و به این صورت میزان کلیک بر روی مقاله شما بیشتر خواهد شد.</p><p>بعد از سرچ توسط کاربر این کلمه به صورت بولد نمایش داده می شود. به این صورت میزان توجه به سایت شما بیشتر می شود. شما می توانید از کلمات مشابه در این زمینه نیز استفاده کنید و علاوه بر کلمه کلیدی از عبارات مترادف نیز بهره ببرید. کلمات کلیدی که بیشترین استفاده را دارند در پایین صفحه در سرچ گوگل قابل مشاهده می باشند.</p><p>و در آخر از لینک های داخلی در سایت خود استفاده کنید. برای اینکه این صفحه جدید قابل مشاهده و سرچ بیشتر باشد نیاز هست تا شما از طریق صفحات دیگر که دارای اعتبار بیشتری هستند به این صفحه لینک دهید. برای ایجاد لینک بین صفحات سعی کنید از ایجاد لینک با کلمه کلیدی اصلی صفحه خود استفاده کنید تا گوگل کاملا متوجه شود که صفحه شما به چه کلید واژه و اصطلاحی تاکید دارد.</p>',1,'2020-08-03 00:00:00','2020-08-02 14:37:35','2020-09-04 16:45:46','2',49,'سئو کلمات کلیدی,استراتژی کلمات کلیدی,پیدا کردن کلمات کلیدی,سئو کلیدواژه','برای اینکه در گوگل شناخته شوید و رتبه بیاورید مهم ترین و اولین کار پیدا کردن کلمه کلیدی است. ما راه های پیدا کردن بهترین و مناسب ترین کلید واژه و عبارت را برای مقالات وبلاگ و محصولات و خدمات به شما نشان می دهیم.','{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/site1.jpg\",\"300\":\"\\/upload\\/images\\/2020\\/300_site1.jpg\",\"600\":\"\\/upload\\/images\\/2020\\/600_site1.jpg\",\"900\":\"\\/upload\\/images\\/2020\\/900_site1.jpg\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_site1.jpg\"}',33,0,'article',NULL,NULL),
	(57,'فرق بین اصطلاح SEM  و SEO  چیست ؟','فرق-بین-اصطلاح-SEM-و-SEO-چیست-؟','<p>مهمترین تفاوت بین این دو اصطلاح این است که&nbsp;Search Engine Optimization (SEO)&nbsp;&nbsp;روی بهینه سازی سایت کار می کندتا ترافیک لازم را از نتایج جستجوی گوگل به سایت هدایت کند.از&nbsp; طرفی&nbsp;Search Engine Marketing (SEM)&nbsp;&nbsp; علاوه بر اینکه ترافیک را هدایت می کند, ورودی ترافیک از هر دو نتایج معمولی و پولی گوگل را مشاهده و مانیتورینگ می کند.</p>','<h2>فرق بین اصطلاح SEO با SEM چیست؟</h2><p>مهمترین تفاوت بین این دو اصطلاح این است که&nbsp;Search Engine Optimization (SEO)&nbsp;&nbsp;روی بهینه سازی سایت کار می کندتا ترافیک لازم را از نتایج جستجوی گوگل به سایت هدایت کند.از&nbsp; طرفی&nbsp;Search Engine Marketing (SEM)&nbsp;&nbsp; علاوه بر اینکه ترافیک را هدایت می کند, ورودی ترافیک از هر دو نتایج معمولی و پولی گوگل را مشاهده و مانیتورینگ می کند.</p><p>همانطور که می دانید نتایج جستجوی گوگل به دو دسته اصلی تقسیم می شوند .همانطور که در شکل زیر می بینیم این دو دسته به نتایج معمولی گوگل و نتایج پولی گوگل دسته بندی شده اند.</p><p>هدف اصلی&nbsp;SEO&nbsp;&nbsp; رتبه بندی سایت شما در نتایج معمولی گوگل می باشد.</p><p>شما می توانید وب سایت خود را در جایگاه نتایج پولی قرار دهید فقط این نکته را یادتان باشد که به ازای هر کلیک شما هزینه ای پرداخت می کنید&nbsp;pay per click (PPC)).)</p><p>حالا طبق مطالب اولیه که در بالا اشاره شد&nbsp;SEO&nbsp;&nbsp;مکانی است که شما ۱۰۰٪&nbsp; بروی رتبه بندی در نتایج معمولی گوگل تمرکز می کنید ولی زمانی که شما از هر دو&nbsp;SEO و&nbsp;PPC برای جذب ترافیک به سایت استفاده می کنید بحث&nbsp;SEM&nbsp;&nbsp;به میان می آید و نشان می دهد که&nbsp;SEO&nbsp;&nbsp;در دسته&nbsp;SEM&nbsp;&nbsp;می باشد.</p><h3>SEO در مقابل SEM: مهمترین ویژگی ها</h3><p>همانور که می دانید سئو روشی است برای بهینه سازی یک وب سایت که سایت شما را در صفحات نتایج موتور جستجوی&nbsp; معمولی و غیر پولی گوگل رتبه بندی می کند.شاید&nbsp;&nbsp;اصطلاح&nbsp;SERPs را بار ها دیده اید که به معنی همان صفحات نتایج موتور جستجو می باشد.(Search Engine Results Pages)</p><p>سئو می تواند به چهار زیر گروه اصلی تقسیم شود.</p><ul><li>سئو داخلی(On-page SEO)</li><li>سئو خارجی&nbsp;(Off-page SEO)</li><li>سئو تکنیکال (Technical SEO)</li><li>سیگنال های تعاملی کاربری</li></ul>',1,'2020-08-13 00:00:00','2020-08-12 17:31:30','2020-08-22 13:47:58','2',50,'سئو داخلی,سئو خارجی,سئو تکنیکال,On-page SEO,Off-page SEO,Technical SE,SEM,نتایج پولی گوگل','مهمترین تفاوت بین این دو اصطلاح این است که Search Engine Optimization (SEO)  روی بهینه سازی سایت کار می کندتا ترافیک لازم را از نتایج جستجوی گوگل به سایت هدایت کند.از  طرفی Search Engine Marketing (SEM)   علاوه بر اینکه ترافیک را هدایت می کند, ورودی ترافیک از هر دو نتایج معمولی و پولی گوگل را مشاهده و مانیتورینگ می کند.','{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/title-seo-sem.jpg\",\"300\":\"\\/upload\\/images\\/2020\\/300_title-seo-sem.jpg\",\"600\":\"\\/upload\\/images\\/2020\\/600_title-seo-sem.jpg\",\"900\":\"\\/upload\\/images\\/2020\\/900_title-seo-sem.jpg\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_title-seo-sem.jpg\"}',17,0,'article',NULL,NULL),
	(58,'نقشه سایت','نقشه-سایت','<p>شما برای وب سایت خود نیاز به یک نقشه سایت دارید تا موتورهای جستجوگر بتونند محتوا و مطالب داخل وب سایت شما را ببینند و ان را فهرست کنند. نقشه سایت به موتورهای جتستجو گر نشان می دهد که کدام مطالب شما مهم تر از بقیه می باشد . این نقشه ها دارای انواع مختلفی می باشند . نقشه معمول که به نام&nbsp;XML شناخته شده است رایج ترین نوع نقشه سایت است و صفحات مختلف وب سایت شما را نمایش می دهد. نقشه های دیگری هم برای ویدئو ، اخبار و تصاویر می باشد که برای معرفی این بخش ها به گوگل مورد استفاده قرار می گیرد.</p>','<h3>نقشه سایت چیست؟</h3><p>شما برای وب سایت خود نیاز به یک نقشه سایت دارید تا موتورهای جستجوگر بتونند محتوا و مطالب داخل وب سایت شما را ببینند و ان را فهرست کنند. نقشه سایت به موتورهای جتستجو گر نشان می دهد که کدام مطالب شما مهم تر از بقیه می باشد . این نقشه ها دارای انواع مختلفی می باشند . نقشه معمول که به نام&nbsp;XML شناخته شده است رایج ترین نوع نقشه سایت است و صفحات مختلف وب سایت شما را نمایش می دهد. نقشه های دیگری هم برای ویدئو ، اخبار و تصاویر می باشد که برای معرفی این بخش ها به گوگل مورد استفاده قرار می گیرد.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/xmlsitemap-wordpress_1597742705.jpg\"></figure><p>&nbsp;</p><h3>چرا نقشه سایت بسیار مهم است؟</h3><p>موتورهای جستجو از نقشه سایت شما برای پیدا کردن صفحات مختلف استفاده می کنند و اگر صفحات سایت شما به درستی با هم پیوند داشته باشد ، خزندگان وب می توانند صفحات و بخش های مختلف وب سایت شما را پیدا کنند. گوگل برای اینکه صفحات وب شما را پیدا کند و یا به محصولات سایت شما دسترسی داشته باشد از طریق پیوندهای داخلی ایجاد شده این کار را انجام می دهد.</p><p>اگر شما سایتی را به تازگی ایجاد کرده اید حتما برای آن نقشه سایت درست کنید تا به گوگل و موتورهای جستجو دیگر کمک کنید سریعتر اطلاعات سایت شما را دیده و لینک های آن را پیدا کنند .</p><p>مثلا در مواردی که سایت شما دارای صفحات زیادی میباشد و امکان اینکه گوگل تمامی صفحات را ایندکس کند و تمامی آن ها را پیدا کند بسیار سخت است. با نقشه سایت شما می توانید تمامی صفحات خود را معرفی کرده تا بتوانند وارد شوند.</p><p>&nbsp;</p><h3>ایجاد نقشه سایت برای وردپرس</h3><p>اگر شما از وردپرس برای سایت خود استفاده کرده اید می توانید از پلاگین یوست برای درست کردن&nbsp;site map خود استفاده کنید. این نقشه سایت به صورت خودکار به روز رسانی می شود و در هرزمانی که شما یک صفحه جدید و یا یک محصول جدید را به سایت خود اضافه کنید به صورت اتوماتکی به آن اضافه می شود. علاوه بر یوست&nbsp;yoast افزونه های دیگری نیز برای این کار از جمله&nbsp;google xml sitemap وجود دارد.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/sitemap-yoast_1597742723.jpg\"><figcaption>yoast sitemap</figcaption></figure><p>&nbsp;</p><h3>ایجاد نقشه سایت برای سایت</h3><p>برای ایجاد نقشه سایت حرفه ای شما می توانید از سایت هایی که در این زمینه فعالیت دارند مانند&nbsp;XML-Sitemaps.com استفاده کنید . این سایت ها می توانند با گرفتن ادرس سایت شما&nbsp;sitemap آن را برای شما ایجاد کنند. نقشه سایت به توجه به&nbsp;CSM مورد استفاده شما ایجاد می شود.&nbsp;</p><p>قبل از اینکه نقشه سایت خود را برای قرار دادن در وبمستر تولز بردارید نیاز هست که ابتدا به طور آن کامل آن را بررسی کنید. اگر تمامی صفحات سایت شما وجود داشت و همه چیز خوب به نظر می رسید نوبت آن رسیده است که نقشه سایت را به گوگل معرفی کنید.&nbsp;</p><p>&nbsp;</p><h3>ثبت نقشه سایت درgoogle search console</h3><p>برای اینکه نقشه سایت خود را در به گوگل معرفی کنید ابتدا وارد اکانت گوگل وبمستر تولز خود شوید. پس به بخش بفرست آن در کنار صفحه نگاه کنید&nbsp; و برروی گزینه&nbsp;sitemap کلیک کنید. اگر از قبل نقشه سایت ارسال کرده باشید در این قسمت قابل مشاهده می باشد. در غیر اینصورت آدرس نقشه سایت خود را در این قسمت وارد کرده و سپس بر روی دکمه&nbsp;submit کلیک نمایید.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/sitemap--search-console_1597742775.jpg\"></figure><h3>گزارش های نقشه سایت</h3><p>بعد از ارسال نقشه سایت شما و زمانی که خزنده های گوگل در سایت شما وارد شد و فهرست نقشه شما با موفقیت قرار گرفت وsuccess را مشاهده کردید، گزارش های مربوط به این بخش برای شما قابل مشاهده می شود.</p><p>بخش&nbsp;valid&nbsp;&nbsp;صفحات سایت شما هستند که هیچ مورد و خطایی ندارند – صفحات من که به صورت&nbsp;exclusive هستند را می توانیم مشاهده کنیم که به چه مشکلی برخورد کرده اند و آنها را رفع کنیم&nbsp; و در صورت نیاز آنها را از سایت مپ خود پاک کنیم. همچنین می توانیم خطاها و مشکلات سایت خود را هم پیدا کنیم. سایت ما دارای چند صفحه است و ما می خواهیم چند صفحه ایندکس شود و چند صفحه ایندکس شده است.</p><p>مثلا اگر سایت شما دارای 5000 صفحه باشد و در قسمت سرچ کنسول شما فقط می توانید 3000 مورد از آن را ببینید به این معنی است که گوگل سایت شما را به درستی ایندکس نمی کند و این صفحات در موتورهای جستجو شناخته نشده است. شما می توانید مشکل خود را پیدا کرده به طور مثال شاید در سایت شما صفحات تکراری وجود داشته باشد.</p><p>&nbsp;</p><h3>قراردادن سایت مپ درrobot.txt</h3><p>درصورتی که نقشه سایت شما با فایل&nbsp;robot.txt هماهنگی داشته باشد مشکلی در سایت شما نباید وجود داشته باشد. مثلا در&nbsp;robot.txt اگر تعدادی از صفحات را نوایندکس کرده اید و نمی خواهید آن ها را نمایش دهید و اما در سایت مپ شما وجود دارد تداخل بوجود خواهد امد و خطا ایجاد می شود.</p><p>&nbsp;</p><h3>نکات مهم نقشه سایت</h3><p>برای سایت های کوچک خود از چندین بخش سایت مپ استفاده کنید.</p><p>تاریخ های موجود در&nbsp;url شما باید اخرین اصلاح موجو باشد. زمانی که تغییرات مهمی در سایت ایجاد کردید ، تاریخ سایت مپ خود را تغییر دهید و نیازی نیست هر زمانی که تغییر کوچکی ایجاد کردید تاریخ را تغییر دهید.</p><p>نقشه سایت شما باید بهتر است کمتر از 50 مگابایت باشد زیرا تعدادی از موتورهای جستجو از جمله&nbsp;google&nbsp;&nbsp;و&nbsp;&nbsp;bing&nbsp;&nbsp;نقشه های تا حداکثر 50 مگابایت را قبول میکنند.</p><p>نقشه سایت&nbsp;html درست کنید و با این کار به کاربران خود کمک کنید به صفحات سایت شما دسترسی داشته باشند.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/Sitemap-html_1597742813.jpg\"></figure><p>در سایت مپ HTML شما می توانید مانند نمونه بالا لینک صفحات سایت خود را در فوتر یا بخشی از سایت قرار دهید تا کاربر به راحتی بتواند صفحه مورد نیاز خود را پیدا کند. اگر چه این بخش در گوگل اثر بخشی ندارد اما به دلیل اینکه باعث راحتی و استفاده بهتر از سایت شما می شود بنابراین گوگل نیز به این مسئله اهمیت می دهد.</p>',1,'2020-08-19 00:00:00','2020-08-18 13:58:48','2020-08-22 18:21:01','2',47,'نقشه سایت,سایت مپ','نقشه سایت چیست؟ و چرا مهم است ؟ ایجاد نقشه سایت برای وردپرس و حرفه ای - ثبت نقشه سایت در google search console - گزارش های نقشه سایت - قراردادن سایت مپ در robot.txt و نکات مهم نقشه سایت','{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/xmlsitemap-wordpress.jpg\",\"300\":\"\\/upload\\/images\\/2020\\/300_xmlsitemap-wordpress.jpg\",\"600\":\"\\/upload\\/images\\/2020\\/600_xmlsitemap-wordpress.jpg\",\"900\":\"\\/upload\\/images\\/2020\\/900_xmlsitemap-wordpress.jpg\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_xmlsitemap-wordpress.jpg\"}',18,0,'article',NULL,NULL),
	(59,'رستوران','رستوران',NULL,NULL,1,'2020-09-05 00:00:00','2020-09-04 14:46:48','2020-09-04 14:46:48','1',47,NULL,NULL,'{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/restaurant.png\",\"300\":\"\\/upload\\/images\\/2020\\/300_restaurant.png\",\"600\":\"\\/upload\\/images\\/2020\\/600_restaurant.png\",\"900\":\"\\/upload\\/images\\/2020\\/900_restaurant.png\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_restaurant.png\"}',0,0,NULL,NULL,NULL),
	(60,'فناوری اطلاعات','فناوری-اطلاعات',NULL,NULL,1,'2020-09-05 00:00:00','2020-09-04 14:47:23','2020-09-04 14:47:23','1',47,NULL,NULL,'{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/pc\",\"300\":\"\\/upload\\/images\\/2020\\/300_pc\",\"600\":\"\\/upload\\/images\\/2020\\/600_pc\",\"900\":\"\\/upload\\/images\\/2020\\/900_pc\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_pc\"}',0,0,NULL,NULL,NULL);

/*!40000 ALTER TABLE `contents` ENABLE KEYS */;
UNLOCK TABLES;


# Dump of table failed_jobs
# ------------------------------------------------------------

DROP TABLE IF EXISTS `failed_jobs`;

CREATE TABLE `failed_jobs` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `connection` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC;



# Dump of table menu_items
# ------------------------------------------------------------

DROP TABLE IF EXISTS `menu_items`;

CREATE TABLE `menu_items` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `label` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `link` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `parent` bigint(20) unsigned NOT NULL DEFAULT '0',
  `sort` int(11) NOT NULL DEFAULT '0',
  `class` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `menu` bigint(20) unsigned NOT NULL,
  `depth` int(11) NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `type` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT 'internal',
  PRIMARY KEY (`id`) USING BTREE,
  KEY `admin_menu_items_menu_foreign` (`menu`) USING BTREE,
  CONSTRAINT `admin_menu_items_menu_foreign` FOREIGN KEY (`menu`) REFERENCES `menus` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=30 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC;

LOCK TABLES `menu_items` WRITE;
/*!40000 ALTER TABLE `menu_items` DISABLE KEYS */;

INSERT INTO `menu_items` (`id`, `label`, `link`, `parent`, `sort`, `class`, `menu`, `depth`, `created_at`, `updated_at`, `type`)
VALUES
	(2,'خانه','/',0,0,NULL,1,0,'2020-04-17 07:50:36','2020-07-03 19:09:30','internal'),
	(7,'دسته بندی','دسته-بندی',0,1,NULL,1,0,'2020-07-03 19:13:52','2020-09-04 14:51:16','internal'),
	(19,'تعرفه','تعرفه',0,4,NULL,1,0,'2020-07-04 22:19:08','2020-09-04 14:51:42','internal'),
	(26,'درباره ما','درباره-ما',0,5,NULL,1,0,'2020-07-03 19:31:07','2020-09-04 14:51:42','internal'),
	(27,'تماس با ما','تماس-با-ما',0,6,NULL,1,0,'2020-08-01 23:02:53','2020-09-04 14:51:42','internal'),
	(28,'خودرو','خودرو',7,3,NULL,1,1,'2020-09-04 14:51:16','2020-09-04 14:51:42','external'),
	(29,'فروشگاه اینترنتی','فروشگاه-اینترنتی',7,2,NULL,1,1,'2020-09-04 14:51:33','2020-09-04 14:51:52','external');

/*!40000 ALTER TABLE `menu_items` ENABLE KEYS */;
UNLOCK TABLES;


# Dump of table menus
# ------------------------------------------------------------

DROP TABLE IF EXISTS `menus`;

CREATE TABLE `menus` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC;

LOCK TABLES `menus` WRITE;
/*!40000 ALTER TABLE `menus` DISABLE KEYS */;

INSERT INTO `menus` (`id`, `name`, `created_at`, `updated_at`)
VALUES
	(1,'منو اصلی','2020-04-17 07:10:38','2020-07-03 19:11:14');

/*!40000 ALTER TABLE `menus` ENABLE KEYS */;
UNLOCK TABLES;


# Dump of table migrations
# ------------------------------------------------------------

DROP TABLE IF EXISTS `migrations`;

CREATE TABLE `migrations` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `migration` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=75 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC;

LOCK TABLES `migrations` WRITE;
/*!40000 ALTER TABLE `migrations` DISABLE KEYS */;

INSERT INTO `migrations` (`id`, `migration`, `batch`)
VALUES
	(66,'2014_10_12_000000_create_users_table',1),
	(67,'2014_10_12_100000_create_password_resets_table',1),
	(68,'2019_08_19_000000_create_failed_jobs_table',1),
	(69,'2019_09_19_110427_create_conversations_table',1),
	(70,'2019_09_19_110627_create_clients_table',1),
	(71,'2019_10_01_122030_create_questions_table',1),
	(72,'2019_10_03_100816_create_bots_table',1),
	(73,'2017_08_11_073824_create_menus_wp_table',2),
	(74,'2017_08_11_074006_create_menu_items_wp_table',2);

/*!40000 ALTER TABLE `migrations` ENABLE KEYS */;
UNLOCK TABLES;


# Dump of table password_resets
# ------------------------------------------------------------

DROP TABLE IF EXISTS `password_resets`;

CREATE TABLE `password_resets` (
  `email` varchar(151) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  KEY `password_resets_email_index` (`email`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;



# Dump of table redirect_url
# ------------------------------------------------------------

DROP TABLE IF EXISTS `redirect_url`;

CREATE TABLE `redirect_url` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `url` text CHARACTER SET utf8 COLLATE utf8_general_ci,
  `redirect_to` text CHARACTER SET utf8 COLLATE utf8_general_ci,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8;

LOCK TABLES `redirect_url` WRITE;
/*!40000 ALTER TABLE `redirect_url` DISABLE KEYS */;

INSERT INTO `redirect_url` (`id`, `url`, `redirect_to`, `created_at`, `updated_at`)
VALUES
	(12,'/1','/وبلاگ','2020-08-25 10:27:07','2020-08-25 10:27:07'),
	(13,'/contact-us','/تماس-با-ما','2020-08-25 17:16:34','2020-08-25 17:16:34');

/*!40000 ALTER TABLE `redirect_url` ENABLE KEYS */;
UNLOCK TABLES;


# Dump of table users
# ------------------------------------------------------------

DROP TABLE IF EXISTS `users`;

CREATE TABLE `users` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL DEFAULT '',
  `email` varchar(151) NOT NULL DEFAULT '',
  `email_verified_at` datetime DEFAULT NULL,
  `password` varchar(255) NOT NULL DEFAULT '',
  `remember_token` varchar(100) DEFAULT NULL,
  `api_token` varchar(255) DEFAULT NULL,
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE KEY `users_email_unique` (`email`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;

INSERT INTO `users` (`id`, `name`, `email`, `email_verified_at`, `password`, `remember_token`, `api_token`, `date`)
VALUES
	(1,'admin','m@m.m',NULL,'$2y$10$CXDC/iH/ugEG4zCZdfgZLuNUB3rZ.opJoLH.dbEL7mPurnKMtHlTS','R6psDfsw84NcJoKB8N41kn3UK8UYw30WXtudzDTu0geyF7VgCDH1LNk4sPqs','czIj1y5DELSVG8dVmlG0yHvaKlMwuIFAIUT7UFzmA6O3qOBHbt','2019-10-21 16:55:03');

/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;



/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
