-- phpMyAdmin SQL Dump
-- version 4.9.5
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Sep 07, 2020 at 03:53 PM
-- Server version: 5.7.28-log
-- PHP Version: 7.3.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `tarhoweb_remotyadaka`
--

-- --------------------------------------------------------

--
-- Table structure for table `contents`
--

CREATE TABLE `contents` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(191) NOT NULL DEFAULT '',
  `slug` varchar(191) NOT NULL DEFAULT '',
  `brief_description` longtext,
  `description` longtext,
  `status` int(11) NOT NULL,
  `publish_date` datetime DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `type` varchar(2) DEFAULT NULL,
  `parent_id` int(11) DEFAULT '1',
  `meta_keywords` varchar(255) DEFAULT NULL,
  `meta_description` text,
  `images` text,
  `viewCount` int(11) NOT NULL DEFAULT '0',
  `commentCount` int(11) NOT NULL DEFAULT '0',
  `attr_type` varchar(255) DEFAULT NULL,
  `attr` text,
  `meta_title` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `contents`
--

INSERT INTO `contents` (`id`, `title`, `slug`, `brief_description`, `description`, `status`, `publish_date`, `created_at`, `updated_at`, `type`, `parent_id`, `meta_keywords`, `meta_description`, `images`, `viewCount`, `commentCount`, `attr_type`, `attr`, `meta_title`) VALUES
(22, 'سوئیچ و ریموت خودرو', 'سوئیچ-و-ریموت-خودرو', '<p>ارائه کلیه خدمات سوئیچ و ریموت خودرو از جمله ساخت - پروگرام - تراش کلید - تعریف - تعمیر - تعویض - کددهی - خام نمودن سوئیچ و... ویژه تمامی خودرو ها از جمله بنز - بی ام و - کیا - پورشه - هیوندا و ... می باشد.</p>', '<h3>سوئیچ و ریموت</h3><p>خدمات ما شامل ساخت ریموت<strong>&nbsp;</strong>و کددهی ریموت کیلس گو - ساخت کلید<strong>&nbsp;</strong>در صورت گم شدن و یدکی با دستگاه اتوماتیک - پاک کردن کد خطای<strong>&nbsp;</strong>با دستگاه دیاگ - تعویض قاب جدید<strong>&nbsp;</strong>و باطری ریموت - ساخت ریموت گمشده - ساخت کلید و ریموت در کمترین زمان - سفارش ریموت کی لس انواع مدل خودرو<strong>- </strong>ساخت ریموت و کی لس گو - باز کردن درب خودرو در کوتاهترین زمان ممکن - کددهی ریموت کلیدی و کی لس <strong>- </strong>ساخت و تراش کلید <strong>- </strong>کددهی ریموت بدون باز کردن کامپیوتر - غیرفعال سازی ریموت های گمشده <strong>- </strong>تعریف ریموت انواع سری های خودرو <strong>- </strong>ساخت کلید ،ست کامل ایموبلایزر <strong>- </strong>ساخت ریموت ،تعمیر قفل فرمان <strong>- </strong>ریموت ،ریموت یدک ،کپی ریموت خودرو <strong>- </strong>ساخت سوییچ ،سوئیچ خودرو ،کددهی سوئیچ ،تعریف سوئیچ <strong>- </strong>کلید و کلید یدک خودرو - کپی کلید خودرو می باشد.</p>', 1, '2020-04-17 00:00:00', '2020-04-16 15:24:08', '2020-09-07 12:10:27', '1', 0, 'ساخت سوئیچ خودرو,ساخت ریموت خودرو', 'ارائه کلیه خدمات سوئیچ و ریموت خودرو از جمله ساخت - پروگرام - تراش کلید - تعریف - تعمیر - تعویض - کددهی - خام نمودن سوئیچ و... ویژه تمامی خودرو ها از جمله بنز - بی ام و - کیا - پورشه - هیوندا و ... می باشد.', '{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/61qtiR8kTRL._AC_SL1200_.jpg\",\"300\":\"\\/upload\\/images\\/2020\\/300_61qtiR8kTRL._AC_SL1200_.jpg\",\"600\":\"\\/upload\\/images\\/2020\\/600_61qtiR8kTRL._AC_SL1200_.jpg\",\"900\":\"\\/upload\\/images\\/2020\\/900_61qtiR8kTRL._AC_SL1200_.jpg\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_61qtiR8kTRL._AC_SL1200_.jpg\"}', 293, 0, NULL, NULL, ''),
(32, 'درباره ما', 'درباره-ما', '<p>ریموت یدک - مرکز ساخت پروگرام کددهی سوئیچ و ریموت خودرو</p>', '<figure class=\"image\"><img src=\"https://remotyadak.ir/upload/images/2020/remotyadak-about-us_1599065671.jpg\" alt=\"درباره ریموت یدک\"></figure><p>ریموت یدک ارائه دهنده سرویس های ویژه سوئیچ و ریموت خودرو می باشد. شما می توانید برای بهره مندی از خدمات ما به صفحه تماس با ما رفته و با متخصصین ما برای ارائه خدمات مشاوره نمایید.</p>', 1, '2020-05-07 00:00:00', '2020-05-06 15:36:05', '2020-09-06 15:56:08', '1', 0, 'درباره ریموت یدک', 'درباره ما', '\"\"', 98, 0, NULL, NULL, NULL),
(33, 'تماس با ما', 'تماس-با-ما', '<p>تماس با ما</p>', '<p>شماره تماس: <a href=\"tel:02188421318\">۰۲۱۸۸۴۲۱۳۱۸</a></p><p>شماره همراه: <a href=\"tel:09331181877\">۰۹۳۳۱۱۸۱۸۷۷</a></p><p>تماس با پشتیبانی از ساعت ۸ تا ۲۴</p>', 1, '2020-05-07 00:00:00', '2020-05-06 15:37:38', '2020-09-06 15:55:12', '1', 0, NULL, 'تماس با ما', '\"\"', 58, 0, NULL, NULL, NULL),
(34, 'سوئیچ و ریموت بنز', 'سوئیچ-و-ریموت-بنز', '<p>ساخت سوئیچ بنز - تعریف و پروگرام ریموت بنز&nbsp; - ساخت سوئیچ یدک بنز&nbsp; - با زکردن درب خودرو بنز&nbsp; - تراش تیغه کلید بنز&nbsp; - کپی ریموت و کددهی سوئیچ بنز&nbsp; - خام نمودن کلید و ریموت بنز&nbsp;&nbsp;</p>', '<h3><strong>ساخت ریموت و سوئیچ بنز&nbsp;</strong></h3><p>ساخت سوئیچ و ریموت خودرو <strong>بنز</strong> به تخصص و تجربه بالایی در کنار استفاده از تجهیزات پیشرفته نیاز دارد و با توجه به این ‌که در هر زمانی از شبانه روز ممکن است مشکل برای سوئیچ و ریموت برای خودرو شما ایجاد شود برخی از متخصصان در این زمینه خدمات شبانه روزی را ارائه می دهند.&nbsp; از خدمات این مراکز می توان به ساخت سوئیچ <strong>بنز</strong> – ساخت و پروگرام ریموت <strong>بنز</strong> – تعریف ریموت جدید – کددهی و پاک کردن کد ریموت – باز کردن درب خودرو <strong>بنز</strong>&nbsp; در محل شما و ... اشاره نمود.</p><p>به دلیل اهمیتی که سوئیچ و ریموت در جهت بالا بردن امنیت خودرو شما دارد. می بایست در زمینه انتخاب مرکز تخصصی در این زمینه دقت لازم را داشته باشید. تخصص فرد در این زمینه برای ساخت سوئیچ و ریموت <strong>بنز</strong>&nbsp; و همینطور سابقه کار برای رفع مشکلات بعدی در زمینه امنیت خودرو و جلوگیری از اتلاف وقت شما بسیار مهم است. &nbsp;</p><h2>&nbsp;</h2><h3><strong>ساخت سوئیچ یدک بنز&nbsp;</strong></h3><p>ممکن است به خودرو خود نیاز داشته باشید و زمانی که به خودرو خود می رسید متوجه می شوید ریموت خود را گم کرده اید. اولین گزینه در زمانی که نیاز به سوئیچ <strong>بنز</strong>&nbsp; و ریموت <strong>بنز</strong>&nbsp; در هنگام بروز هر گونه مشکلی از جمله گم شدن، مفقود شدن یا شکستن و خراب شدن آن به ذهن می رسد. پیدا کردن یک مرکز معتبر و مطمئن با حضور متخصصین دارای مهارت های روز ویژه خودروهای هوشمند می باشد. درگذشته تعداد محدودی از خدمات دهندگان در این زمینه وجود داشت و سوئیچ و ریموت های قدیمی نیز ساده تر از ریموت های امروزی بودند.&nbsp;امروزه، پیشرفت‌های بسیار زیادی در طراحی و ساخت سوئیچ و ریموت <strong>بنز</strong>&nbsp; صورت گرفته است و انواع مختلفی از آن براساس نوع خودرو در بازار وجود دارد. این مسئله بیانگر پیچیده‌تر شدن فرایند تعویض و<strong> ساخت سوئیچ بنز</strong> است. از این رو مهم ترین گزینه انتخاب کلید سازی متخصص در زمینه خودرو شما براساس سابقه کار و همینطور تجهیزات و امکانات این مرکز می باشد.</p><p>&nbsp;</p><h3><strong>تعریف و پروگرام ریموت بنز&nbsp;</strong></h3><p>در صورتی <strong>سوئیچ و ریموت&nbsp;بنز</strong>&nbsp;شما نیاز به پروگرام دارد نیاز به حضور در مراکز متخصص دارید که تجهیزات و امکانات در این زمینه را دارا باشند . زیرا سوئیچ و ریموت <strong>بنز</strong>&nbsp;شما نیاز به تعریف و کددهی دارد و این خدمات علاوه بر اینکه فرد باید از تخصص کافی در این زمینه برخوردار باشد نیاز به امکانات کافی نیز دارد.</p><h4>&nbsp;</h4><h3><strong>کددهی ریموت بنز&nbsp;&nbsp;</strong></h3><p>سوئیچ و ریموت <strong>بنز</strong> اصل بسیار گران می باشد بنابراین برای رفع این مورد در صورت بروز هرگونه مشکل می توان از خدمات خام نمودن کلید <strong>بنز</strong>&nbsp;استفاده نمود . برای این خدمات تجهیزات مدرن مورد نیاز می باشد. برای تعریف ریموت ابتدا آن ها را خام کرده و کددهی جدید برای آنها انجام می شود و در اختیار مشتری قرار داده می شود.</p><h4>&nbsp;</h4><h3><strong>پاک کردن ریموت گمشده</strong></h3><p>اگر سوئیچ و ریموت خودرو&nbsp;<strong>بنز</strong>&nbsp;&nbsp;خود را گم کرده اید و یا از شما دزدیده شده است اولین اقدام شما تماس با متخصصین در این زمینه برای پاک کردن سوئیچ و ریموت شما می باشد. در برخی از خودرو ها و مدل های آن در صورتی که سوئیچ خود را از دست داده اید نیاز به دریافت کد و خارج کردن کامپیوتر خودرو شما نمی باشد و با دستگاه های مخصوص سوئیچ و ریموت های خودرو <strong>بنز </strong>شما پاک می شود اما در برخی از خودرو نیاز به خارج کردن کامپیوتر و کدهای آن می باشد. در صورت مواجه شدن با این مشکل با متخصصین و مراکز معتبر تماس حاصل فرمایید تا در مورد خدمات مورد نیاز شما مشاوره دریافت کنید.&nbsp;</p><h2>&nbsp;</h2><h3><strong>خدمات سوئیچ و ریموت بنز&nbsp;</strong></h3><ul><li>ساخت ریموت <strong>بنز</strong> و کددهی ریموت کیلس گو</li><li>ساخت کلید <strong>بنز</strong> در صورت گم شدن و یدکی با دستگاه اتوماتیک</li><li>پاک کردن کد خطای <strong>بنز</strong> با دستگاه دیاگ</li><li>تعویض قاب جدید <strong>بنز</strong> و باطری ریموت</li><li>ساخت ریموت گمشده <strong>بنز</strong></li><li>ساخت کلید و ریموت <strong>بنز</strong> در کمترین زمان</li><li>سفارش ریموت کی لس <strong>بنز</strong> انواع مدل <strong>بنز</strong></li><li>ساخت ریموت <strong>بنز</strong> کی لس گو</li><li>باز کردن درب <strong>بنز</strong> در کوتاهترین زمان ممکن</li><li>کددهی ریموت کلیدی و کی لس <strong>بنز</strong></li><li>ساخت و تراش کلید و <strong>بنز</strong></li><li>کددهی ریموت <strong>بنز </strong>بدون باز کردن کامپیوتر</li><li>غیرفعال سازی ریموت های گمشده <strong>بنز</strong></li><li>تعریف ریموت انواع سری های <strong>بنز</strong></li><li>ساخت کلید <strong>بنز</strong> ،ست کامل ایموبلایزر <strong>بنز</strong></li><li>ساخت ریموت <strong>بنز</strong> ،تعمیر قفل فرمان <strong>بنز</strong></li><li>ریموت <strong>بنز</strong> &nbsp;،ریموت یدک <strong>بنز</strong> ،کپی ریموت <strong>بنز</strong></li><li>ساخت سوییچ <strong>بنز&nbsp;</strong> ،سوئیچ <strong>بنز</strong> ،کددهی سوئیچ <strong>بنز</strong> ،تعریف سوئیچ <strong>بنز</strong></li><li>کلید <strong>بنز </strong>،کلید یدک &nbsp;مرسدس <strong>بنز</strong> &nbsp;،کپی کلید <strong>بنز</strong> &nbsp;،ساخت سوئیچ یدک <strong>بنز</strong> ،ساخت ریموت یدک <strong>بنز</strong> ،ساخت کلید یدک <strong>بنز</strong></li></ul><p>از جمله خدمات ویژه ما می توان به مشاوره تلفنی و حضوری ، ارائه لیست قیمت بر اساس خدمات مورد نیاز شما و مدل خودرو ،&nbsp;ارسال کارشناس برای بازدید در محل در تمامی مناطق تهران و در سراسر ایران ، ارائه &nbsp;خدمات در کوتاه‌ترین زمان ممکن به ‌صورت شبانه‌روزی حتی در ایام تعطیل، ضمانت و گارانتی محصولات و خدمات &nbsp;اشاره نمود.</p><p>&nbsp;</p><h3><strong>کپی سوئیچ و تراش تیغه کلید بنز&nbsp;&nbsp;</strong></h3><p>ریموت و سوئیچ های هوشمند امروزی اکثرا به صورت کی لس می باشند که در صورتی که دچار مشکل شوند حتما نیاز به <strong>بنز</strong>&nbsp; &nbsp;برای ساخت سوئیچ می باشد تا بتوان سوئیچ و ریموت <strong>بنز&nbsp;</strong> جدید ساخته شده را به سیستم کامپیوتر خودرو معرفی کرد. از جمله خدماتی که در مراکز تخصصی ساخت سوئیچ و ریموت <strong>بنز</strong>&nbsp; انجام می شود می توان به تراش تیغه کلید با تجهیزات مدرن نام برد. در این مرکز شما می توانید از این خدمات بهره مند شوید.</p><p>&nbsp;</p><h3><strong>باز کردن درب بنز&nbsp;</strong></h3><p>یکی دیگر از خدمات مراکز ساخت سوئیچ و ریموت باز کردن درب خودرو <strong>بنز &nbsp;</strong>می باشد. در صورتی که با همچین مشکلی مواجه شدید راحت ترین کار برای شما شکستن شیشه خودرو می باشد اما این بهترین راه نیست زیرا مراکز متخصص در این زمینه خدمات باز کردن درب خودرو <strong>بنز&nbsp;</strong> شما را بدون آسیب رسیدن به خودرو شما و با دستگاه های مدرن خود در این زمینه انجام می دهند.&nbsp;</p><p>&nbsp;</p><h3><strong>اطلاع از قیمت سوئیچ و ریموت</strong></h3><p>شما می توانید جهت اطلاع از قیمت های ما و همچنین مشاوره با تیم متخصص ما با ما تماس گرفته و سفارش خود را در هر زمانی از شبانه روز بصورت 24 ساعته و در سراسر ایران &nbsp;ثبت نمایید و از خدمات با کیفیت ما بهره مند شوید. ما توانسته ایم با بهترین کیفیت، &nbsp;اعتماد و اطمینان مشتریان بسیاری را به خود جلب کند.&nbsp;</p>', 1, '2020-06-03 00:00:00', '2020-06-02 20:31:34', '2020-09-07 11:54:20', '1', 22, 'ساخت سوئیچ بنز,ساخت ریموت بنز,سوئیچ یدک بنز,پروگرام سوئیچ بنز,کددهی ریموت بنز', 'ساخت سوئیچ بنز - تعریف و پروگرام ریموت بنز  - ساخت سوئیچ یدک بنز  - با زکردن درب خودرو بنز  - تراش تیغه کلید بنز  - کپی ریموت و کددهی سوئیچ بنز  - خام نمودن کلید و ریموت بنز  -  ریموت یدک', '{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/benz_.jpg\",\"300\":\"\\/upload\\/images\\/2020\\/300_benz_.jpg\",\"600\":\"\\/upload\\/images\\/2020\\/600_benz_.jpg\",\"900\":\"\\/upload\\/images\\/2020\\/900_benz_.jpg\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_benz_.jpg\"}', 168, 0, NULL, NULL, ''),
(35, 'سوئیچ و ریموت کیا', 'سوئیچ-و-ریموت-کیا', '<p>ساخت سوئیچ کیا - تعریف و پروگرام ریموت کیا&nbsp;- ساخت سوئیچ یدک کیا&nbsp;- با زکردن درب خودرو کیا&nbsp;- تراش تیغه کلید کیا&nbsp;- کپی ریموت و کددهی سوئیچ کیا&nbsp;- خام نمودن کلید و ریموت کیا&nbsp;</p>', '<h3><strong>ساخت ریموت و سوئیچ کیا</strong></h3><p>ساخت سوئیچ و ریموت خودرو <strong>کیا </strong>به تخصص و تجربه بالایی در کنار استفاده از تجهیزات پیشرفته نیاز دارد و با توجه به این ‌که در هر زمانی از شبانه روز ممکن است مشکل برای سوئیچ و ریموت برای خودرو شما ایجاد شود برخی از متخصصان در این زمینه خدمات شبانه روزی را ارائه می دهند.&nbsp; از خدمات این مراکز می توان به ساخت سوئیچ <strong>کیا&nbsp;</strong>– ساخت و پروگرام ریموت <strong>کیا&nbsp;</strong>– تعریف ریموت جدید – کددهی و پاک کردن کد ریموت – باز کردن درب خودرو <strong>کیا&nbsp;</strong>در محل شما و ... اشاره نمود.</p><p>به دلیل اهمیتی که سوئیچ و ریموت در جهت بالا بردن امنیت خودرو شما دارد. می بایست در زمینه انتخاب مرکز تخصصی در این زمینه دقت لازم را داشته باشید. تخصص فرد در این زمینه برای ساخت سوئیچ و ریموت <strong>کیا&nbsp;</strong>و همینطور سابقه کار برای رفع مشکلات بعدی در زمینه امنیت خودرو و جلوگیری از اتلاف وقت شما بسیار مهم است. &nbsp;</p><h2>&nbsp;</h2><h3><strong>ساخت سوئیچ یدک کیا</strong></h3><p>ممکن است به خودرو خود نیاز داشته باشید و زمانی که به خودرو خود می رسید متوجه می شوید ریموت خود را گم کرده اید. اولین گزینه در زمانی که نیاز به سوئیچ <strong>کیا&nbsp;</strong>و ریموت <strong>کیا&nbsp;</strong>در هنگام بروز هر گونه مشکلی از جمله گم شدن، مفقود شدن یا شکستن و خراب شدن آن به ذهن می رسد. پیدا کردن یک مرکز معتبر و مطمئن با حضور متخصصین دارای مهارت های روز ویژه خودروهای هوشمند می باشد. درگذشته تعداد محدودی از خدمات دهندگان در این زمینه وجود داشت و سوئیچ و ریموت های قدیمی نیز ساده تر از ریموت های امروزی بودند.&nbsp;امروزه، پیشرفت‌های بسیار زیادی در طراحی و ساخت سوئیچ و ریموت <strong>کیا&nbsp;</strong>صورت گرفته است و انواع مختلفی از آن براساس نوع خودرو در بازار وجود دارد. این مسئله بیانگر پیچیده‌تر شدن فرایند تعویض و<strong> ساخت سوئیچ کیا&nbsp;</strong>است. از این رو مهم ترین گزینه انتخاب کلید سازی متخصص در زمینه خودرو شما براساس سابقه کار و همینطور تجهیزات و امکانات این مرکز می باشد.</p><p>&nbsp;</p><h3><strong>تعریف و پروگرام ریموت کیا</strong></h3><p>در صورتی <strong>سوئیچ و ریموت&nbsp;کیا&nbsp;</strong>شما نیاز به پروگرام دارد نیاز به حضور در مراکز متخصص دارید که تجهیزات و امکانات در این زمینه را دارا باشند . زیرا سوئیچ و ریموت <strong>بنز</strong>&nbsp;شما نیاز به تعریف و کددهی دارد و این خدمات علاوه بر اینکه فرد باید از تخصص کافی در این زمینه برخوردار باشد نیاز به امکانات کافی نیز دارد.</p><h4>&nbsp;</h4><h3><strong>کددهی ریموت کیا</strong></h3><p>سوئیچ و ریموت <strong>کیا&nbsp;</strong>اصل بسیار گران می باشد بنابراین برای رفع این مورد در صورت بروز هرگونه مشکل می توان از خدمات خام نمودن کلید <strong>کیا&nbsp;</strong>استفاده نمود . برای این خدمات تجهیزات مدرن مورد نیاز می باشد. برای تعریف ریموت ابتدا آن ها را خام کرده و کددهی جدید برای آنها انجام می شود و در اختیار مشتری قرار داده می شود.</p><h4>&nbsp;</h4><h3><strong>پاک کردن ریموت گمشده</strong></h3><p>اگر سوئیچ و ریموت خودرو&nbsp;<strong>کیا&nbsp;</strong>خود را گم کرده اید و یا از شما دزدیده شده است اولین اقدام شما تماس با متخصصین در این زمینه برای پاک کردن سوئیچ و ریموت شما می باشد. در برخی از خودرو ها و مدل های آن در صورتی که سوئیچ خود را از دست داده اید نیاز به دریافت کد و خارج کردن کامپیوتر خودرو شما نمی باشد و با دستگاه های مخصوص سوئیچ و ریموت های خودرو <strong>بنز </strong>شما پاک می شود اما در برخی از خودرو نیاز به خارج کردن کامپیوتر و کدهای آن می باشد. در صورت مواجه شدن با این مشکل با متخصصین و مراکز معتبر تماس حاصل فرمایید تا در مورد خدمات مورد نیاز شما مشاوره دریافت کنید.&nbsp;</p><h2>&nbsp;</h2><h3><strong>خدمات سوئیچ و ریموت کیا</strong></h3><ul><li>ساخت ریموت <strong>کیا&nbsp;</strong>و کددهی ریموت کیلس گو</li><li>ساخت کلید <strong>کیا&nbsp;</strong>در صورت گم شدن و یدکی با دستگاه اتوماتیک</li><li>پاک کردن کد خطای <strong>کیا&nbsp;</strong>با دستگاه دیاگ</li><li>تعویض قاب جدید <strong>کیا&nbsp;</strong>و باطری ریموت</li><li>ساخت ریموت گمشده <strong>کیا&nbsp;</strong></li><li>ساخت کلید و ریموت <strong>کیا&nbsp;</strong>در کمترین زمان</li><li>سفارش ریموت کی لس <strong>کیا&nbsp;</strong>انواع مدل <strong>کیا&nbsp;</strong></li><li>ساخت ریموت <strong>کیا&nbsp;</strong>کی لس گو</li><li>باز کردن درب <strong>کیا&nbsp;</strong>در کوتاهترین زمان ممکن</li><li>کددهی ریموت کلیدی و کی لس <strong>کیا&nbsp;</strong></li><li>ساخت و تراش کلید و <strong>کیا&nbsp;</strong></li><li>کددهی ریموت <strong>کیا&nbsp;</strong>بدون باز کردن کامپیوتر</li><li>غیرفعال سازی ریموت های گمشده <strong>کیا&nbsp;</strong></li><li>تعریف ریموت انواع سری های <strong>کیا&nbsp;</strong></li><li>ساخت کلید <strong>کیا&nbsp;</strong>،ست کامل ایموبلایزر <strong>کیا&nbsp;</strong></li><li>ساخت ریموت <strong>کیا&nbsp;</strong>،تعمیر قفل فرمان <strong>کیا&nbsp;</strong></li><li>ریموت <strong>کیا&nbsp;</strong>،ریموت یدک <strong>کیا&nbsp;</strong>،کپی ریموت <strong>کیا&nbsp;</strong></li><li>ساخت سوییچ <strong>کیا&nbsp;</strong>،سوئیچ <strong>کیا&nbsp;</strong>،کددهی سوئیچ <strong>کیا </strong>،تعریف سوئیچ <strong>کیا&nbsp;</strong></li><li>کلید <strong>کیا&nbsp;</strong>،کلید یدک &nbsp;<strong>کیا&nbsp;</strong>،کپی کلید <strong>کیا&nbsp;</strong>،ساخت سوئیچ یدک <strong>کیا&nbsp;</strong>،ساخت ریموت یدک <strong>کیا&nbsp;</strong>،ساخت کلید یدک <strong>کیا&nbsp;</strong></li></ul><p>از جمله خدمات ویژه ما می توان به مشاوره تلفنی و حضوری ، ارائه لیست قیمت بر اساس خدمات مورد نیاز شما و مدل خودرو ،&nbsp;ارسال کارشناس برای بازدید در محل در تمامی مناطق تهران و در سراسر ایران ، ارائه &nbsp;خدمات در کوتاه‌ترین زمان ممکن به ‌صورت شبانه‌روزی حتی در ایام تعطیل، ضمانت و گارانتی محصولات و خدمات &nbsp;اشاره نمود.</p><p>&nbsp;</p><h3><strong>کپی سوئیچ و تراش تیغه کلید کیا</strong></h3><p>ریموت و سوئیچ های هوشمند امروزی اکثرا به صورت کی لس می باشند که در صورتی که دچار مشکل شوند حتما نیاز به <strong>کیا&nbsp;</strong>برای ساخت سوئیچ می باشد تا بتوان سوئیچ و ریموت <strong>کیا&nbsp;</strong>جدید ساخته شده را به سیستم کامپیوتر خودرو معرفی کرد. از جمله خدماتی که در مراکز تخصصی ساخت سوئیچ و ریموت <strong>کیا&nbsp;</strong>انجام می شود می توان به تراش تیغه کلید با تجهیزات مدرن نام برد. در این مرکز شما می توانید از این خدمات بهره مند شوید.</p><p>&nbsp;</p><h3><strong>باز کردن درب کیا</strong></h3><p>یکی دیگر از خدمات مراکز ساخت سوئیچ و ریموت باز کردن درب خودرو <strong>کیا&nbsp;</strong>می باشد. در صورتی که با همچین مشکلی مواجه شدید راحت ترین کار برای شما شکستن شیشه خودرو می باشد اما این بهترین راه نیست زیرا مراکز متخصص در این زمینه خدمات باز کردن درب خودرو <strong>کیا&nbsp;</strong>شما را بدون آسیب رسیدن به خودرو شما و با دستگاه های مدرن خود در این زمینه انجام می دهند.&nbsp;</p><p>&nbsp;</p><h3><strong>اطلاع از قیمت سوئیچ و ریموت</strong></h3><p>شما می توانید جهت اطلاع از قیمت های ما و همچنین مشاوره با تیم متخصص ما با ما تماس گرفته و سفارش خود را در هر زمانی از شبانه روز بصورت 24 ساعته و در سراسر ایران &nbsp;ثبت نمایید و از خدمات با کیفیت ما بهره مند شوید. ما توانسته ایم با بهترین کیفیت، &nbsp;اعتماد و اطمینان مشتریان بسیاری را به خود جلب کند.&nbsp;</p>', 1, '2020-06-04 00:00:00', '2020-06-03 14:56:18', '2020-09-07 12:07:45', '1', 22, 'ساخت سوئیچ کیا,ساخت ریموت کیا,سوئیچ یدک کیا,پروگرام سوئیچ کیا,کددهی ریموت کیا', 'ساخت سوئیچ کیا - تعریف و پروگرام ریموت کیا - ساخت سوئیچ یدک کیا - با زکردن درب خودرو کیا - تراش تیغه کلید کیا - کپی ریموت و کددهی سوئیچ کیا - خام نمودن کلید و ریموت کیا  - ریموت یدک', '{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/kia.jpg\",\"300\":\"\\/upload\\/images\\/2020\\/300_kia.jpg\",\"600\":\"\\/upload\\/images\\/2020\\/600_kia.jpg\",\"900\":\"\\/upload\\/images\\/2020\\/900_kia.jpg\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_kia.jpg\"}', 74, 0, NULL, NULL, ''),
(36, 'سوئیچ و ریموت هیوندا', 'سوئیچ-و-ریموت-هیوندا', '<p>ساخت سوئیچ هیوندا - تعریف و پروگرام ریموت هیوندا&nbsp;- ساخت سوئیچ یدک هیوندا&nbsp;- با زکردن درب خودرو هیوندا&nbsp;- تراش تیغه کلید هیوندا&nbsp;- کپی ریموت و کددهی سوئیچ هیوندا&nbsp;- خام نمودن کلید و ریموت هیوندا&nbsp;</p>', '<h3><strong>ساخت ریموت و سوئیچ هیوندا</strong></h3><p>ساخت سوئیچ و ریموت خودرو <strong>هیوندا </strong>به تخصص و تجربه بالایی در کنار استفاده از تجهیزات پیشرفته نیاز دارد و با توجه به این ‌که در هر زمانی از شبانه روز ممکن است مشکل برای سوئیچ و ریموت برای خودرو شما ایجاد شود برخی از متخصصان در این زمینه خدمات شبانه روزی را ارائه می دهند.&nbsp; از خدمات این مراکز می توان به ساخت سوئیچ <strong>هیوندا&nbsp;</strong>– ساخت و پروگرام ریموت <strong>هیوندا&nbsp;</strong>– تعریف ریموت جدید – کددهی و پاک کردن کد ریموت – باز کردن درب خودرو <strong>هیوندا&nbsp;</strong>در محل شما و ... اشاره نمود.</p><p>به دلیل اهمیتی که سوئیچ و ریموت در جهت بالا بردن امنیت خودرو شما دارد. می بایست در زمینه انتخاب مرکز تخصصی در این زمینه دقت لازم را داشته باشید. تخصص فرد در این زمینه برای ساخت سوئیچ و ریموت <strong>هیوندا&nbsp;</strong>و همینطور سابقه کار برای رفع مشکلات بعدی در زمینه امنیت خودرو و جلوگیری از اتلاف وقت شما بسیار مهم است. &nbsp;</p><h2>&nbsp;</h2><h3><strong>ساخت سوئیچ یدک هیوندا</strong></h3><p>ممکن است به خودرو خود نیاز داشته باشید و زمانی که به خودرو خود می رسید متوجه می شوید ریموت خود را گم کرده اید. اولین گزینه در زمانی که نیاز به سوئیچ <strong>هیوندا&nbsp;</strong>و ریموت <strong>هیوندا&nbsp;</strong>در هنگام بروز هر گونه مشکلی از جمله گم شدن، مفقود شدن یا شکستن و خراب شدن آن به ذهن می رسد. پیدا کردن یک مرکز معتبر و مطمئن با حضور متخصصین دارای مهارت های روز ویژه خودروهای هوشمند می باشد. درگذشته تعداد محدودی از خدمات دهندگان در این زمینه وجود داشت و سوئیچ و ریموت های قدیمی نیز ساده تر از ریموت های امروزی بودند.&nbsp;امروزه، پیشرفت‌های بسیار زیادی در طراحی و ساخت سوئیچ و ریموت <strong>هیوندا&nbsp;</strong>صورت گرفته است و انواع مختلفی از آن براساس نوع خودرو در بازار وجود دارد. این مسئله بیانگر پیچیده‌تر شدن فرایند تعویض و<strong> ساخت سوئیچ هیوندا&nbsp;</strong>است. از این رو مهم ترین گزینه انتخاب کلید سازی متخصص در زمینه خودرو شما براساس سابقه کار و همینطور تجهیزات و امکانات این مرکز می باشد.</p><p>&nbsp;</p><h3><strong>تعریف و پروگرام ریموت هیوندا</strong></h3><p>در صورتی <strong>سوئیچ و ریموت&nbsp;هیوندا&nbsp;</strong>شما نیاز به پروگرام دارد نیاز به حضور در مراکز متخصص دارید که تجهیزات و امکانات در این زمینه را دارا باشند . زیرا سوئیچ و ریموت <strong>هیوندا&nbsp;</strong>شما نیاز به تعریف و کددهی دارد و این خدمات علاوه بر اینکه فرد باید از تخصص کافی در این زمینه برخوردار باشد نیاز به امکانات کافی نیز دارد.</p><h4>&nbsp;</h4><h3><strong>کددهی ریموت هیوندا</strong></h3><p>سوئیچ و ریموت <strong>هیوندا&nbsp;</strong>اصل بسیار گران می باشد بنابراین برای رفع این مورد در صورت بروز هرگونه مشکل می توان از خدمات خام نمودن کلید <strong>هیوندا&nbsp;</strong>استفاده نمود . برای این خدمات تجهیزات مدرن مورد نیاز می باشد. برای تعریف ریموت ابتدا آن ها را خام کرده و کددهی جدید برای آنها انجام می شود و در اختیار مشتری قرار داده می شود.</p><h4>&nbsp;</h4><h3><strong>پاک کردن ریموت گمشده</strong></h3><p>اگر سوئیچ و ریموت خودرو&nbsp;<strong>هیوندا&nbsp;</strong>خود را گم کرده اید و یا از شما دزدیده شده است اولین اقدام شما تماس با متخصصین در این زمینه برای پاک کردن سوئیچ و ریموت شما می باشد. در برخی از خودرو ها و مدل های آن در صورتی که سوئیچ خود را از دست داده اید نیاز به دریافت کد و خارج کردن کامپیوتر خودرو شما نمی باشد و با دستگاه های مخصوص سوئیچ و ریموت های خودرو <strong>هیوندا&nbsp;</strong>شما پاک می شود اما در برخی از خودرو نیاز به خارج کردن کامپیوتر و کدهای آن می باشد. در صورت مواجه شدن با این مشکل با متخصصین و مراکز معتبر تماس حاصل فرمایید تا در مورد خدمات مورد نیاز شما مشاوره دریافت کنید.&nbsp;</p><h2>&nbsp;</h2><h3><strong>خدمات سوئیچ و ریموت هیوندا</strong></h3><ul><li>ساخت ریموت <strong>هیوندا&nbsp;</strong>و کددهی ریموت کیلس گو</li><li>ساخت کلید <strong>هیوندا&nbsp;</strong>در صورت گم شدن و یدکی با دستگاه اتوماتیک</li><li>پاک کردن کد خطای <strong>هیوندا&nbsp;</strong>با دستگاه دیاگ</li><li>تعویض قاب جدید <strong>هیوندا&nbsp;</strong>و باطری ریموت</li><li>ساخت ریموت گمشده <strong>هیوندا&nbsp;</strong></li><li>ساخت کلید و ریموت <strong>هیوندا&nbsp;</strong>در کمترین زمان</li><li>سفارش ریموت کی لس <strong>هیوندا&nbsp;</strong>انواع مدل <strong>هیوندا&nbsp;</strong></li><li>ساخت ریموت <strong>هیوندا&nbsp;</strong>کی لس گو</li><li>باز کردن درب <strong>هیوندا&nbsp;</strong>در کوتاهترین زمان ممکن</li><li>کددهی ریموت کلیدی و کی لس <strong>هیوندا&nbsp;</strong></li><li>ساخت و تراش کلید و <strong>هیوندا&nbsp;</strong></li><li>کددهی ریموت <strong>هیوندا&nbsp;</strong>بدون باز کردن کامپیوتر</li><li>غیرفعال سازی ریموت های گمشده <strong>هیوندا&nbsp;</strong></li><li>تعریف ریموت انواع سری های <strong>بنز</strong></li><li>ساخت کلید <strong>هیوندا&nbsp;</strong> ،ست کامل ایموبلایزر <strong>هیوندا&nbsp;</strong></li><li>ساخت ریموت <strong>هیوندا&nbsp;</strong>،تعمیر قفل فرمان <strong>هیوندا&nbsp;</strong></li><li>ریموت <strong>هیوندا&nbsp;</strong>،ریموت یدک <strong>هیوندا&nbsp;</strong>،کپی ریموت <strong>هیوندا&nbsp;</strong></li><li>ساخت سوییچ <strong>هیوندا&nbsp;</strong>،سوئیچ <strong>هیوندا&nbsp;</strong>،کددهی سوئیچ <strong>هیوندا&nbsp;</strong>،تعریف سوئیچ <strong>هیوندا&nbsp;</strong></li><li>کلید <strong>هیوندا&nbsp;</strong>،کلید یدک &nbsp;<strong>هیوندا&nbsp;</strong>،کپی کلید <strong>هیوندا&nbsp;</strong>،ساخت سوئیچ یدک <strong>هیوندا&nbsp;</strong>،ساخت ریموت یدک <strong>هیوندا&nbsp;</strong>،ساخت کلید یدک <strong>هیوندا&nbsp;</strong></li></ul><p>از جمله خدمات ویژه ما می توان به مشاوره تلفنی و حضوری ، ارائه لیست قیمت بر اساس خدمات مورد نیاز شما و مدل خودرو ،&nbsp;ارسال کارشناس برای بازدید در محل در تمامی مناطق تهران و در سراسر ایران ، ارائه &nbsp;خدمات در کوتاه‌ترین زمان ممکن به ‌صورت شبانه‌روزی حتی در ایام تعطیل، ضمانت و گارانتی محصولات و خدمات &nbsp;اشاره نمود.</p><p>&nbsp;</p><h3><strong>کپی سوئیچ و تراش تیغه کلید هیوندا</strong></h3><p>ریموت و سوئیچ های هوشمند امروزی اکثرا به صورت کی لس می باشند که در صورتی که دچار مشکل شوند حتما نیاز به <strong>هیوندا&nbsp;</strong>برای ساخت سوئیچ می باشد تا بتوان سوئیچ و ریموت <strong>هیوندا&nbsp;</strong>جدید ساخته شده را به سیستم کامپیوتر خودرو معرفی کرد. از جمله خدماتی که در مراکز تخصصی ساخت سوئیچ و ریموت <strong>هیوندا&nbsp;</strong>انجام می شود می توان به تراش تیغه کلید با تجهیزات مدرن نام برد. در این مرکز شما می توانید از این خدمات بهره مند شوید.</p><p>&nbsp;</p><h3><strong>باز کردن درب هیوندا</strong></h3><p>یکی دیگر از خدمات مراکز ساخت سوئیچ و ریموت باز کردن درب خودرو <strong>هیوندا&nbsp;</strong>می باشد. در صورتی که با همچین مشکلی مواجه شدید راحت ترین کار برای شما شکستن شیشه خودرو می باشد اما این بهترین راه نیست زیرا مراکز متخصص در این زمینه خدمات باز کردن درب خودرو <strong>هیوندا&nbsp;</strong>شما را بدون آسیب رسیدن به خودرو شما و با دستگاه های مدرن خود در این زمینه انجام می دهند.&nbsp;</p><p>&nbsp;</p><h3><strong>اطلاع از قیمت سوئیچ و ریموت</strong></h3><p>شما می توانید جهت اطلاع از قیمت های ما و همچنین مشاوره با تیم متخصص ما با ما تماس گرفته و سفارش خود را در هر زمانی از شبانه روز بصورت 24 ساعته و در سراسر ایران &nbsp;ثبت نمایید و از خدمات با کیفیت ما بهره مند شوید. ما توانسته ایم با بهترین کیفیت، &nbsp;اعتماد و اطمینان مشتریان بسیاری را به خود جلب کند.&nbsp;</p>', 1, '2020-06-04 00:00:00', '2020-06-03 15:03:20', '2020-09-06 15:56:31', '1', 22, 'ساخت سوئیچ هیوندا,ساخت ریموت هیوندا,سوئیچ یدک هیوندا,پروگرام سوئیچ هیوندا,کددهی ریموت هیوندا', 'ساخت سوئیچ هیوندا - تعریف و پروگرام ریموت هیوندا - ساخت سوئیچ یدک هیوندا - با زکردن درب خودرو هیوندا - تراش تیغه کلید هیوندا - کپی ریموت و کددهی سوئیچ هیوندا - خام نمودن کلید و ریموت هیوندا  - ریموت یدک', '{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/HYUndai.jpg\",\"300\":\"\\/upload\\/images\\/2020\\/300_HYUndai.jpg\",\"600\":\"\\/upload\\/images\\/2020\\/600_HYUndai.jpg\",\"900\":\"\\/upload\\/images\\/2020\\/900_HYUndai.jpg\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_HYUndai.jpg\"}', 68, 0, NULL, NULL, ''),
(37, 'سوئیچ و ریموت پورشه', 'سوئیچ-و-ریموت-پورشه', '<p>ساخت سوئیچ پورشه - تعریف و پروگرام ریموت پورشه&nbsp;- ساخت سوئیچ یدک پورشه&nbsp;- با زکردن درب خودرو پورشه&nbsp;- تراش تیغه کلید پورشه&nbsp;- کپی ریموت و کددهی سوئیچ پورشه&nbsp;- خام نمودن کلید و ریموت پورشه&nbsp;</p>', '<h3><strong>ساخت ریموت و سوئیچ پورشه</strong></h3><p>ساخت سوئیچ و ریموت خودرو <strong>پورشه </strong>به تخصص و تجربه بالایی در کنار استفاده از تجهیزات پیشرفته نیاز دارد و با توجه به این ‌که در هر زمانی از شبانه روز ممکن است مشکل برای سوئیچ و ریموت برای خودرو شما ایجاد شود برخی از متخصصان در این زمینه خدمات شبانه روزی را ارائه می دهند.&nbsp; از خدمات این مراکز می توان به ساخت سوئیچ <strong>پورشه&nbsp;</strong>– ساخت و پروگرام ریموت <strong>پورشه&nbsp;</strong>– تعریف ریموت جدید – کددهی و پاک کردن کد ریموت – باز کردن درب خودرو <strong>پورشه&nbsp;</strong>در محل شما و ... اشاره نمود.</p><p>به دلیل اهمیتی که سوئیچ و ریموت در جهت بالا بردن امنیت خودرو شما دارد. می بایست در زمینه انتخاب مرکز تخصصی در این زمینه دقت لازم را داشته باشید. تخصص فرد در این زمینه برای ساخت سوئیچ و ریموت <strong>پورشه&nbsp;</strong>و همینطور سابقه کار برای رفع مشکلات بعدی در زمینه امنیت خودرو و جلوگیری از اتلاف وقت شما بسیار مهم است. &nbsp;</p><h2>&nbsp;</h2><h3><strong>ساخت سوئیچ یدک پورشه</strong></h3><p>ممکن است به خودرو خود نیاز داشته باشید و زمانی که به خودرو خود می رسید متوجه می شوید ریموت خود را گم کرده اید. اولین گزینه در زمانی که نیاز به سوئیچ <strong>پورشه&nbsp;</strong>و ریموت <strong>پورشه&nbsp;</strong>در هنگام بروز هر گونه مشکلی از جمله گم شدن، مفقود شدن یا شکستن و خراب شدن آن به ذهن می رسد. پیدا کردن یک مرکز معتبر و مطمئن با حضور متخصصین دارای مهارت های روز ویژه خودروهای هوشمند می باشد. درگذشته تعداد محدودی از خدمات دهندگان در این زمینه وجود داشت و سوئیچ و ریموت های قدیمی نیز ساده تر از ریموت های امروزی بودند.&nbsp;امروزه، پیشرفت‌های بسیار زیادی در طراحی و ساخت سوئیچ و ریموت <strong>پورشه&nbsp;</strong>صورت گرفته است و انواع مختلفی از آن براساس نوع خودرو در بازار وجود دارد. این مسئله بیانگر پیچیده‌تر شدن فرایند تعویض و<strong> ساخت سوئیچ پورشه&nbsp;</strong>است. از این رو مهم ترین گزینه انتخاب کلید سازی متخصص در زمینه خودرو شما براساس سابقه کار و همینطور تجهیزات و امکانات این مرکز می باشد.</p><p>&nbsp;</p><h3><strong>تعریف و پروگرام ریموت پورشه</strong></h3><p>در صورتی <strong>سوئیچ و ریموت&nbsp;پورشه&nbsp;</strong>شما نیاز به پروگرام دارد نیاز به حضور در مراکز متخصص دارید که تجهیزات و امکانات در این زمینه را دارا باشند . زیرا سوئیچ و ریموت <strong>پورشه&nbsp;</strong>شما نیاز به تعریف و کددهی دارد و این خدمات علاوه بر اینکه فرد باید از تخصص کافی در این زمینه برخوردار باشد نیاز به امکانات کافی نیز دارد.</p><h4>&nbsp;</h4><h3><strong>کددهی ریموت پورشه</strong></h3><p>سوئیچ و ریموت <strong>پورشه&nbsp;</strong>اصل بسیار گران می باشد بنابراین برای رفع این مورد در صورت بروز هرگونه مشکل می توان از خدمات خام نمودن کلید <strong>پورشه&nbsp;</strong>استفاده نمود . برای این خدمات تجهیزات مدرن مورد نیاز می باشد. برای تعریف ریموت ابتدا آن ها را خام کرده و کددهی جدید برای آنها انجام می شود و در اختیار مشتری قرار داده می شود.</p><h4>&nbsp;</h4><h3><strong>پاک کردن ریموت گمشده</strong></h3><p>اگر سوئیچ و ریموت خودرو&nbsp;<strong>پورشه&nbsp;</strong>خود را گم کرده اید و یا از شما دزدیده شده است اولین اقدام شما تماس با متخصصین در این زمینه برای پاک کردن سوئیچ و ریموت شما می باشد. در برخی از خودرو ها و مدل های آن در صورتی که سوئیچ خود را از دست داده اید نیاز به دریافت کد و خارج کردن کامپیوتر خودرو شما نمی باشد و با دستگاه های مخصوص سوئیچ و ریموت های خودرو <strong>پورشه&nbsp;</strong>شما پاک می شود اما در برخی از خودرو نیاز به خارج کردن کامپیوتر و کدهای آن می باشد. در صورت مواجه شدن با این مشکل با متخصصین و مراکز معتبر تماس حاصل فرمایید تا در مورد خدمات مورد نیاز شما مشاوره دریافت کنید.&nbsp;</p><h2>&nbsp;</h2><h3><strong>خدمات سوئیچ و ریموت پورشه</strong></h3><ul><li>ساخت ریموت <strong>پورشه&nbsp;</strong>و کددهی ریموت کیلس گو</li><li>ساخت کلید <strong>پورشه&nbsp;</strong>در صورت گم شدن و یدکی با دستگاه اتوماتیک</li><li>پاک کردن کد خطای <strong>پورشه&nbsp;</strong>با دستگاه دیاگ</li><li>تعویض قاب جدید <strong>پورشه&nbsp;</strong>و باطری ریموت</li><li>ساخت ریموت گمشده <strong>پورشه&nbsp;</strong></li><li>ساخت کلید و ریموت <strong>پورشه&nbsp;</strong>در کمترین زمان</li><li>سفارش ریموت کی لس <strong>پورشه&nbsp;</strong>انواع مدل <strong>پورشه&nbsp;</strong></li><li>ساخت ریموت <strong>پورشه&nbsp;</strong>کی لس گو</li><li>باز کردن درب <strong>پورشه&nbsp;</strong>در کوتاهترین زمان ممکن</li><li>کددهی ریموت کلیدی و کی لس <strong>پورشه&nbsp;</strong></li><li>ساخت و تراش کلید و <strong>پورشه&nbsp;</strong></li><li>کددهی ریموت <strong>پورشه&nbsp;</strong>بدون باز کردن کامپیوتر</li><li>غیرفعال سازی ریموت های گمشده <strong>پورشه&nbsp;</strong></li><li>تعریف ریموت انواع سری های <strong>پورشه&nbsp;</strong></li><li>ساخت کلید <strong>پورشه&nbsp;</strong>،ست کامل ایموبلایزر <strong>پورشه&nbsp;</strong></li><li>ساخت ریموت <strong>پورشه&nbsp;</strong>،تعمیر قفل فرمان <strong>پورشه&nbsp;</strong></li><li>ریموت <strong>پورشه&nbsp;</strong>،ریموت یدک <strong>پورشه&nbsp;</strong>،کپی ریموت <strong>پورشه&nbsp;</strong></li><li>ساخت سوییچ <strong>پورشه&nbsp;</strong>،سوئیچ <strong>پورشه&nbsp;</strong>،کددهی سوئیچ <strong>پورشه&nbsp;</strong>،تعریف سوئیچ <strong>پورشه&nbsp;</strong></li><li>کلید <strong>پورشه&nbsp;</strong>،کلید یدک &nbsp;<strong>پورشه&nbsp;</strong>،کپی کلید <strong>پورشه&nbsp;</strong>،ساخت سوئیچ یدک <strong>پورشه&nbsp;</strong>،ساخت ریموت یدک <strong>پورشه&nbsp;</strong>،ساخت کلید یدک <strong>پورشه&nbsp;</strong></li></ul><p>از جمله خدمات ویژه ما می توان به مشاوره تلفنی و حضوری ، ارائه لیست قیمت بر اساس خدمات مورد نیاز شما و مدل خودرو ،&nbsp;ارسال کارشناس برای بازدید در محل در تمامی مناطق تهران و در سراسر ایران ، ارائه &nbsp;خدمات در کوتاه‌ترین زمان ممکن به ‌صورت شبانه‌روزی حتی در ایام تعطیل، ضمانت و گارانتی محصولات و خدمات &nbsp;اشاره نمود.</p><p>&nbsp;</p><h3><strong>کپی سوئیچ و تراش تیغه کلید پورشه</strong></h3><p>ریموت و سوئیچ های هوشمند امروزی اکثرا به صورت کی لس می باشند که در صورتی که دچار مشکل شوند حتما نیاز به <strong>پورشه&nbsp;</strong>برای ساخت سوئیچ می باشد تا بتوان سوئیچ و ریموت <strong>پورشه&nbsp;</strong>جدید ساخته شده را به سیستم کامپیوتر خودرو معرفی کرد. از جمله خدماتی که در مراکز تخصصی ساخت سوئیچ و ریموت <strong>پورشه&nbsp;</strong>انجام می شود می توان به تراش تیغه کلید با تجهیزات مدرن نام برد. در این مرکز شما می توانید از این خدمات بهره مند شوید.</p><p>&nbsp;</p><h3><strong>باز کردن درب پورشه</strong></h3><p>یکی دیگر از خدمات مراکز ساخت سوئیچ و ریموت باز کردن درب خودرو <strong>پورشه&nbsp;</strong>می باشد. در صورتی که با همچین مشکلی مواجه شدید راحت ترین کار برای شما شکستن شیشه خودرو می باشد اما این بهترین راه نیست زیرا مراکز متخصص در این زمینه خدمات باز کردن درب خودرو <strong>پورشه&nbsp;</strong>شما را بدون آسیب رسیدن به خودرو شما و با دستگاه های مدرن خود در این زمینه انجام می دهند.&nbsp;</p><p>&nbsp;</p><h3><strong>اطلاع از قیمت سوئیچ و ریموت</strong></h3><p>شما می توانید جهت اطلاع از قیمت های ما و همچنین مشاوره با تیم متخصص ما با ما تماس گرفته و سفارش خود را در هر زمانی از شبانه روز بصورت 24 ساعته و در سراسر ایران &nbsp;ثبت نمایید و از خدمات با کیفیت ما بهره مند شوید. ما توانسته ایم با بهترین کیفیت، &nbsp;اعتماد و اطمینان مشتریان بسیاری را به خود جلب کند.&nbsp;</p>', 1, '2020-06-05 00:00:00', '2020-06-04 10:07:22', '2020-09-06 15:58:35', '1', 22, 'ساخت سوئیچ پورشه,ساخت ریموت پورشه,سوئیچ یدک پورشه,کددهی ریموت پورشه,پروگرام سوئیچ پورشه', 'ساخت سوئیچ پورشه - تعریف و پروگرام ریموت پورشه - ساخت سوئیچ یدک پورشه - با زکردن درب خودرو پورشه - تراش تیغه کلید پورشه - کپی ریموت و کددهی سوئیچ پورشه - خام نمودن کلید و ریموت پورشه  - ریموت یدک', '{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/porsche.jpg\",\"300\":\"\\/upload\\/images\\/2020\\/300_porsche.jpg\",\"600\":\"\\/upload\\/images\\/2020\\/600_porsche.jpg\",\"900\":\"\\/upload\\/images\\/2020\\/900_porsche.jpg\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_porsche.jpg\"}', 68, 0, NULL, NULL, ''),
(38, 'سوئیچ و ریموت بی ام و', 'سوئیچ-و-ریموت-بی-ام-و', '<p>ساخت سوئیچ بی ام و - تعریف و پروگرام ریموت بی ام و - ساخت سوئیچ یدک بی ام و - با زکردن درب خودرو - تراش تیغه کلید بی ام و - کپی ریموت و کددهی سوئیچ بی ام و - خام نمودن کلید و ریموت بی ام و&nbsp;</p>', '<h3><strong>ساخت ریموت و سوئیچ بی ام و</strong></h3><p>ساخت سوئیچ و ریموت خودرو <strong>بی ام و</strong> به تخصص و تجربه بالایی در کنار استفاده از تجهیزات پیشرفته نیاز دارد و با توجه به این ‌که در هر زمانی از شبانه روز ممکن است مشکل برای سوئیچ و ریموت برای خودرو شما ایجاد شود برخی از متخصصان در این زمینه خدمات شبانه روزی را ارائه می دهند.&nbsp; از خدمات این مراکز می توان به ساخت سوئیچ <strong>بی ام و</strong> – ساخت و پروگرام ریموت <strong>بی ام و</strong> – تعریف ریموت جدید – کددهی و پاک کردن کد ریموت – باز کردن درب خودرو <strong>بی ام و</strong> در محل شما و ... اشاره نمود.</p><p>به دلیل اهمیتی که سوئیچ و ریموت در جهت بالا بردن امنیت خودرو شما دارد. می بایست در زمینه انتخاب مرکز تخصصی در این زمینه دقت لازم را داشته باشید. تخصص فرد در این زمینه برای ساخت سوئیچ و ریموت <strong>بی ام و</strong> و همینطور سابقه کار برای رفع مشکلات بعدی در زمینه امنیت خودرو و جلوگیری از اتلاف وقت شما بسیار مهم است. &nbsp;</p><h2>&nbsp;</h2><h3><strong>ساخت سوئیچ یدک بی ام و</strong></h3><p>ممکن است به خودرو خود نیاز داشته باشید و زمانی که به خودرو خود می رسید متوجه می شوید ریموت خود را گم کرده اید. اولین گزینه در زمانی که نیاز به سوئیچ <strong>بی ام و</strong> و ریموت <strong>بی ام و</strong> در هنگام بروز هر گونه مشکلی از جمله گم شدن، مفقود شدن یا شکستن و خراب شدن آن به ذهن می رسد. پیدا کردن یک مرکز معتبر و مطمئن با حضور متخصصین دارای مهارت های روز ویژه خودروهای هوشمند می باشد. درگذشته تعداد محدودی از خدمات دهندگان در این زمینه وجود داشت و سوئیچ و ریموت های قدیمی نیز ساده تر از ریموت های امروزی بودند.&nbsp;امروزه، پیشرفت‌های بسیار زیادی در طراحی و ساخت سوئیچ و ریموت <strong>بی ام و</strong> صورت گرفته است و انواع مختلفی از آن براساس نوع خودرو در بازار وجود دارد. این مسئله بیانگر پیچیده‌تر شدن فرایند تعویض و<strong> ساخت سوئیچ بی ام و</strong> است. از این رو مهم ترین گزینه انتخاب کلید سازی متخصص در زمینه خودرو شما براساس سابقه کار و همینطور تجهیزات و امکانات این مرکز می باشد.</p><p>&nbsp;</p><h3><strong>تعریف و پروگرام ریموت بی ام و</strong></h3><p>در صورتی <strong>سوئیچ و ریموت&nbsp;بی ام و</strong>&nbsp;شما نیاز به پروگرام دارد نیاز به حضور در مراکز متخصص دارید که تجهیزات و امکانات در این زمینه را دارا باشند . زیرا سوئیچ و ریموت <strong>بی ام و</strong>&nbsp;شما نیاز به تعریف و کددهی دارد و این خدمات علاوه بر اینکه فرد باید از تخصص کافی در این زمینه برخوردار باشد نیاز به امکانات کافی نیز دارد.</p><h4>&nbsp;</h4><h3><strong>کددهی ریموت بی ام و&nbsp;</strong></h3><p>سوئیچ و ریموت <strong>بی ام و</strong> اصل بسیار گران می باشد بنابراین برای رفع این مورد در صورت بروز هرگونه مشکل می توان از خدمات خام نمودن کلید <strong>بی ام و</strong> استفاده نمود . برای این خدمات تجهیزات مدرن مورد نیاز می باشد. برای تعریف ریموت ابتدا آن ها را خام کرده و کددهی جدید برای آنها انجام می شود و در اختیار مشتری قرار داده می شود.</p><h4>&nbsp;</h4><h3><strong>پاک کردن ریموت گمشده</strong></h3><p>اگر سوئیچ و ریموت خودرو&nbsp;<strong>بی ام و</strong>&nbsp;خود را گم کرده اید و یا از شما دزدیده شده است اولین اقدام شما تماس با متخصصین در این زمینه برای پاک کردن سوئیچ و ریموت شما می باشد. در برخی از خودرو ها و مدل های آن در صورتی که سوئیچ خود را از دست داده اید نیاز به دریافت کد و خارج کردن کامپیوتر خودرو شما نمی باشد و با دستگاه های مخصوص سوئیچ و ریموت های خودرو <strong>بی ام و </strong>شما پاک می شود اما در برخی از خودرو نیاز به خارج کردن کامپیوتر و کدهای آن می باشد. در صورت مواجه شدن با این مشکل با متخصصین و مراکز معتبر تماس حاصل فرمایید تا در مورد خدمات مورد نیاز شما مشاوره دریافت کنید.&nbsp;</p><h2>&nbsp;</h2><h3><strong>خدمات سوئیچ و ریموت بی ام و</strong></h3><ul><li>ساخت ریموت <strong>بی ام و</strong> و کددهی ریموت کیلس گو</li><li>ساخت کلید <strong>بی ام و</strong> در صورت گم شدن و یدکی با دستگاه اتوماتیک</li><li>پاک کردن کد خطای <strong>بی ام و</strong> با دستگاه دیاگ</li><li>تعویض قاب جدید <strong>بی ام و</strong> و باطری ریموت</li><li>ساخت ریموت گمشده <strong>بی ام و</strong></li><li>ساخت کلید و ریموت <strong>بی ام و</strong> در کمترین زمان</li><li>سفارش ریموت کی لس <strong>بی ام و</strong> انواع مدل <strong>بی ام و</strong></li><li>ساخت ریموت <strong>بی ام و</strong> کی لس گو</li><li>باز کردن درب <strong>بی ام و</strong> در کوتاهترین زمان ممکن</li><li>کددهی ریموت کلیدی و کی لس <strong>بی ام و</strong></li><li>ساخت و تراش کلید و <strong>بی ام و</strong></li><li>کددهی ریموت <strong>بی ام و</strong> بدون باز کردن کامپیوتر</li><li>غیرفعال سازی ریموت های گمشده <strong>بی ام و</strong></li><li>تعریف ریموت انواع سری های <strong>بی ام و</strong></li><li>ساخت کلید <strong>بی ام و</strong> ،ست کامل ایموبلایزر <strong>بی ام و</strong></li><li>ساخت ریموت <strong>بی ام و</strong> ،تعمیر قفل فرمان <strong>بی ام و</strong></li><li>ریموت <strong>بی ام و</strong> &nbsp;،ریموت یدک <strong>بی ام و</strong> ،کپی ریموت <strong>بی ام و</strong></li><li>ساخت سوییچ <strong>بی ام و</strong> ،سوئیچ <strong>بی ام و</strong> ،کددهی سوئیچ <strong>بی ام و</strong> ،تعریف سوئیچ <strong>بی ام و</strong></li><li>کلید <strong>بی ام و</strong> ،کلید یدک <strong>بی ام و</strong> &nbsp;،کپی کلید <strong>بی ام و</strong> &nbsp;،ساخت سوئیچ یدک <strong>بی ام و</strong> ،ساخت ریموت یدک <strong>بی ام و</strong> ،ساخت کلید یدک <strong>بی ام و</strong></li></ul><p>از جمله خدمات ویژه ما می توان به مشاوره تلفنی و حضوری ، ارائه لیست قیمت بر اساس خدمات مورد نیاز شما و مدل خودرو ،&nbsp;ارسال کارشناس برای بازدید در محل در تمامی مناطق تهران و در سراسر ایران ، ارائه &nbsp;خدمات در کوتاه‌ترین زمان ممکن به ‌صورت شبانه‌روزی حتی در ایام تعطیل، ضمانت و گارانتی محصولات و خدمات &nbsp;اشاره نمود.</p><p>&nbsp;</p><h3><strong>کپی سوئیچ و تراش تیغه کلید بی ام و&nbsp;</strong></h3><p>ریموت و سوئیچ های هوشمند امروزی اکثرا به صورت کی لس می باشند که در صورتی که دچار مشکل شوند حتما نیاز به <strong>بی ام و</strong> &nbsp;برای ساخت سوئیچ می باشد تا بتوان سوئیچ و ریموت <strong>بی ام و</strong> جدید ساخته شده را به سیستم کامپیوتر خودرو معرفی کرد. از جمله خدماتی که در مراکز تخصصی ساخت سوئیچ و ریموت <strong>بی ام و</strong> انجام می شود می توان به تراش تیغه کلید با تجهیزات مدرن نام برد. در این مرکز شما می توانید از این خدمات بهره مند شوید.</p><p>&nbsp;</p><h3><strong>باز کردن درب بی ام و</strong></h3><p>یکی دیگر از خدمات مراکز ساخت سوئیچ و ریموت باز کردن درب خودرو <strong>بی ام و </strong>می باشد. در صورتی که با همچین مشکلی مواجه شدید راحت ترین کار برای شما شکستن شیشه خودرو می باشد اما این بهترین راه نیست زیرا مراکز متخصص در این زمینه خدمات باز کردن درب خودرو <strong>بی ام و</strong> شما را بدون آسیب رسیدن به خودرو شما و با دستگاه های مدرن خود در این زمینه انجام می دهند.&nbsp;</p><p>&nbsp;</p><h3><strong>اطلاع از قیمت سوئیچ و ریموت</strong></h3><p>شما می توانید جهت اطلاع از قیمت های ما و همچنین مشاوره با تیم متخصص ما با ما تماس گرفته و سفارش خود را در هر زمانی از شبانه روز بصورت 24 ساعته و در سراسر ایران &nbsp;ثبت نمایید و از خدمات با کیفیت ما بهره مند شوید. ما توانسته ایم با بهترین کیفیت، &nbsp;اعتماد و اطمینان مشتریان بسیاری را به خود جلب کند.&nbsp;</p>', 1, '2020-06-06 00:00:00', '2020-06-05 11:42:19', '2020-09-06 15:55:59', '1', 22, 'پروگرام کددهی تعریف و ساخت سوئیچ و ریموت بی ام و | ریموت یدک', 'ساخت سوئیچ بی ام و - تعریف و پروگرام ریموت بی ام و - ساخت سوئیچ یدک بی ام و - با زکردن درب خودرو - تراش تیغه کلید بی ام و - کپی ریموت و کددهی سوئیچ بی ام و - خام نمودن کلید و ریموت بی ام و  - ریموت یدک', '{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/bmw.JPG\",\"300\":\"\\/upload\\/images\\/2020\\/300_bmw.JPG\",\"600\":\"\\/upload\\/images\\/2020\\/600_bmw.JPG\",\"900\":\"\\/upload\\/images\\/2020\\/900_bmw.JPG\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_bmw.JPG\"}', 57, 0, NULL, NULL, '');

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `connection` text NOT NULL,
  `queue` text NOT NULL,
  `payload` longtext NOT NULL,
  `exception` longtext NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

-- --------------------------------------------------------

--
-- Table structure for table `menus`
--

CREATE TABLE `menus` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL DEFAULT '',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `menus`
--

INSERT INTO `menus` (`id`, `name`, `created_at`, `updated_at`) VALUES
(1, 'm', '2020-04-17 02:40:38', '2020-04-17 02:40:42'),
(2, 'test', '2020-04-17 00:00:33', '2020-04-17 00:00:33'),
(4, 'tttt', '2020-04-17 03:11:21', '2020-04-17 03:11:21');

-- --------------------------------------------------------

--
-- Table structure for table `menu_items`
--

CREATE TABLE `menu_items` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `label` varchar(255) NOT NULL DEFAULT '',
  `link` varchar(255) NOT NULL DEFAULT '',
  `parent` bigint(20) UNSIGNED NOT NULL DEFAULT '0',
  `sort` int(11) NOT NULL DEFAULT '0',
  `class` varchar(255) DEFAULT NULL,
  `menu` bigint(20) UNSIGNED NOT NULL,
  `depth` int(11) NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `type` varchar(100) DEFAULT 'internal'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `menu_items`
--

INSERT INTO `menu_items` (`id`, `label`, `link`, `parent`, `sort`, `class`, `menu`, `depth`, `created_at`, `updated_at`, `type`) VALUES
(7, 'سوئیچ و ریموت', 'سوئیچ-و-ریموت-خودرو', 0, 1, NULL, 1, 0, '2020-08-01 19:17:15', '2020-08-02 13:13:07', 'internal'),
(11, 'خانه', '/', 0, 0, NULL, 1, 0, '2020-08-01 19:18:13', '2020-08-02 13:13:07', 'internal'),
(14, 'درباره ما', 'درباره-ما', 0, 7, NULL, 1, 0, '2020-08-01 19:19:02', '2020-09-02 16:48:11', 'internal'),
(15, 'تماس با ما', 'تماس-با-ما', 0, 8, NULL, 1, 0, '2020-08-01 19:19:11', '2020-09-02 16:48:31', 'internal'),
(16, 'سوئیچ و ریموت بنز', 'سوئیچ-و-ریموت-بنز', 7, 2, NULL, 1, 1, '2020-08-02 13:09:44', '2020-08-02 13:13:07', 'internal'),
(17, 'سوئیچ و ریموت کیا', 'سوئیچ-و-ریموت-کیا', 7, 3, NULL, 1, 1, '2020-08-02 13:10:08', '2020-08-02 13:13:07', 'internal'),
(18, 'سوئیچ و ریموت هیوندا', 'سوئیچ-و-ریموت-هیوندا', 7, 4, NULL, 1, 1, '2020-08-02 13:10:23', '2020-08-02 13:13:07', 'internal'),
(19, 'سوئیچ و ریموت پورشه', 'سوئیچ-و-ریموت-پورشه', 7, 5, NULL, 1, 1, '2020-08-02 13:10:40', '2020-08-02 13:13:07', 'internal'),
(20, 'سوئیچ و ریموت بی ام و', 'سوئیچ-و-ریموت-بی-ام-و', 7, 6, NULL, 1, 1, '2020-08-02 13:11:02', '2020-08-02 13:13:07', 'internal');

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL DEFAULT '',
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(66, '2014_10_12_000000_create_users_table', 1),
(67, '2014_10_12_100000_create_password_resets_table', 1),
(68, '2019_08_19_000000_create_failed_jobs_table', 1),
(69, '2019_09_19_110427_create_conversations_table', 1),
(70, '2019_09_19_110627_create_clients_table', 1),
(71, '2019_10_01_122030_create_questions_table', 1),
(72, '2019_10_03_100816_create_bots_table', 1),
(73, '2017_08_11_073824_create_menus_wp_table', 2),
(74, '2017_08_11_074006_create_menu_items_wp_table', 2);

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(151) NOT NULL DEFAULT '',
  `token` varchar(255) NOT NULL DEFAULT '',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

-- --------------------------------------------------------

--
-- Table structure for table `redirect_url`
--

CREATE TABLE `redirect_url` (
  `id` int(11) UNSIGNED NOT NULL,
  `url` text,
  `redirect_to` text,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `redirect_url`
--

INSERT INTO `redirect_url` (`id`, `url`, `redirect_to`, `created_at`, `updated_at`) VALUES
(14, '/ساخت-سوئیچ', '/سوئیچ-و-ریموت-خودرو', '2020-08-25 17:35:00', '2020-08-25 17:35:00'),
(15, '/درباره', '/درباره-ما', '2020-09-02 16:47:50', '2020-09-02 16:47:50');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL DEFAULT '',
  `email` varchar(151) NOT NULL DEFAULT '',
  `email_verified_at` datetime DEFAULT NULL,
  `password` varchar(255) NOT NULL DEFAULT '',
  `remember_token` varchar(100) DEFAULT NULL,
  `api_token` varchar(255) DEFAULT NULL,
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `email_verified_at`, `password`, `remember_token`, `api_token`, `date`) VALUES
(1, 'admin', 'm@m.m', NULL, '$2y$10$CXDC/iH/ugEG4zCZdfgZLuNUB3rZ.opJoLH.dbEL7mPurnKMtHlTS', 'rd3M0y0ieLpYo2hDucvN5HP083fZoiet9WUesih0ec3TC9GaeS4DyRurY6HR', 'czIj1y5DELSVG8dVmlG0yHvaKlMwuIFAIUT7UFzmA6O3qOBHbt', '2019-10-21 13:25:03');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `contents`
--
ALTER TABLE `contents`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Indexes for table `menus`
--
ALTER TABLE `menus`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Indexes for table `menu_items`
--
ALTER TABLE `menu_items`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `admin_menu_items_menu_foreign` (`menu`) USING BTREE;

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- Indexes for table `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`) USING BTREE;

--
-- Indexes for table `redirect_url`
--
ALTER TABLE `redirect_url`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `users_email_unique` (`email`) USING BTREE;

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `contents`
--
ALTER TABLE `contents`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `menus`
--
ALTER TABLE `menus`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `menu_items`
--
ALTER TABLE `menu_items`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=75;

--
-- AUTO_INCREMENT for table `redirect_url`
--
ALTER TABLE `redirect_url`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `menu_items`
--
ALTER TABLE `menu_items`
  ADD CONSTRAINT `admin_menu_items_menu_foreign` FOREIGN KEY (`menu`) REFERENCES `menus` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
