-- phpMyAdmin SQL Dump
-- version 4.9.11
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Mar 03, 2023 at 09:15 AM
-- Server version: 5.7.41-log
-- PHP Version: 7.4.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `tarhoweb_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `comments`
--

CREATE TABLE `comments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `parent_id` int(11) NOT NULL DEFAULT '0',
  `content_id` bigint(20) UNSIGNED NOT NULL DEFAULT '0',
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `comment` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` int(11) NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `companies`
--

CREATE TABLE `companies` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL DEFAULT '0',
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `manager` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `sale_manager` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `address` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `city` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `province` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `mobile` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `phone` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `site` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `whatsapp` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `telegram` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `instagram` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `logo` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `company_contents`
--

CREATE TABLE `company_contents` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `company_id` bigint(20) UNSIGNED NOT NULL DEFAULT '0',
  `content_id` bigint(20) UNSIGNED NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `contacts`
--

CREATE TABLE `contacts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `lastname` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `comment` text COLLATE utf8mb4_unicode_ci,
  `status` int(11) NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `contents`
--

CREATE TABLE `contents` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `type` tinyint(4) NOT NULL DEFAULT '0',
  `slug` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `brief_description` longtext COLLATE utf8mb4_unicode_ci,
  `description` longtext COLLATE utf8mb4_unicode_ci,
  `parent_id` int(11) NOT NULL DEFAULT '0',
  `meta_title` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `meta_keywords` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `meta_description` text COLLATE utf8mb4_unicode_ci,
  `images` text COLLATE utf8mb4_unicode_ci,
  `viewCount` int(11) NOT NULL DEFAULT '0',
  `commentCount` int(11) NOT NULL DEFAULT '0',
  `attr_type` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `attr` text COLLATE utf8mb4_unicode_ci,
  `publish_date` date DEFAULT NULL,
  `status` int(11) NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `contents`
--

INSERT INTO `contents` (`id`, `title`, `type`, `slug`, `brief_description`, `description`, `parent_id`, `meta_title`, `meta_keywords`, `meta_description`, `images`, `viewCount`, `commentCount`, `attr_type`, `attr`, `publish_date`, `status`, `created_at`, `updated_at`) VALUES
(34, 'طراحی سایت', 1, 'طراحی-سایت', NULL, NULL, 0, NULL, NULL, NULL, '\"\"', 1476, 0, 'html', '{\"template_name\":\"CustomDesign\"}', '2020-07-04', 1, '2020-07-03 14:43:06', '2023-03-02 03:43:51'),
(35, 'درباره ما', 1, 'درباره-ما', NULL, '<p>ما سعی داریم از طریق ایده های خلاقانه و استراتژی هایی که قلب و ذهن مخاطبان شما را به خود جلب می کند ، ارزش دارایی های شرکت شما را به مشتریان ارائه دهیم. ما متعهد هستیم که ترکیب کاملی از استعداد خلاق و تفکر استراتژیک را به مشتریان خود ارائه دهیم تا هر پروژه موفقیت بزرگی کسب کند. ما برند شما را بررسی می کنیم و تعیین می کنیم چه چیزی مخاطب شما را تحریک می کند و چه چیزی می تواند پروژه شما را متمایز و منحصر به فرد جلوه دهد. ما در آژانس طراحی و بازاریابی دیجیتال وب سایت طرح و وب بر این باوریم</p><p>که خدمات اصلی شما باید به روایت های انگیزشی ترجمه شوند و این دقیقا ً همان کاری است که ما می کنیم تا شما بدرخشید.</p>', 0, NULL, NULL, NULL, '\"\"', 918, 0, NULL, NULL, '2020-07-04', 1, '2020-07-03 15:00:27', '2023-03-02 03:43:29'),
(36, 'طراحی سایت وردپرس', 1, 'طراحی-سایت-وردپرس', NULL, NULL, 34, NULL, NULL, NULL, '\"\"', 742, 0, 'html', '{\"template_name\":\"WordpressWebDesign\"}', '2020-07-04', 1, '2020-07-03 17:54:52', '2023-03-02 19:21:34'),
(37, 'طراحی سایت حرفه ای', 1, 'طراحی-سایت-حرفه-ای', NULL, NULL, 34, NULL, NULL, NULL, '\"\"', 1277, 0, 'html', '{\"template_name\":\"ProDesign\"}', '2020-07-04', 1, '2020-07-03 21:12:51', '2023-03-02 03:44:02'),
(38, 'نمونه طراحی سایت', 1, 'نمونه-طراحی-سایت', NULL, NULL, 34, 'نمونه طراحی سایت | طرح و وب', 'نمونه سایت های طراحی شده توسط شرکت طرح و وب', 'نمونه سایت های طراحی شده توسط شرکت طرح و وب', '\"\"', 1320, 0, 'html', '{\"template_name\":\"WebDesignResume\"}', '2020-07-05', 1, '2020-07-04 16:28:33', '2023-03-02 03:44:13'),
(39, 'تعرفه', 1, 'تعرفه', NULL, NULL, 0, NULL, NULL, NULL, '\"\"', 1161, 0, NULL, NULL, '2020-07-05', 1, '2020-07-04 17:48:54', '2023-03-02 03:42:45'),
(40, 'تعرفه سئو سایت', 1, 'تعرفه-سئو-سایت', NULL, NULL, 39, NULL, NULL, NULL, '\"\"', 1277, 0, 'html', '{\"template_name\":\"PackageSeo\"}', '2020-07-05', 1, '2020-07-04 17:51:01', '2023-03-02 03:42:56'),
(41, 'تعرفه طراحی سایت', 1, 'تعرفه-طراحی-سایت', NULL, NULL, 39, NULL, NULL, NULL, '\"\"', 1193, 0, 'html', '{\"template_name\":\"PackageDevelope\"}', '2020-07-05', 1, '2020-07-04 17:52:25', '2023-03-03 01:32:31'),
(42, 'سئو سایت', 1, 'سئو-سایت', NULL, NULL, 0, NULL, NULL, NULL, '\"\"', 952, 0, 'html', '{\"template_name\":\"Seo\"}', '2020-07-11', 1, '2020-07-10 14:47:45', '2023-03-02 10:23:21'),
(43, 'نمونه کار سئو', 1, 'نمونه-کار-سئو', NULL, NULL, 42, 'نمونه کار سئو', 'نمونه کار سئو', 'نمونه کار سئو', '\"\"', 1061, 0, 'html', '{\"template_name\":\"SeoPortfolio\"}', '2020-07-11', 1, '2020-07-10 14:53:14', '2023-03-02 14:27:31'),
(44, 'وبلاگ', 1, 'وبلاگ', '<p>شما می توانید با آموزش تکنیک های مقدماتی و پیشرفته مهارت های لازم را برای بالا بردن رتبه سایت خود در گوگل و همینطور بازار کسب و کار بدست آورید.</p>', '<h3>آموزش سئو</h3><p>طرح و وب آموزش سئو از دوره مقدماتی تا پیشرفته را در بلاگ خود قرار می دهد. شما می توانید از ابتدا نکات سئو را براساس به روزترین مطالب آموزش ببینید و همینطور دوره های پیشرفته&nbsp;را نیز دنبال کنید. از این آموزش ها برای بهبود رتبه سایت خود در گوگل استفاده کنید. کلمات کلیدی برای سایت خود پیدا کنید ، رقبای خود را تحلیل کنید و بک لینک های آنها را مورد بررسی قرار دهید . رتبه آنها و میزان اعتبار سایت آن ها را ببینید. سرعت سایت خود را بهبود دهید و حجم آن را کم کنید. تصاویر ، فیلم ها و گالری خود را سئو کنید تا خزنده های گوگل بهتر شما را پیدا کنند. با اصطلاحات سئوآشنا شده و برای سایت خود بک لینک و ریپورتاژ ایجاد کنید.&nbsp;</p><p>دسته بندی مطالب در بلاگ طرح و وب شامل :</p><ul><li>سئو اولیه و آموزش های برای شروع سئو</li><li>استراتژی کلمات کلیدی</li><li>بهینه سازی استراتژی سئو مطالب</li><li>سئو تکنیکال</li><li>بک لینک سازی و بالا بردن رتبه سایت</li><li>ابزار ها و نرم افزار های سئو سایت</li><li>تجربه کاربری</li><li>برنامه نویسی</li></ul>', 0, 'آموزش سئو | یادگیری سئو مقدماتی تا پیشرفته رایگان  | طرح و وب', 'آموزش مقدماتی سئو,آموزش پیشرفته سئو,آموزش رایگان سئو', 'شما می توانید با آموزش تکنیک های مقدماتی و پیشرفته مهارت های لازم را برای بالا بردن رتبه سایت خود در گوگل و همینطور بازار کسب و کار بدست آورید.', '\"\"', 1244, 0, NULL, NULL, '2020-07-15', 1, '2020-07-14 16:16:33', '2023-03-02 03:44:35'),
(46, 'نکات اولیه راه اندازی expressJs', 2, 'نکات-اولیه-راه-اندازی-expressJs', '<p>برای یاد گیری express نیاز به موارد پیش نیاز هست.</p>', '<figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/Screen Shot 2020-07-28 at 8.18.54 PM_1595952172.png\"></figure><p>موارد پیش نیاز برای شروع کار با فریم ورک محبوب express:</p><ul><li>نصب node , npm</li><li>آشنایی route</li><li>آشنایی با mvc</li></ul><p>برای اجرای فایل اصلی حتما از دستور npm start استفاده شود. تا از پوشه bin فایل www اجرا شود.</p>', 69, 'نکات اولیه راه اندازی expressJs | طرح و وب', 'آموزش node,طرح و وب', 'نکات اولیه راه اندازی expressJs برای راه اندازی سایت با backend نود - در این سایت همچنین نحوه بهینه سازی سایت از نظر seo هم آموزش داده میشود.', '{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/express-js.png\",\"small\":\"\\/upload\\/images\\/2020\\/small_express-js.png\",\"medium\":\"\\/upload\\/images\\/2020\\/medium_express-js.png\",\"large\":\"\\/upload\\/images\\/2020\\/large_express-js.png\"},\"thumb\":\"\\/upload\\/images\\/2020\\/small_express-js.png\"}', 335, 0, 'article', '{\"rate\":\"5\"}', '2020-07-21', 1, '2020-07-20 13:30:47', '2023-03-01 01:47:21'),
(47, 'سئو تکنیکال', 1, 'سئو-تکنیکال', '<p>یکی از بخش های مهم در سئو سایت تکنیکال می باشد. زمانی که شما در این زمینه سایت خود را بهینه سازی نکرده باشید نمی توانید حتی با محتوای بسیار جالب و اصولی رتبه را کسب کنید. اما برای اینکه بتوانید سایت خود را از نظر سئو تکنیکال بهینه سازی کنید نیاز هست تا با index ، url، پارامترها و موارد دیگر آشنایی داشته باشید.&nbsp;</p>', '<p>یکی از بخش های مهم در سئو سایت تکنیکال می باشد. زمانی که شما در این زمینه سایت خود را بهینه سازی نکرده باشید نمی توانید حتی با محتوای بسیار جالب و اصولی رتبه را کسب کنید. اما برای اینکه بتوانید سایت خود را از نظر سئو تکنیکال بهینه سازی کنید نیاز هست تا با index ، url، پارامترها و موارد دیگر آشنایی داشته باشید.&nbsp;</p><ul><li>شما باید با ساختار و معماری سایت آشنایی داشته باشید تا سایت خود را از نظر تکنیال بهینه سازی کنید.</li><li>سایت مپ چیست ؟ و چه استفاد دارد؟ همه چیزهایی که در رابطه با سایت مپ باید بدانید را می توانید بخوانید.</li><li>بودجه خزیدن یا crawl budget چیست؟ و چه کمکی به ما در رتبه گرفتن سایت می کند.</li><li>چگونه می توانیم سرعت سایت خود را بهینه سازی کنیم .</li><li>robot.txt &nbsp;چیست؟ هر چیزی که نیاز هست در این زمینه بدانید ما به شما می گوییم.</li><li>محتوای تکراری یا duplicate content چیست؟ چرا برای سئو بد هست و راه خلاصی از آن را به شما می گوییم.</li></ul>', 44, 'سئو تکنیکال | طرح و وب', 'سئو تکنیکال,بهینه سازی سایت تکنیکال', 'یکی از بخش های مهم در سئو سایت تکنیکال می باشد. زمانی که شما در این زمینه سایت خود را بهینه سازی نکرده باشید نمی توانید حتی با محتوای بسیار جالب و اصولی رتبه را کسب کنید. اما برای اینکه بتوانید سایت خود را از نظر سئو تکنیکال بهینه سازی کنید نیاز هست تا با index ، url، پارامترها و موارد دیگر آشنایی داشته باشید.', '\"\"', 654, 0, NULL, NULL, '2020-07-21', 1, '2020-07-20 14:53:06', '2023-03-02 19:21:27'),
(48, 'لینک سازی', 1, 'لینک-سازی', NULL, NULL, 44, NULL, NULL, NULL, '\"\"', 536, 0, NULL, NULL, '2020-07-21', 1, '2020-07-20 14:55:26', '2023-03-02 19:21:40'),
(49, 'استراتژی کلمات کلیدی', 1, 'استراتژی-کلمات-کلیدی', '<p>برای پیدا کردن کلمت کلیدی مناسب شما نیاز به استراتژی درست در این زمینه دارید. شما باید اطلاعات لازم را در زمینه چگونگی پیدا کردن کلمات کلیدی ، ابزارهای مناسب در این زمینه ، چگونگی استفاده از کلید واژه در محتوا و میزان استفاده از آن ، انواع کلمات کلیدی ،پیدا کردن کلمات کلیدی دارای رقابت ، میزان سختی کلمات کلیدی بدست آورده و همینطور با کلید واژه های دم بلند و یا طولانی آشنا شوید.&nbsp;</p>', '<p>برای پیدا کردن کلمت کلیدی مناسب شما نیاز به استراتژی درست در این زمینه دارید. شما باید اطلاعات لازم را در زمینه چگونگی پیدا کردن کلمات کلیدی ، ابزارهای مناسب در این زمینه ، چگونگی استفاده از کلید واژه در محتوا و میزان استفاده از آن ، انواع کلمات کلیدی ،پیدا کردن کلمات کلیدی دارای رقابت ، میزان سختی کلمات کلیدی بدست آورده و همینطور با کلید واژه های دم بلند و یا طولانی آشنا شوید.&nbsp;</p><ul><li>کلمه کلیدی در سئو چی هست و اینکه چه نکاتی را برای تحقیق عبارات باید مدنظر قرار دهیم.</li><li>راهنمایی برای پیدا کردن کلمات دارای رقابت و راه های پیدا کردن این کلمات</li><li>آموزش مرحله به مرحله برای انتخاب یک کلمه کلیدی برای محتوا ، مقاله و محصولات خود</li><li>چگونه می توان کلمات طولانی و به اصطلاح long tail keyword را برای سایت خود پیدا کرده و از آنها استفاده کنیم.</li></ul><p>&nbsp;</p>', 44, NULL, 'استراتژِی کلمات کلیدی,راهنمای استفاده از کلمات کلیدی', 'برای پیدا کردن کلمت کلیدی مناسب شما نیاز به استراتژی درست در این زمینه دارید. شما باید اطلاعات لازم را در زمینه چگونگی پیدا کردن کلمات کلیدی ، ابزارهای مناسب در این زمینه ، چگونگی استفاده از کلید واژه در محتوا و میزان استفاده از آن ، انواع کلمات کلیدی ،پیدا کردن کلمات کلیدی دارای رقابت ، میزان سختی کلمات کلیدی بدست آورده و همینطور با کلید واژه های دم بلند و یا طولانی آشنا شوید.', '\"\"', 511, 0, NULL, NULL, '2020-07-21', 1, '2020-07-20 14:55:56', '2023-03-02 19:21:05'),
(50, 'اصول اولیه سئو - SEO basics', 1, 'اصول-اولیه-سئو', '<p>اگر می خواهید ترافیک سایت خود را افزایش دهید بهینه سازی وبسایت بهترین روش برای هدایت بازدید کننده به سایت می باشد.بر طبق آمار آخیر ۵۷٪ ترافیک وبسایت ها از موتور جستجوی گوگل منشا می گیرد.بنابراین&nbsp;SEO یا بهینه سازی وبسایت مهمترین امر در حال حاضر برای افزایش ترافیک طبیعی به سایت می باشد.در این بخش تمامی نکاتی که لازم است درباره سئو اولیه مانند آشنایی با کارکرد موتورهای جستجو&nbsp;, فاکتور های کلیدی رتبه بندی گوگل و غیره را بدانید&nbsp;,توضیح خواهیم داد.</p>', '<p>اگر می خواهید ترافیک سایت خود را افزایش دهید بهینه سازی وبسایت بهترین روش برای هدایت بازدید کننده به سایت می باشد.بر طبق آمار آخیر ۵۷٪ ترافیک وبسایت ها از موتور جستجوی گوگل منشا می گیرد.بنابراین&nbsp;SEO یا بهینه سازی وبسایت مهمترین امر در حال حاضر برای افزایش ترافیک طبیعی به سایت می باشد.در این بخش تمامی نکاتی که لازم است درباره سئو اولیه مانند آشنایی با کارکرد موتورهای جستجو&nbsp;, فاکتور های کلیدی رتبه بندی گوگل و غیره را بدانید&nbsp;,توضیح خواهیم داد. عناوین به شرح زیر می باشد:</p><ul><li>سئو یا SEO چیست</li><li>فرق SEO با SEM چیست</li><li>فاکتورهای رتبه بندی موتورهای جستجو</li><li>طراحی سایت User-friendly</li></ul><p>&nbsp;</p>', 44, NULL, NULL, NULL, '\"\"', 658, 0, NULL, NULL, '2020-07-21', 1, '2020-07-20 14:56:13', '2023-03-02 19:21:13'),
(51, 'بهینه سازی و استراتژی سئو مطالب', 1, 'بهینه-سازی-و-استراتژی-سئو-مطالب', '<p>برای اینکه بتوانید در گوگل برای سایت خود رتبه بندی کسب کنید نیاز به یک محتوا شگفت انگیز و مطابق با نیاز مشتری را ایجاد کنید. بعد از ایجاد محتوا مورد نظر آن را برای موتور های جستجو بهینه سازی کنید. &nbsp;چگونه می توان این کار را انجام داد؟ ما به شما آموزش خواهیم داد که محتوا مورد نظر خود را ایجاد و آن را برای کاربران بهینه نمایید. ما استراتژی برای این کار را به شما معرفی میکنیم تا بتوانید مطالب خود را سئو کنید.</p>', '<p>برای اینکه بتوانید در گوگل برای سایت خود رتبه بندی کسب کنید نیاز به یک محتوا شگفت انگیز و مطابق با نیاز مشتری را ایجاد کنید. بعد از ایجاد محتوا مورد نظر آن را برای موتور های جستجو بهینه سازی کنید. &nbsp;چگونه می توان این کار را انجام داد؟ ما به شما آموزش خواهیم داد که محتوا مورد نظر خود را ایجاد و آن را برای کاربران بهینه نمایید. ما استراتژی برای این کار را به شما معرفی میکنیم تا بتوانید مطالب خود را سئو کنید.</p><p>مطالبی را که در این بخش به شما آموزش می دهیم :</p><ul><li>شامل &nbsp;ایجاد و نوشتن یک مطلب سئو شده &nbsp;&nbsp;</li><li>نحوه آدرس دهی URL مناسب در سئو سایت&nbsp;</li><li>لینک های داخلی مناسب برای سئو&nbsp;</li><li>Rich Snippets چیست و تاثیر آن بر سئو سایت&nbsp;</li><li>محتوای معنایی در سئو و یا semantic SEO&nbsp;</li><li>کلمات کلیدی LSI چیست (LSI Keywords)و چه کاربردی در سئو دارد&nbsp;</li><li>Featured Snippets چیست؟</li></ul>', 44, NULL, 'بهینه سازی مطالب', 'ما به شما بهینه سازی سایت را آموزش می دهیم که چگونه سایت خود را سئو کنید. محتوای معنایی سئو وچگونگی ایجاد feature snippet را در طرح و وب بیاموزید.', '\"\"', 476, 0, NULL, NULL, '2020-07-21', 1, '2020-07-20 14:56:45', '2023-03-02 19:21:15'),
(52, 'ابزار ها و نرم افزار های سئو', 1, 'ابزار-ها-و-نرم-افزار-های-سئو', '<p>یکی از مهمترین فاکتور های موفقیت در سئو ، استفاده از ابزار های ارزیابی سئوی سایت می باشد مانند ابزار های ارزیابی کلمات کلیدی و یا شناسایی بک لینک های سایت و یا ابزاری برای کمک کردن به بهینه سازی درست و صحیح محتوای صفحه و غیره ...یک سوال اینجا پیش می آید که کدام ابزار ارزش امتحان کردن و وقت گذاشتن را دارد؟&nbsp;</p>', '<p>یکی از مهمترین فاکتور های موفقیت در سئو ، استفاده از ابزار های ارزیابی سئوی سایت می باشد مانند ابزار های ارزیابی کلمات کلیدی و یا شناسایی بک لینک های سایت و یا ابزاری برای کمک کردن به بهینه سازی درست و صحیح محتوای صفحه و غیره ...</p><p>یک سوال اینجا پیش می آید که کدام ابزار ارزش امتحان کردن و وقت گذاشتن را دارد؟ و چگونه به رتبه بندی و ترافیک سایت ما می توانند کمک کنند. در این بخش قصد داریم شما را با ۵ ابزار معروف در دنیای دیجیتال مارکتنیگ آشنا کنیم .این ابزار شامل :</p><ul style=\"list-style-type:disc;\"><li>SEMrush</li><li>Yoast SEO Plugin</li><li>Moz Pro</li><li>Raven Tools</li><li>Ubersuggest</li></ul>', 44, 'ابزار سئو | آشنایی ومعرفی بهترین ابزارهای رایگان و کاربردی سئو', 'ابزار سئو,ابزار رایگان سئو', 'یکی از مهمترین فاکتور های موفقیت در سئو ، استفاده از ابزار های ارزیابی سئوی سایت می باشد مانند ابزار های ارزیابی کلمات کلیدی و یا شناسایی بک لینک های سایت و یا ابزاری برای کمک کردن به بهینه سازی درست و صحیح محتوای صفحه و غیره ...', '\"\"', 542, 0, NULL, NULL, '2020-09-22', 1, '2020-07-20 14:57:03', '2023-03-02 19:21:02'),
(53, 'ساختار و معماری سایت', 2, 'ساختار-و-معماری-سایت', '<p>در این مقاله شما در رابطه با معماری سایت و عوامل داخلی آن از جمله عوامل اصلی برای داشتن یک معماری مناسب برای سایت ، بهترین معماری برای سایت ما ، لینک سازی داخلی ، سایت مپ و قرار دادن لینک های مناسب برای شناسایی توسط الگوریتم های گوگل و قرار دادن آن در صفحه serp آشنا شوید.</p>', '<div class=\"row\"><div class=\"col-lg-12 col-sm-12 column\"><div class=\"ge-content ge-content-type-ckeditor\" data-ge-content-type=\"ckeditor\"><h3>به نظرشما معماری یک وب سایت برای سئو تاثیر گذار است؟</h3><p>منظور از معماری وب سایت صفحات موجود در آن و همینطور لینک داخلی بین این صفحات می باشد. بهترین حالت برای یک سایت این است که کاربران به راحتی بتوانند به صفحه مورد نظر خود برسند و همینطور موتور ها و خزندگان گوگل از طریق ارتباط بین صفحات بتوانند به تمامی سایت راه پیدا کرده و کل سایت را ایندکس کنند.&nbsp;</p><p>منظور از معماری وب سایت صفحات موجود در آن و همینطور لینک داخلی بین این صفحات می باشد. بهترین حالت برای یک سایت این است که کاربران به راحتی بتوانند به صفحه مورد نظر خود برسند و همینطور موتور ها و خزندگان گوگل از طریق ارتباط بین صفحات بتوانند به تمامی سایت راه پیدا کرده و کل سایت را ایندکس کنند. اگر سایت شما از نظر کاربر سایتی ایده آل باشد و کاربر نیاز مورد نظر خود را از این قسمت پیدا کند و حتی درموردهای بعدی باز هم به سایت شما مراجعه کند ، از نظر گوگل به این صورت دیده می شود که سایت شما برای کاربران مناسب بوده است. پس معماری سایت و لینک سازی داخلی یکی از مهم ترین بخش های سایت شما برای شروع است.&nbsp;</p><h3>آیا معماری سایت مهم است؟</h3><p>جواب سوال شما بله است نظرات مختلفی وجود دارد که به شما ثابت می کند معماری یک سایت در سئو ان تاثیر زیادی دارد . 3 مورد از آن ها را برای شما ذکر میکنیم :</p><p>1: در یک معماری خوب عنکوب های خزنده گوگل می توانند به تمام صفحات سایت شما دسترسی پیدا کنند و کل سایت شما را ببینند. یعنی اگر صفحات شما به درستی از طریق لینک داخلی به هم متصل باشند خزنده گوگل از یک صفحه به صفحه دیگر راه پیدا کرده و می تواند صفحات شما را دنبال کند بدون اینکه حتی یک صفحه را از دست بدهد.</p><p>2: به وسیله معماری وب سایت خود شما می توانید صفحاتی را که دارای الویت بهتری مشخص کرده و همینطور قدرت صفحات دیگر را از طریق لینک دادن به آن صفحه منتقل می کنیم که این کار در رتبه بندی سایت ما و بالا بردن اعتبار ما در گوگل نقش بسیار مهمی دارد.</p><p>3: و در گزینه آخر که مهم ترین گزینه می باشد این است که کاربران به راحتی می توانند به بخشی که به ان نیاز دارند دسترسی پیدا کنند. با این کار علاوه بر اینکه زمان ماندگاری در سایت بیشتر خواهد شد ، گوگل نیز سایت ما را به عنوان یک سایت معتبر که نیازهای کاربر را در سریعترین زمان در اختیار آن قرار می دهد شناخته و اعتبار ما را بیشتر می کند.</p><h3>بهترین روش های برای معاری سایت</h3><p>از روش&nbsp;flat برای این کار استفاده کنید:&nbsp;</p><p>از نظر سئو برای معماری سایت بهترین روش فلت flat می باشد . در این روش شما با حداکثر4 کلیک می توانید به صفحه مورد نظرخود برسید. و همینطور در این معماری عمق بسیار کمی وجود دارد و این به این معنی است که شما می توانید از صفحاتی که امکان ایجاد بک لینک های بیشتری دارند مانند صفحه اصلی ، لینک به صفحاتی که نیاز به رتبه بندی و بالا آمدن در گوگل دارند مانند محصولات یا خدمات شما و همینطور مقالات می باشد.</p><p>شما برای اینکه در گوگل رتبه بگیرید به این نیاز دارید که حتما عنکبوت های گوگل حتما تمام صفحات سایت شما را پیدا کنند و این روش بهترین روش برای سریعترین رسیدن به این نقطه است.</p><p>پس بهترین راه برای شما استفاده از ساده ترین روش برای معماری سایت شما می باشد. تا کاربر با کمترین کلیک و سریعترین زمان به&nbsp; هدف خود برسد. پس از ابتدا برای دسته بندی مطالب خود و معماری سایت خود برنامه داشته باشید تا با بزرگتر شدن سایت شما دچار بهم ریختگی نشوید.</p><p>از صفحات دسته بندی خود استفاده کنید:</p><p>به وسیله صفحه دسته بندی ایجاد شده شما می توانید سایت خود را مرتب کنید.&nbsp;&nbsp;می خواهید صفحه جدیدی را ایجاد کنید؟ براساس دسته بندی هایی که دارید می توانید مطلب را در دسته بندی خاص خود قرار دهید و از این طریق لینک داخلی برای مطلب خود ایجاد کنید.زیرا در صورتی که شما دسته بندی نداشته باشید سایت شما دچار بی نظمی می شود.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/Flat-site-architecture-portraying-good-web-design-practice_1596562537.png\"></figure><p>&nbsp;</p><h3>آدرس های سایت</h3><p>برای سئو شما بهتر است که&nbsp;url&nbsp;&nbsp;ها هم از دسته بندی سایت شما پیروی کنند . یعنی شما باید از دسته بندی های خود در این&nbsp;url استفاده کنید.&nbsp;</p><p><i>https://example.com/category/subcategory/keyword-keyword</i></p><p>&nbsp;</p><h3>لینک سازی داخلی</h3><p>یکی از بخش های مهم سایت لینک سازی داخلی آن می باشد. شما باید از منو خود به صفحات سایت لینک بدهید . به این صورت که شما ابتدا به صفحه دسته بندی اصلی خود از منو لینک داده و از صفحه دسته بندی با صفحات سایت خود ارتباط برقرار کنید.&nbsp;</p><p>مثلا شما باید از صفحه اصلی خود به صفحه دسته بندی یک محصول که تمام آن محصولات در آن صفحه وجود دارد لینک دهید و در این صفحه به تمامی محصولات خود پیوند ایجاد کنید.&nbsp;</p><p>همچنین شما می توانید از صفحات محصولات خود یا نوشته های خود به صفحات دیگر محصولات و نوشته های خود و بخش هایی که با هم ارتباط دارند پیوند ایجاد کنید. تا راه راحتی تری را برای افرادی که دنبال موضوع خاصی هستند ایجاد کنید.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/internal link_1596562573.jpg\"></figure><p>&nbsp;</p><h3>استفاده از نقشه سایت در معماری</h3><p>یکی از بهترین کارهایی که می توانید انجام دهید تا گوگل تمام صفحات شما را پیدا کند و عنکبوت های خزنده گوگل آنها را شناسایی کنند استفاده از نقشه سایت است. شما در این روش می توانید تمامی دسته بندی های ، زیر دسته بندی ها ، محصولات و شاخه ها را نمایش دهید.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/site map_1596562573.png\"></figure><p>&nbsp;</p><h3>نمایش لینک صفحات سایت در گوگل</h3><p>ارتباطاتی که بین صفحات یک سایت می باشد نشان دهنده ارتباط قوی و همینطور معماری یک سایت است . هیچ حالت خاصی برای انتخاب شما وجود ندارد به جز اینکه کاملا به صورت اتفاقی و خودکار این بخش ها در صفحه گوگل نمایش داده می شود. شما می توانید نمونه این لینک ها را در تصویر زیر مشاهده نمایید.</p><p>گوگل صفحاتی را که در یک موضوع به هم ارتباط دارند براساس الگوریتم های خود انتخاب می کنند و نمایش می دهد. اگر شما بتوانید لینک سازی داخلی مناسبی برای سایت خود داشته باشید بر همین اساس گوگل از ارتباط بین لینک های سایت شما می تواند بهترین و مهم ترین بخش ها را در سایت شما مورد بررسی قرار دهد و لینک های مورد نظر را براساس الگورتیم های خود برای نمایش انتخاب کند.&nbsp;</p></div></div></div>', 47, NULL, 'معماری سایت,ساختار سایت,معماری داخلی سایت,سایت مپ,لینک سازی داخلی', 'در این مقاله شما در رابطه با معماری سایت و عوامل داخلی آن از جمله عوامل اصلی برای داشتن یک معماری مناسب برای سایت ، بهترین معماری برای سایت ما ، لینک سازی داخلی ، سایت مپ و قرار دادن لینک های مناسب برای شناسایی توسط الگوریتم های گوگل و قرار دادن آن در صفحه جستجو آشنا شوید.', '\"\"', 574, 0, 'article', '{\"rate\":null}', '2020-07-25', 1, '2020-07-24 15:47:09', '2023-02-19 00:39:16'),
(54, 'سئو (SEO) یا بهینه سازی وبسایت چیست؟', 2, 'سئو-(SEO)-یا-بهینه-سازی-وبسایت-چیست؟', '<p>اگر بخواهیم سئو&nbsp;و یا به اصطلاح انگلیسی&nbsp;Search engine optimization (SEO) &nbsp;را به ساده ترین زبان تعریف کنیم عبارت است از جا به جایی رتبه در نتایج موتورهای جستجو مانند گوگل از طریق بهینه سازی سایت&nbsp;که منجر به&nbsp;افزایش ترافیک سایت می شود.</p>', '<div class=\"row\"><div class=\"col-lg-12 col-sm-12 column\"><div class=\"ge-content ge-content-type-ckeditor\" data-ge-content-type=\"ckeditor\"><h3>تعریف سئو(SEO) ویا بهینه سازی سایت چیست؟</h3><p>اگر بخواهیم سئو&nbsp;و یا به اصطلاح انگلیسی&nbsp;Search engine optimization &nbsp;را به ساده ترین زبان تعریف کنیم عبارت است از جا به جایی رتبه در نتایج موتورهای جستجو مانند گوگل از طریق <strong>بهینه سازی سایت</strong>&nbsp;که منجر به&nbsp;افزایش ترافیک سایت می شود.</p><p>سئو&nbsp;وظایف متفاوتی دارد که متداول ترین آنها ایجاد محتوا با کیفیت بالا، بهینه سازی محتوا برای کلمات کلیدی خاص و ایجاد بک لینک و .... را می توان نام برد. مهمترین مزیت سئو سایت یا بهینه سازی سایت این است که شما برای یک کلمه کلیدی خاص&nbsp;,ماه به ماه ترافیک رایگان به سمت سایت خود هدایت می کنید.</p><p>در این مقاله سعی خواهیم کرد مطالب و مفاهیم ابتدایی و اولیه سئو را به شما معرفی کنیم.</p><p>۱-چگونه موتور های جستجو کار می کنند؟</p><p>۲-عمکرد سئو چگونه است؟</p><p>۳-فرق آگهی های پولی گوگل با نتایج معمولی سرچ گوگل در چیست؟</p><figure class=\"image\"><img src=\"https://www.tarhoweb.com/upload/images/2020/1-what-is-seo_1597238627.png\"></figure><p>خوب حالا که کمی با تعریف سئو در بالا آشنا شدیم کمی تخصصی تر به موتورهای جستجو مانند گوگل نگاه می اندازیم .</p><h3>چگونه موتور های جستجو کار می کنند؟</h3><p>زمانیکه کلمه ای (keyword ) در گوگل یا موتور جستجوی دیگری جستجو می شود ، یک الگوریتم که مختص به همان موتور جستجو می باشد در کمترین زمان ممکن بهترین نتیجه را برای شما لیست می کند.برای مثال گوگل از بین صد ها میلیارد صفحه موجود در فضای اینترنت , مجموعه ای از بهترین نتایج را به شما نشان می دهد.<br>منظوره ما از بهترین نتایج گوگل چیست؟</p><ul><li>مرتبط بودن کلمه کلیدی سرچ شده &nbsp;با محتوای سایت</li></ul><p>فرض کنید در گوگل کلمه&nbsp;&nbsp;“سئو” را سرچ کرده اید ,انتظار ندارید که نتایج نمایش داده شده در مورد کلمه\"چیپس\" باشد به همین دلیل گوگل به دنبال صفحاتی است که به کلمه کلیدی جستجو شده نزدیک باشد.از طرفی علاوه بررتبه بندی صفحات مناسب و بهینه شده&nbsp; ,صفحات دیگری که مرتبط هستند را نیز نمایش می دهد.برای مثال&nbsp;“SEO” در جستجوی گوگل حدود ۶۴۰۰۰۰۰۰۰ میلیون نتیجه جستجو دارد چه صفحه ای سئو شده باشد چه نباشد.</p><figure class=\"image\"><img src=\"https://www.tarhoweb.com/upload/images/2020/2-relative-search_1597240493.png\"></figure><p>&nbsp;</p><ul><li>معتبر بودن صفحه از نظر گوگل</li></ul><p>یکی دیگر از روش هایی که موتور جستجو با آن سرو کار دارد این است که گوگل به صفحه ای که تعدادی صفحه دیگر به آن لینک شده اند اعتبار می دهد(به این لینک ها&nbsp;backlink&nbsp;&nbsp;گفته می شود).حالا این اعتبار به صفحه ی وب سایت شما کمک می کند تا کمی نزده گوگل شیرین شود .</p><figure class=\"image\"><img src=\"https://www.tarhoweb.com/upload/images/2020/3-Authority-backlinks_1597239446.png\"></figure><p>&nbsp;</p><figure class=\"image\"><img src=\"https://www.tarhoweb.com/upload/images/2020/4-more-backlinks_1597240325.png\"></figure><ul><li>مفید بودن محتوای سرچ شده سایت</li></ul><p>مهمترین نکته ای که باید رعایت شود این است که شاید یک مطلب هم مرتبط با کلمه کلیدی باشد و هم دارای بک لینک های معتبر اما اگر از نظره خواننده مفید نباشد و به اصطلاح سئو کاران برای گوگل نوشته شود نمی تواند در جایگاه خوبی قرار بگیرد.برای مثال فرض کنید&nbsp;“چرا سئو اهمیت دارد؟” را جستجو کرده اید.&nbsp;در لیستی که گوگل در اختیار شما قرار می دهد وارد نفر اول لیست می شوید که توسط یک متخصص سئو نوشته شده است و دارای متنی طولانی بدون هیچ گونه استراتژی و تکنیکی&nbsp; مانند نمونه زیر و از طرفی بک لینک های زیادی برای سایت توسط دیگران ایجاد شده است .</p><figure class=\"image\"><img src=\"https://www.tarhoweb.com/upload/images/2020/5-unorganised-content_1597240274.png\"></figure><p>و حالا نمونه زیر توسط فردی عادی در زمینه&nbsp;“چرا سئو اهمیت دارد؟” نوشته شده است و بک لینک زیادی ندارد اما چون متن را مرتب و به چند بخش تقسیم کرده و با اصول سئو نوشته شده (در ادامه توضیح می دهیم که یک محتوای تکنیکی چگونه نوشته می شود) و هر پاراگراف تیتر مخصوص به خود دارد از نظرخواننده مفید محسوب می شود .اگر عکس زیر را با عکس بالا مقایسه کنید خواهید دید که که هر پاراگراف دارای تیتر و عکس جداگانه می باشد .</p><figure class=\"image\"><img src=\"https://www.tarhoweb.com/upload/images/2020/6-useful-content_1597240986.png\"></figure><p>نتیجه:</p><p>سایتی خلق کنید که مردم آن را دوست داشته باشند نه گوگل ! .گوگل به دنبال سایت هایی هست که سیگنال بیشتری از مردم گرفته باشد و خواننده آن سایت را بیشتر دوست دارد.پس سعی کنید سیگنال های واقعی را جایگزین سیگنال های مصنوعی کنید و این امر باعث جا به جایی در رنکینگ گوگل می شود.</p><h3>عملکرد سئو چگونه است :</h3><p>سئو با بهینه سازی سایت برای موتور های جستجو مانند&nbsp;Google&nbsp;،Bing&nbsp;&nbsp;کار می کند.&nbsp;وظیفه شما این است که مطمئن شوید موتورهای جستجو سایت شما را به عنوان بهترین نتیجه ببیند و این نقش را الگوریتمی ایفا می کند که وظیفه آن بررسی مرتبط و معتبر بودن&nbsp; محتوای جستجو شده &nbsp;با کلمه کلیدی است. در بیشتر مواقع هنگامی که صحبت از بهینه سازی موتورهای جستجو است در واقع تمامی توجهات به سمت&nbsp; “سئو گوگل&nbsp;“ پیش می رود که در نتیجه به ما این امکان را داد تا روی سئوگوگل بیشتر تمرکز کنیم.</p><h3>فرق آگهی های پولی گوگل (PPC) با نتایج معمولی سرچ (Organic Results):</h3><p>صفحات نتایج جستجوی گوگل به دو بخش جستجوی مجزا تقسیم می شوند :آگهی های پولی گوگل و نتایج معمولی گوگل</p><ul><li>نتایج معمولی گوگل :</li></ul><p>نتایج جستجوی معمولی (که بعضاً به عنوان نتایج \"طبیعی\" خوانده می شوند) لیستی از سایت&nbsp; هایی هستند که براساس معیار های گوگل ، 100٪ رتبه بندی می شوند.</p><p>موتورهای جستجو مانند گوگل&nbsp;,نتایج جستجوی اصلی را بر اساس صد&nbsp;ها فاکتور رتبه بندی مختلف, رتبه بندی می کنند. اما به طور کلی ، نتایج اصلی از نظر گوگل به عنوان قابل اعتماد ترین و معتبرترین وب سایت ها یا صفحات وب مربوط به این موضوع و یا کلمه کلیدی جستجو شده, شناخته شده است.</p><p>جزئیات بیشتر درباره نحوه کارالگوریتم موتور های جستجو را بعدا توضیح خواهیم داد ولی در حال حاضر تنها نکته ای که باید در نظر داشته باشیم این است که وقتی صحبت از سئو می شود منظور همان رتبه بندی وب سایت شما در نتایج اصلی است نه نتایج پولی . در ضمن این نکته رانیز نبایدفراموش کرد که نتایج لیست شده در جستجوی اصلی و معمولی گوگل از سئو بهتری برخوردار می باشند تا نتایج پولی نمایش داده گوگل.</p><ul><li>نتایج پولی گوگل (PPC) :</li></ul><p>نتایج پولی گوگل در بالا و یا در پایین لیست نتایج جستجو شده معمولی گوگل به صورت تبلیغات (یک آیکون&nbsp;Ad سبز رنگ در کنار آن قرار دارد)نمایش داده می شود. تبلیغات پولی گوگل کاملا مستقل از لیست جستجوی اصلی گوگل است و نحوه کار آن پرداخت در ازای کلیک بروی تبلیغ می باشد.در این نوع تبلیغ هزینه بر اساس قیمت کلیک تعریف شده است که به این معنی می باشد که شما هزینه ای به ازای هر فردی که وارد سایت شما می شود پرداخت می کنید و گوگل سایت شما را در صدر نتایج نمایش می دهد.</p></div></div></div>', 50, 'تعریف سئو(SEO) ویا بهینه سازی سایت چیست', 'سئو,بهینه سازی,seo,سئو چیست,بهینه سازی سایت,عملکرد سئو', 'اگر بخواهیم سئو و یا به اصطلاح انگلیسی Search engine optimization (SEO)  را به ساده ترین زبان تعریف کنیم عبارت است از جا به جایی رتبه در نتایج موتورهای جستجو مانند گوگل از طریق بهینه سازی سایت که منجر به افزایش ترافیک سایت می شود.', '{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/basic-seo.jpg\",\"300\":\"\\/upload\\/images\\/2020\\/300_basic-seo.jpg\",\"600\":\"\\/upload\\/images\\/2020\\/600_basic-seo.jpg\",\"900\":\"\\/upload\\/images\\/2020\\/900_basic-seo.jpg\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_basic-seo.jpg\"}', 611, 0, 'article', '{\"rate\":null}', '2020-07-29', 1, '2020-07-28 17:14:33', '2023-02-28 17:07:36'),
(55, 'تماس با ما', 1, 'تماس-با-ما', NULL, '<p>شماره تماس: <a href=\"tel:02188421318\">۰۲۱۸۸۴۲۱۳۱۸</a></p><p>شماره همراه: <a href=\"tel:09331181877\">۰۹۳۳۱۱۸۱۸۷۷</a></p><p>تماس با پشتیبانی از ساعت ۸ تا ۲۴</p>', 0, NULL, NULL, NULL, '\"\"', 1054, 0, NULL, NULL, '2020-08-02', 1, '2020-08-01 18:32:37', '2023-03-02 08:04:38'),
(56, 'سئو کلمات کلیدی', 2, 'سئو-کلمات-کلیدی', '<p>شما برای اینکه در گوگل رتبه بگیرید باید برای صفحات و مقالات خود کلمات کلیدی را درنظر بگیرید. اگر می خواهید کلمات کلیدی را شناسایی کنید نیاز به تحقیق در این زمینه دارید . شما می توانید برای پیدا کردن کلمات کلید از حجم جستجو ، میزان رقابت و ... انتخاب کنید. برای اینکه مقاله و صفحات سایت شما در یک کلمه خاص درگوگل رتبه بیاورد شما نیاز دارید تا این کلمه را شناسایی کنید و صفحه را برای این کلمه کلیدی بهینه کنید تا رتبه بالاتری بگیرید.</p>', '<div class=\"row\"><div class=\"col-lg-12 col-sm-12 column\"><div class=\"ge-content ge-content-type-ckeditor\" data-ge-content-type=\"ckeditor\"><h3>چطور می توانیم کلمات کلیدی را سئو کنیم؟</h3><p>شما برای اینکه در گوگل رتبه بگیرید باید برای صفحات و مقالات خود کلمات کلیدی را درنظر بگیرید. اگر می خواهید کلمات کلیدی را شناسایی کنید نیاز به تحقیق در این زمینه دارید . شما می توانید برای پیدا کردن کلمات کلید از حجم جستجو ، میزان رقابت و ... انتخاب کنید. برای اینکه مقاله و صفحات سایت شما در یک کلمه خاص درگوگل رتبه بیاورد شما نیاز دارید تا این کلمه را شناسایی کنید و صفحه را برای این کلمه کلیدی بهینه کنید تا رتبه بالاتری بگیرید.</p><p>با این کار شما می توانید ترافیک هدفمند را به سمت سایت خود بفرستید و این در صورتی هست که شما رتبه بالاتری را در&nbsp;serp داشته باشید. برای همین این کار از مهم ترین وظایف در انجام کار سئو است که شما لیستی از مناسب ترین کلمات کلیدی پیدا کنید.</p><p>در ابتدا <strong>معماری سایت</strong>&nbsp;خود را کاملا مشخص کنید.</p><p>ابتدا دسته بندی های خود را کاملا مشخص کرده و بر همین اساس صفحات محصولات خود را ایجاد نمایید.</p><p>برای پست های خود در وبلاگ می توانید محتوا مناسب ایجاد کنید.</p><p>صفحات فرود خود&nbsp;landing page و همینطور صفحات فروش و محصولات خود را بهینه سازی کنید.</p><p>&nbsp;</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/keywords-research-banner-laptop-with-folder-documents-graphs-key_80328-154_1596564279.jpg\"><figcaption>استراتزِی یافتن کلمات کلیدی</figcaption></figure><p>&nbsp;</p><h3>بهترین روش برای پیدا کردن کلمات کلیدی</h3><p>&nbsp;</p><p>از گزینه های پیشنهادی گوگل&nbsp;google suggest استفاده کنید.</p><p>شما باید از کلمات طولانی و به اصطلاح&nbsp;long tail keyword استفاده کنید. استفاده از کلمات کلیدی که رقابت بسیار زیادی دارند دور از دسترس نیست اما این کار به زمان زیادی نیاز دارد تا رتبه بندی مورد نظر شما را به دست بیاورد.</p><p>&nbsp;</p><p>کلمات کلیدی بلند حدود 3 تا 4 کلمه باشند که این کلمات برای سایت هایی که به تازگی کار خود را شروع میکنند بسیار مناسب است.&nbsp; زمانی که شما یک کلمه کلیدی با رقابت بالا را در گوگل سرچ میکنید گوگل به شما پیشنهاداتی می دهد که شما با انتخاب این گزینه ها می توانید صفحات خود را برای این&nbsp;keywords بهینه سازی کنید.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/-ساجست_1596563727.JPG\"></figure><h3>پیدا کردن کلمات کلیدی مبتنی بر سوال</h3><p>اگر برای پست ها و مقالات خود دنبال کلمات کلیدی مبتنی بر سوال هستید می توانید از ذو ابزار در این زمینه استفاده کنید و بوسیله این دو ابزار رایگان کلمات کلیدی مناسب برای مطالب خود پیدا کنید و صفحات سایت و بلاگ خود را سئو کنید.</p><p>اولین ابزار برای پیدا کردن کلمات کلیدی مبتنی بر سوال&nbsp;<strong>AnswerThePublic.com&nbsp;</strong>نام دارد. این ابزار برای پیدا کردن سوالات کاربران در زمینه مورد نظر شما می باشد و سوالات بسیاری را در این زمینه به شما ارائه می دهد.</p><p>ابزار دوم برای یافتن کلمات کلیدی سوال&nbsp;Question DB&nbsp;&nbsp;نام دارد. این گزینه هم موارد بسیار زیادی از سوالات را برای ما پیدا کرده و نمایش می دهد. کلمات کلیدی در این ابزار معمولا کلمات کلیدی طولانی هستند که در گوگل دارای رقابت بالایی نمی باشند.</p><p>&nbsp;</p><h3>استراتژی یافتن کلمات کلیدی خلاقانه</h3><p>&nbsp;</p><p>شما می توانید برای یافتن کلمه کلیدی مورد نظر خود از هر ابزاری استقاده کنید و برای یافتن کلمات کلیدی خلاقانه که برای سئو کردن صفحات سایت شما بسیار مناسب باشد من به شما ابزار ساده و همچنین رایگان&nbsp;<strong>SeedKeywords.com</strong> را معرفی می کنم . در این سایت شما می توانید به عباراتی دست پیدا کنید که شاید خود شما به تنهایی نمی توانستید به آنها برسید.</p><p>همچنین شما می توانید برای یافتن عباراتو کلمات کلیدی تجارت الکترونیک مورد نظر خود از سایت آمازون استفاده کنید. شما برای&nbsp; پیدا کردن کلمات کلیدی برای محصول خود می توانید از گزینه های پیشنهادی در آمازون استفاده کنید و این کار دقیقا مانند پیشنهادات گوگل می باشد.&nbsp;</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/seo-data-analytics-keyword-process_34708-51_1596564278.jpg\"></figure><p>&nbsp;</p><h3>کلمات کلیدی رقبای خود را تحلیل کنید</h3><p>برای پیدا کردن کلمات کلیدی شما می توانید سایت رقبای خود را در این زمینه تحلیل کنید. این کار لیستی را برای شما از یک دامنه قابل رقابت ایجاد می کند. برای اینکه شانس خود را برای رقابت بالا ببرید مشابه سایت خود را پیدا کنید تا بهترین عبارات را برای سایت خود ایجاد نمایید.</p><p>&nbsp;</p><h3>از ابزارkeyword planner استفاده کنید</h3><p>برای استفاده از این ابزار باید یک حساب&nbsp;google ads ایجاد کنید. در غیر اینصورت یک کمپین اجرا کنید و حجم جستجوهای ماهانه را هم می توانید ببینید.</p><p>اگر شما یک حساب&nbsp;google ads میسازید به این معنی نیست که در حال حاضر می خواهید تبلیغی را اجرا نمایید . این کار برای دسترسی به ابزار تحلیل کلمات کلیدی می باشد. شما می توانید کلمه خود را وارد کنید و میزان سرچ کلمه در ماه را در قسمت پلن مشاهده نمایید.&nbsp;</p><p>&nbsp;</p><h3>استفاده ازgoogle trends برای پیدا کردن کلمات کلیدی</h3><p>پیدا کردن حجم جستجو ماهانه مهم است ،شما در گوگل&nbsp;trends می توانید روند و میزان سرچ یک کلمه را مشاهده کنید.&nbsp;&nbsp;شما می توانید حجم جستجوی ماهانه یک کلمه را پیدا کنید و میزانی که این کلمه امکان رشد دارد را به شما نمایش نمی دهد. شما باید تلاش خود را برای اصطلاحاتی که محبوبیت دارند انجام دهید ، این کلمات در حال رشد هستند.</p><p>&nbsp;&nbsp;</p><h3>یافتن کلمات کلیدی ازBuzzSumo</h3><p>این ابزار صرفا برای تحقیق یک کلمه کلیدی نمی باشد اما اگر استفاده از آن را یاد بگیرید می توانید راهی برای یافتن این اصطلاحات پیدا کنید. شما صفحه اصلی رقیب خود را در این سایت قرار می دهید و مطالبی را که برای این سایت مهم هستند و بهترین عملکرد را دارند نمایش داده می شود. شما می توانید با مشاهده بهترین محتواهای یک سایت بهترین کلمات کلیدی را برای سایت و مقالات خود انتخاب کنید.&nbsp;</p><p>&nbsp;</p><h3>استفاده از کلمات کلیدی در محتوا</h3><p>در ابتدا برای کلمه اصلی خود تمصمیم گیری نمایید و در یک صفحه از چند کلمه کلیدی استفاده نکنید زیرا جوابگو نیست. از کلمه کلیدی در عنوان صفحه خود استفاده کنید به طور مثال اگر صفحه شما در رابطه با راهنما برای نوشتن پست بلاگ است می توانید از عبارات چگونه یک پست بلاگ بنویسیم استفاده کنیم . به این صورت مقاله ما برای این کلمه کلیدی شناخته می شود . در مرحله بعد شما می توانید از کلید واژه اصلی در محتوای مقاله خود استفاده کنیم. نیاز به اینکه بارها در طول متن از کلیمه کلیدی استفاده کنید نیست فقط چندمرتبه در سایت خود از کلید واژه مورد نظر استفاده کنید تا گوگل متوجه شود که تمرکز شما در این مقاله بر روی این کلمه است.</p><p>همینطور کاملا مطمئن شوید که کلمه کلیدی شما حتما در&nbsp;url&nbsp;&nbsp;و همینطور عنوان&nbsp;tilte آورده شده است . سپس در این مرحله کلید واژه خود را در توضیحات&nbsp;meta description نیز بیاورید. با این کار به کاربران نشان می دهید که متن شما در چه زمینه ای می باشد و به این صورت میزان کلیک بر روی مقاله شما بیشتر خواهد شد.</p><p>بعد از سرچ توسط کاربر این کلمه به صورت بولد نمایش داده می شود. به این صورت میزان توجه به سایت شما بیشتر می شود. شما می توانید از کلمات مشابه در این زمینه نیز استفاده کنید و علاوه بر کلمه کلیدی از عبارات مترادف نیز بهره ببرید. کلمات کلیدی که بیشترین استفاده را دارند در پایین صفحه در سرچ گوگل قابل مشاهده می باشند.</p><p>و در آخر از لینک های داخلی در سایت خود استفاده کنید. برای اینکه این صفحه جدید قابل مشاهده و سرچ بیشتر باشد نیاز هست تا شما از طریق صفحات دیگر که دارای اعتبار بیشتری هستند به این صفحه لینک دهید. برای ایجاد لینک بین صفحات سعی کنید از ایجاد لینک با کلمه کلیدی اصلی صفحه خود استفاده کنید تا گوگل کاملا متوجه شود که صفحه شما به چه کلید واژه و اصطلاحی تاکید دارد.</p></div></div></div>', 49, NULL, 'سئو کلمات کلیدی,استراتژی کلمات کلیدی,پیدا کردن کلمات کلیدی,سئو کلیدواژه', 'برای اینکه در گوگل شناخته شوید و رتبه بیاورید مهم ترین و اولین کار پیدا کردن کلمه کلیدی است. ما راه های پیدا کردن بهترین و مناسب ترین کلید واژه و عبارت را برای مقالات وبلاگ و محصولات و خدمات به شما نشان می دهیم.', '{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/keyword-strategy.png\",\"300\":\"\\/upload\\/images\\/2020\\/300_keyword-strategy.png\",\"600\":\"\\/upload\\/images\\/2020\\/600_keyword-strategy.png\",\"900\":\"\\/upload\\/images\\/2020\\/900_keyword-strategy.png\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_keyword-strategy.png\"}', 493, 0, 'article', '{\"rate\":null}', '2020-08-03', 1, '2020-08-02 10:07:35', '2023-02-19 00:39:13'),
(57, 'فرق بین اصطلاح SEM  و SEO  چیست ؟', 2, 'فرق-بین-اصطلاح-SEM-و-SEO-چیست-؟', '<p>مهمترین تفاوت بین این دو اصطلاح این است که&nbsp;Search Engine Optimization (SEO)&nbsp;&nbsp;روی بهینه سازی سایت کار می کند&nbsp;و Search Engine Marketing (SEM)&nbsp;&nbsp; علاوه بر اینکه ترافیک را هدایت می کند, ورودی ترافیک از هر دو نتایج معمولی و پولی گوگل را مشاهده و مانیتورینگ می کند.</p>', '<div class=\"row\"><div class=\"col-lg-12 col-sm-12 column\"><div class=\"ge-content ge-content-type-ckeditor\" data-ge-content-type=\"ckeditor\"><h2>فرق بین اصطلاح SEO با SEM چیست؟</h2><p>مهمترین تفاوت بین این دو اصطلاح این است که&nbsp;Search Engine Optimization (SEO)&nbsp;&nbsp;روی بهینه سازی سایت کار می کندتا ترافیک لازم را از نتایج جستجوی گوگل به سایت هدایت کند.از&nbsp; طرفی&nbsp;Search Engine Marketing (SEM)&nbsp;&nbsp; علاوه بر اینکه ترافیک را هدایت می کند, ورودی ترافیک از هر دو نتایج معمولی و پولی گوگل را مشاهده و مانیتورینگ می کند.</p><p>همانطور که می دانید نتایج جستجوی گوگل به دو دسته اصلی تقسیم می شوند .همانطور که در شکل زیر می بینیم این دو دسته به نتایج معمولی گوگل و نتایج پولی گوگل دسته بندی شده اند.</p><figure class=\"image image_resized\" style=\"width:30.96%;\"><img src=\"https://www.tarhoweb.com/upload/images/2020/-معمولی-گوگل-نتایج-پولی-گوگل_1599650594.jpg\"></figure><p>&nbsp;</p><p style=\"text-align:center;\">هدف اصلی&nbsp;SEO&nbsp;&nbsp; رتبه بندی سایت شما در نتایج معمولی گوگل می باشد.</p><figure class=\"image image_resized\" style=\"width:29.98%;\"><img src=\"https://www.tarhoweb.com/upload/images/2020/-پولی-گوگل_1599650609.jpg\"></figure><p style=\"text-align:center;\">شما می توانید وب سایت خود را در جایگاه نتایج پولی قرار دهید فقط این نکته را یادتان باشد که به ازای هر کلیک شما هزینه ای پرداخت می کنید&nbsp;pay per click (PPC)).)</p><p>حالا طبق مطالب اولیه که در بالا اشاره شد&nbsp;SEO&nbsp;&nbsp;مکانی است که شما ۱۰۰٪&nbsp; بروی رتبه بندی در نتایج معمولی گوگل تمرکز می کنید ولی زمانی که شما از هر دو&nbsp;SEO و&nbsp;PPC برای جذب ترافیک به سایت استفاده می کنید بحث&nbsp;SEM&nbsp;&nbsp;به میان می آید و نشان می دهد که&nbsp;SEO&nbsp;&nbsp;در دسته&nbsp;SEM&nbsp;&nbsp;می باشد.</p><figure class=\"image image_resized\" style=\"width:29.3%;\"><img src=\"https://www.tarhoweb.com/upload/images/2020/SEO-SEM_1599650637.jpg\"></figure><p>&nbsp;</p><h3>SEO در مقابل SEM: مهمترین ویژگی ها</h3><p>همانور که می دانید سئو روشی است برای بهینه سازی یک وب سایت که سایت شما را در صفحات نتایج موتور جستجوی&nbsp; معمولی و غیر پولی گوگل رتبه بندی می کند.شاید&nbsp;&nbsp;اصطلاح&nbsp;SERPs را بار ها دیده اید که به معنی همان صفحات نتایج موتور جستجو می باشد.(Search Engine Results Pages)</p><p>سئو می تواند به چهار زیر گروه اصلی تقسیم شود.</p><ul><li>سئو داخلی(On-page SEO)</li><li>سئو خارجی&nbsp;(Off-page SEO)</li><li>سئو تکنیکال (Technical SEO)</li><li>سیگنال های تعاملی کاربری</li></ul><h3>سئو داخلی(On-page SEO)</h3><p>تمامی کلمات کلیدی ، تگ های H1 تا H2 ، متا تگ ها ، تگ های عنوان و هر بهینه سازی که در سایت انجام می شود سئو داخلی گفته می شود.</p><h3>سئو خارجی (Off-page SEO)</h3><p>سئو خارجی در واقع تمامی کارهای سئو و بهینه سازی که از خارج سایت شما انجام می شود مانند شبکه های اجتماعی ، وبلاگ ها ، تبلیغات برای دیده شدن و ایجاد بک لینک و...</p><h3>سئو تکنیکال (Technical SEO)</h3><p>در زمان بهینه سازی سایت، باید مطمئن شویم که سایت ما و یا به عبارت دقیق تر ، تمامی صفحات سایت توسط ربات های جستجوگر &nbsp;گوگل شناسایی و جستجو شده باشد. به بهینه سازی سایت در این مرحله سئو تکنیکال گفته می شود.از مهمترین کار های سئو تکنیکال این است که مطمئن می شود که سایت شما به سرعت و به درستی بارگزاری می شود و یا معماری سایت شما به درستی پیاده سازی شده باشد. برای آشنایی با ساختار و معماری سایت می توانید مقاله مرتبط با آن را مطالعه کنید و ببینید چه تاثیری روی سئو سایت شما دارد.</p><p><a href=\"https://www.tarhoweb.com/%D8%B3%D8%A7%D8%AE%D8%AA%D8%A7%D8%B1-%D9%88-%D9%85%D8%B9%D9%85%D8%A7%D8%B1%DB%8C-%D8%B3%D8%A7%DB%8C%D8%AA\"><i><strong>آشنایی با ساختار و معماری وب سایت</strong></i></a></p><h3>سیگنال های تعاملی کاربری</h3><p>روشی که کاربر با سایت شما تعامل می کند به گوگل کمک می کند تا بفهمد که آیا سایت شما مفید و به درد کاربران می خورد یا خیر.برای مثال اگر ضریب خروج کاربران از سایت شما بالا باشد(‌Bounce Rate) ، می تواند به این معنی باشد که سایت شما پاسخگوی نیاز مشتریان نیست.اگر گوگل به این نتیجه برسد که صفحه سایت شما مناسب کلمه کلیدی جستجو شده نیست &nbsp;،سایت شما را از نظر جایگاه تنزل می دهد و یا حتی می تواند از صفحه اول خود حذف کند.</p><p>&nbsp;</p><h3 style=\"text-align:justify;\">نگاه کلی به SEM</h3><p>قبل&nbsp;از&nbsp;شروع&nbsp;این&nbsp;بخش&nbsp;باید&nbsp;این&nbsp;نکته&nbsp;را&nbsp;مد&nbsp;نظر&nbsp;داشته&nbsp;باشیم&nbsp;که&nbsp;SEM &nbsp;،&nbsp;همانطور&nbsp;که&nbsp;در&nbsp;بالا&nbsp;اشاره&nbsp;کردیم، SEO&nbsp;جزئی از آن محسوب می شود.علاوه &nbsp;بر&nbsp;آن&nbsp;، SEM شامل PPC (Pay Per &nbsp;Click)&nbsp;نیز&nbsp;می&nbsp;باشد&nbsp;که&nbsp;خودش&nbsp;دارای&nbsp;مجموعه&nbsp;ای&nbsp;از&nbsp;ویژگی&nbsp;ها&nbsp;و&nbsp;روش&nbsp;های&nbsp;خاص&nbsp;می&nbsp;باشد.</p><p><strong>آشنایی با چند اصطلاح در&nbsp;SEM&nbsp;&nbsp;:</strong></p><p><strong>1- Bidding&nbsp;</strong>&nbsp;: &nbsp;برای مثال شما برای نمایش تبلیغات خود در گوگل یک مبلغ پولی را در نظر می گیرید و حساب خود را در گوگل شارژ می کنید – حالا &nbsp;زمانی که کسی روی تبلیغات شما کلیک کرد از مبلغی شارژی شما کم می شود البته این را هم در نظر داشته باشید که می توانید برای به نمایش در آمدن لینک شما در بخش تبلیغات یک مبلغ تعیین کنید و اگر رقبای شما با همان کلمه کلیدی تبلیغات بدهند لینک هایی را اول نمایش می دهد که قیمت &nbsp;(<strong>bidding</strong>) بالاتری را برای تبلیغات خود انتخاب کرده اند . به مبلغی که از حساب شما کسر می شود&nbsp;<strong>CPC&nbsp;</strong>یا <strong>cost per click</strong> گفته می شود.</p><p><strong>2-Quality Score </strong>: &nbsp; امتیاز کیفی در تبلیغات پولی گوگل رابطه مستقیم با هزینه و رتبه بندی سایت شما دارد به طوریکه می توان گفت به نوعی گوگل از شما بابت کیفیت مطالب و صفحه فرود&nbsp;<strong>،</strong>نرخ کلیک و ... &nbsp;قدردانی &nbsp;می کند و هزینه ای به عنوان تخفیف برای شما در نظر می گیرد.&nbsp;</p><p>&nbsp;</p><h3>SEO در مقایسه با SEM :بحث زمان و سرعت</h3><p>یکی از مهمترین تفاوت های بارز بین&nbsp;<strong>SEO</strong>&nbsp; و<strong>SEM&nbsp;</strong>&nbsp;بحث سرعت می باشد. حقیقت این است که&nbsp;<strong>SEO</strong> زمان زیادی می برد مخصوصا اگر سایت شما نوپا و بکلینک های کافی نداشته باشد.</p><p>در یک آنالیزی که توسط سایت&nbsp;<strong>Ahrefs</strong> در این زمینه انجام شده است به این نتیجه رسیده است که تقریبا ۲ سال طول می کشد تا گوگل سایت را به صفحه اول خود بیاورد و رتبه های یک تا سه نیز حدودا سه سال زمان می برد. اما این به این معنی نیست که شما ناامید شوید. اگر بتوانید سئوی پایه را به درستی بروی سایت پیاده سازی کنید و از کلمات کلیدی سه یا چهار کلمه ای استفاده کنید می توانید یک میانبر زمانی را طی کنید.برای آشنایی با سئوی پایه می توانید به لینک های زیر مراجعه کنید.</p><ul><li><a href=\"https://www.tarhoweb.com/%D8%B3%D8%A6%D9%88-(SEO)-%DB%8C%D8%A7-%D8%A8%D9%87%DB%8C%D9%86%D9%87-%D8%B3%D8%A7%D8%B2%DB%8C-%D9%88%D8%A8%D8%B3%D8%A7%DB%8C%D8%AA-%DA%86%DB%8C%D8%B3%D8%AA%D8%9F\">آشنایی با مبانی ابتدایی سئو</a></li><li><a href=\"https://www.tarhoweb.com/%DA%86%D8%B1%D8%A7-%D8%A8%D8%A7%DB%8C%D8%AF-%D8%A8%D9%87-%D8%B3%D8%A6%D9%88-%D8%B3%D8%A7%DB%8C%D8%AA-%D8%A7%D9%87%D9%85%DB%8C%D8%AA-%D8%A8%D8%AF%D9%87%D9%85\">چرا باید به سئو سایت اهمیت بدهیم</a></li><li><a href=\"https://www.tarhoweb.com/%D8%B7%D8%B1%D8%A7%D8%AD%DB%8C-%D8%B3%D8%A7%DB%8C%D8%AA-Seo-Friendly\">طراحی سایت Seo Friendly</a></li></ul><p>برای مثال یکی ار معروف ترین سایت های دنیا در زمینه سئو سایت&nbsp;<strong>backlinko</strong> می باشد که اوایل ۲۰۱۳<strong>&nbsp;</strong>&nbsp;این سایت به راه افتاد .با تلاش فراوان و گذاشتن مطالب و محتوای غنی &nbsp;و تمرکز بروی سئو سایت توانست &nbsp;در کمتر از چند ماه ترافیک را به سایت خود هدایت کند. اما این را انکار نمی کند که در مدت طولانی توانست ترافیکی مطلوب و راضی کننده به سایت هدایت کند .پس بدانید بدون تلاش و وقت گذاشتن بروی سایت نمی توانید یک شبه به رتبه های طلایی گوگل دست پیدا کنید.</p><p>حالا از طرف دیگر اگر شما روی <strong>SEM</strong>‌ (بازاریابی موتور های جستجو)تمرکز کنید با خرید تبلیغات گوگل ترافیک را به سایت در زمان کوتاهی هدایت می کنید ولی با به معنی موفق شدن و کسب بازدید کننده به طور قطعی نیستید تیم ما بر این باور هستند که باید&nbsp;<strong>SEM</strong> و&nbsp;<strong>SEO</strong> هر دو در کنار هم اجرا و پیاده سازی شوند&nbsp;</p><p>&nbsp;</p></div></div></div>', 50, 'تفاوت seo با sem چیست - اصطلاح SEO و SEM چه کاربردی دارد؟', 'سئو داخلی,سئو خارجی,سئو تکنیکال,On-page SEO,Off-page SEO,Technical SE,SEM,نتایج پولی گوگل,فرق seo با sem', 'مهمترین تفاوت بین این دو اصطلاح این است که Search Engine Optimization (SEO)  روی بهینه سازی سایت کار می کندتا ترافیک لازم را از نتایج جستجوی گوگل به سایت هدایت کند.از  طرفی Search Engine Marketing (SEM)   علاوه بر اینکه ترافیک را هدایت می کند, ورودی ترافیک از هر دو نتایج معمولی و پولی گوگل را مشاهده و مانیتورینگ می کند.', '{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/title-seo-sem.jpg\",\"300\":\"\\/upload\\/images\\/2020\\/300_title-seo-sem.jpg\",\"600\":\"\\/upload\\/images\\/2020\\/600_title-seo-sem.jpg\",\"900\":\"\\/upload\\/images\\/2020\\/900_title-seo-sem.jpg\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_title-seo-sem.jpg\"}', 476, 0, 'article', '{\"rate\":null}', '2020-08-13', 1, '2020-08-12 13:01:30', '2023-03-02 17:30:25');
INSERT INTO `contents` (`id`, `title`, `type`, `slug`, `brief_description`, `description`, `parent_id`, `meta_title`, `meta_keywords`, `meta_description`, `images`, `viewCount`, `commentCount`, `attr_type`, `attr`, `publish_date`, `status`, `created_at`, `updated_at`) VALUES
(58, 'نقشه سایت', 2, 'نقشه-سایت', '<p>شما برای وب سایت خود نیاز به یک نقشه سایت دارید تا موتورهای جستجوگر بتونند محتوا و مطالب داخل وب سایت شما را ببینند و ان را فهرست کنند. نقشه سایت به موتورهای جتستجو گر نشان می دهد که کدام مطالب شما مهم تر از بقیه می باشد . این نقشه ها دارای انواع مختلفی می باشند . نقشه معمول که به نام&nbsp;XML شناخته شده است رایج ترین نوع نقشه سایت است و صفحات مختلف وب سایت شما را نمایش می دهد. نقشه های دیگری هم برای ویدئو ، اخبار و تصاویر می باشد که برای معرفی این بخش ها به گوگل مورد استفاده قرار می گیرد.</p>', '<div class=\"row\"><div class=\"col-lg-12 col-sm-12 column\"><div class=\"ge-content ge-content-type-ckeditor\" data-ge-content-type=\"ckeditor\"><h3>نقشه سایت چیست؟</h3><p>شما برای وب سایت خود نیاز به یک نقشه سایت دارید تا موتورهای جستجوگر بتونند محتوا و مطالب داخل وب سایت شما را ببینند و ان را فهرست کنند. نقشه سایت به موتورهای جتستجو گر نشان می دهد که کدام مطالب شما مهم تر از بقیه می باشد . این نقشه ها دارای انواع مختلفی می باشند . نقشه معمول که به نام&nbsp;XML شناخته شده است رایج ترین نوع نقشه سایت است و صفحات مختلف وب سایت شما را نمایش می دهد. نقشه های دیگری هم برای ویدئو ، اخبار و تصاویر می باشد که برای معرفی این بخش ها به گوگل مورد استفاده قرار می گیرد.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/xmlsitemap-wordpress_1597742705.jpg\"></figure><p>&nbsp;</p><h3>چرا نقشه سایت بسیار مهم است؟</h3><p>موتورهای جستجو از نقشه سایت شما برای پیدا کردن صفحات مختلف استفاده می کنند و اگر صفحات سایت شما به درستی با هم پیوند داشته باشد ، خزندگان وب می توانند صفحات و بخش های مختلف وب سایت شما را پیدا کنند. گوگل برای اینکه صفحات وب شما را پیدا کند و یا به محصولات سایت شما دسترسی داشته باشد از طریق پیوندهای داخلی ایجاد شده این کار را انجام می دهد.</p><p>اگر شما سایتی را به تازگی ایجاد کرده اید حتما برای آن نقشه سایت درست کنید تا به گوگل و موتورهای جستجو دیگر کمک کنید سریعتر اطلاعات سایت شما را دیده و لینک های آن را پیدا کنند .</p><p>مثلا در مواردی که سایت شما دارای صفحات زیادی میباشد و امکان اینکه گوگل تمامی صفحات را ایندکس کند و تمامی آن ها را پیدا کند بسیار سخت است. با نقشه سایت شما می توانید تمامی صفحات خود را معرفی کرده تا بتوانند وارد شوند.</p><p>&nbsp;</p><h3>ایجاد نقشه سایت برای وردپرس</h3><p>اگر شما از وردپرس برای سایت خود استفاده کرده اید می توانید از پلاگین یوست برای درست کردن&nbsp;site map خود استفاده کنید. این نقشه سایت به صورت خودکار به روز رسانی می شود و در هرزمانی که شما یک صفحه جدید و یا یک محصول جدید را به سایت خود اضافه کنید به صورت اتوماتکی به آن اضافه می شود. علاوه بر یوست&nbsp;yoast افزونه های دیگری نیز برای این کار از جمله&nbsp;google xml sitemap وجود دارد.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/sitemap-yoast_1597742723.jpg\"><figcaption>yoast sitemap</figcaption></figure><p>&nbsp;</p><h3>ایجاد نقشه سایت برای سایت</h3><p>برای ایجاد نقشه سایت حرفه ای شما می توانید از سایت هایی که در این زمینه فعالیت دارند مانند&nbsp;XML-Sitemaps.com استفاده کنید . این سایت ها می توانند با گرفتن ادرس سایت شما&nbsp;sitemap آن را برای شما ایجاد کنند. نقشه سایت به توجه به&nbsp;CSM مورد استفاده شما ایجاد می شود.&nbsp;</p><p>قبل از اینکه نقشه سایت خود را برای قرار دادن در وبمستر تولز بردارید نیاز هست که ابتدا به طور آن کامل آن را بررسی کنید. اگر تمامی صفحات سایت شما وجود داشت و همه چیز خوب به نظر می رسید نوبت آن رسیده است که نقشه سایت را به گوگل معرفی کنید.&nbsp;</p><p>&nbsp;</p><h3>ثبت نقشه سایت درgoogle search console</h3><p>برای اینکه نقشه سایت خود را در به گوگل معرفی کنید ابتدا وارد اکانت گوگل وبمستر تولز خود شوید. پس به بخش بفرست آن در کنار صفحه نگاه کنید&nbsp; و برروی گزینه&nbsp;sitemap کلیک کنید. اگر از قبل نقشه سایت ارسال کرده باشید در این قسمت قابل مشاهده می باشد. در غیر اینصورت آدرس نقشه سایت خود را در این قسمت وارد کرده و سپس بر روی دکمه&nbsp;submit کلیک نمایید.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/sitemap--search-console_1597742775.jpg\"></figure><h3>گزارش های نقشه سایت</h3><p>بعد از ارسال نقشه سایت شما و زمانی که خزنده های گوگل در سایت شما وارد شد و فهرست نقشه شما با موفقیت قرار گرفت وsuccess را مشاهده کردید، گزارش های مربوط به این بخش برای شما قابل مشاهده می شود.</p><p>بخش&nbsp;valid&nbsp;&nbsp;صفحات سایت شما هستند که هیچ مورد و خطایی ندارند – صفحات من که به صورت&nbsp;exclusive هستند را می توانیم مشاهده کنیم که به چه مشکلی برخورد کرده اند و آنها را رفع کنیم&nbsp; و در صورت نیاز آنها را از سایت مپ خود پاک کنیم. همچنین می توانیم خطاها و مشکلات سایت خود را هم پیدا کنیم. سایت ما دارای چند صفحه است و ما می خواهیم چند صفحه ایندکس شود و چند صفحه ایندکس شده است.</p><p>مثلا اگر سایت شما دارای 5000 صفحه باشد و در قسمت سرچ کنسول شما فقط می توانید 3000 مورد از آن را ببینید به این معنی است که گوگل سایت شما را به درستی ایندکس نمی کند و این صفحات در موتورهای جستجو شناخته نشده است. شما می توانید مشکل خود را پیدا کرده به طور مثال شاید در سایت شما صفحات تکراری وجود داشته باشد.</p><p>&nbsp;</p><h3>قراردادن سایت مپ درrobot.txt</h3><p>درصورتی که نقشه سایت شما با فایل&nbsp;robot.txt هماهنگی داشته باشد مشکلی در سایت شما نباید وجود داشته باشد. مثلا در&nbsp;robot.txt اگر تعدادی از صفحات را نوایندکس کرده اید و نمی خواهید آن ها را نمایش دهید و اما در سایت مپ شما وجود دارد تداخل بوجود خواهد امد و خطا ایجاد می شود.</p><p>&nbsp;</p><h3>نکات مهم نقشه سایت</h3><p>برای سایت های کوچک خود از چندین بخش سایت مپ استفاده کنید.</p><p>تاریخ های موجود در&nbsp;url شما باید اخرین اصلاح موجو باشد. زمانی که تغییرات مهمی در سایت ایجاد کردید ، تاریخ سایت مپ خود را تغییر دهید و نیازی نیست هر زمانی که تغییر کوچکی ایجاد کردید تاریخ را تغییر دهید.</p><p>نقشه سایت شما باید بهتر است کمتر از 50 مگابایت باشد زیرا تعدادی از موتورهای جستجو از جمله&nbsp;google&nbsp;&nbsp;و&nbsp;&nbsp;bing&nbsp;&nbsp;نقشه های تا حداکثر 50 مگابایت را قبول میکنند.</p><p>نقشه سایت&nbsp;html درست کنید و با این کار به کاربران خود کمک کنید به صفحات سایت شما دسترسی داشته باشند.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/Sitemap-html_1597742813.jpg\"></figure><p>در سایت مپ HTML شما می توانید مانند نمونه بالا لینک صفحات سایت خود را در فوتر یا بخشی از سایت قرار دهید تا کاربر به راحتی بتواند صفحه مورد نیاز خود را پیدا کند. اگر چه این بخش در گوگل اثر بخشی ندارد اما به دلیل اینکه باعث راحتی و استفاده بهتر از سایت شما می شود بنابراین گوگل نیز به این مسئله اهمیت می دهد.</p></div></div></div>', 47, NULL, 'نقشه سایت,سایت مپ', 'نقشه سایت چیست؟ و چرا مهم است ؟ ایجاد نقشه سایت برای وردپرس و حرفه ای - ثبت نقشه سایت در google search console - گزارش های نقشه سایت - قراردادن سایت مپ در robot.txt و نکات مهم نقشه سایت', '{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/xmlsitemap-wordpress.jpg\",\"300\":\"\\/upload\\/images\\/2020\\/300_xmlsitemap-wordpress.jpg\",\"600\":\"\\/upload\\/images\\/2020\\/600_xmlsitemap-wordpress.jpg\",\"900\":\"\\/upload\\/images\\/2020\\/900_xmlsitemap-wordpress.jpg\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_xmlsitemap-wordpress.jpg\"}', 545, 0, 'article', '{\"rate\":null}', '2020-08-19', 1, '2020-08-18 09:28:48', '2023-02-19 00:32:13'),
(59, 'سئو و بهینه سازی مطالب', 2, 'سئو-و-بهینه-سازی-مطالب', '<p>با اینکه چگونه مطالب سایت خود را سئو کنید آشنا شوید و ابزارهای این کار را بشناسید تا در موتورهای جستجو رتبه کسب کنید. هدف خود را برای شورع یک مقاله مشخص کنید و برای ایجاد یک مسیر مطمئن از ابزار های درست برای بهینه سازی متن و مقالات استفاده کنید.</p>', '<div class=\"row\"><div class=\"col-lg-12 col-sm-12 column\"><div class=\"ge-content ge-content-type-ckeditor\" data-ge-content-type=\"ckeditor\"><h3>سئو و بهینه سازی مطالب چیست؟</h3><p>برای سئو یک مطلب و نوشته نیاز به برنامه ریزی ، ایجاد یک مطلب و بهینه سازی محتوا برای اینکه بتوانیم در موتورهای جستجو مانند گوگل رتبه داشته باشیم.</p><p>&nbsp;</p><h3>چرا سئو یک نوشته مهم است؟</h3><p>همه کسانی که بر روی سایت کار می کنند می دانند که باید سایت خود را براساس کلمات کلیدی بهینه سازی کنند و این کار در اصل نیاز به ایجاد یک محتوای شگفت انگیز با تلاش برای سئو این مطلب و در انتها ایاد یک نوشته و مقاله سئو شده می باشد.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/-سازی و سئو مطالب_1599209041.jpg\" alt=\"سئو محتوا\"></figure><p>&nbsp;</p><h3>بهترین روش برای داشتن یک مقاله بهینه سازی شده</h3><p>برای سایت خود لیستی از موضوعاتی را که می خواهید استفاده کنید ایجاد کنید. برای این کار ابتدا باید کلمه مورد نظر خود را پیدا کنید و مطابق با این کلمه متن خود را ایجاد کنید و برای اینکه در سئو و بهینه سازی و بازاریابی محتوا موفقیت بدست آورید باید مخاطبان هدف خود را شناسایی کنید.&nbsp;</p><p>بعد از کارهایی که در بالا انجام دادید برای پیدا کردن عناوین مناسب برای محتوا که بر روی سئو سایت شما تمرکز داشته باشد دو روش وجود دارد. شما ابتدا باید سوالات مشتریان و مخاطبان خود را پیدا کنید و در مقالات و مطالب خود به آنها پاسخ دهید . این گزینه ها را در گوگل ، سایت های سوال و جواب می توانید پیدا کنید.</p><p>برای این کار شما به تلاش زیاد و همینطور زمان نیاز دارید . برای اینکه بتوانید سرعت خود را بیشتر کنید ابزاری به نام Answer The Public وجود دارد که شما می توانید از آن استفاده نمایید . در سایت های ایرانی نیز سوالات مخاطبان را می توانید پیدا کنید و در نوشته های خود از آنها استفاده کنید. روش دوم استفاده از ویکی پدیا می باشد. شما می توانید بهش فهرست های مطالب ویکی پدیا را مشاهده کرده و ایده بگیرید. مثلا اگر یک سایت برای بازاریابی دارید به صفحه بازاریابی شبکه های اجتماعی بروید و ایده های مورد نظر خود را پیدا کنید و از آنها بر اساس کلمه کلیدی مورد نظر خود استفاده کنید.&nbsp;</p><p>مهمترین قسمت برای ایجاد یک مقاله تحقیق کلمات کلید می باشد. این کلمه های کلیدی هستند که می توانند چندین هزار بازدید را برای شما در سایت بوجود آورند. کلمات کلیدی محبوب را پیدا کنید و براساس آن نوشته خود را ایجاد کنید. بهترین راه برای پیدا کردن این کلمات همانطور که در بخش <strong>کلمات کلیدی</strong> هم در رابطه با آن صحبت شد پیشنهادات گوگل می باشد. &nbsp;فقط یک گزینه را وارد کنید و گوگل به شما کلمه هایی را که بیشترین سرچ و جستجو را دارند پیشنهاد می دهد و همینطور شما می توانید از سایت Infinite Suggest نیز برای پیدا کردن کلمات کلیدی خود استفاده کنید و لیستی از کلمات پیشنهادی را ببینید اما این ابزار به اندازه گوگل دقیق نیست.</p><p>ابزار دیگه ای که برای این کار می توانیم از آن استفاده کنیم <strong>SEORCH </strong>می باشد. شما ادرس url مقاله و بلاگ رقیب خود را در آن وارد کنید. برای پیدا کردن کلمه کلیدی مورد نظر می خواهیم روی متن و عبارات تمرکز کنیم و میزان کلمات کلیدی که در صفحه استفاده است را مشاهده می کنید. کلمات 3 تایی و 4 تایی که دارای بیشترین تکرار در سایت هستند را مورد بررسی قرار دهید . به این کلمات ، کلمات کلیدی دم بلند می گویند و دارای رقابت زیادی در صفحه اول گوگل نیستند اما شما می توانید مخاطبان خود را از این طریق جذب نمایید.</p><p>ابزار دیگه که برای این کار می توان از آن استفاده کرد <strong>kparser &nbsp;</strong>است ، شما میتوانید کلمات کلیدی مورد نظر خود را در تایپ کنید و کلمات مشابه را پیدا کنید تنها مشکل این ابزار این است که برای استفاده از آن در حجم زیاد باید آن را به نسخه حرفه ای ارتقا دهید.&nbsp;</p><p>&nbsp;</p><h3>ایجاد مطالب با بررسی هدف جستجو</h3><p>اگر چه وجود یک کلمه کلیدی برای مقالات شما بسیار مهم است اما نکته ای که ارزش بسیار زیادی دارد این است که ابتدا &nbsp; هدف جستجو خود را معین کنیم . به این معنی که محتوای شما باید نیازهای مخاطبان خود را برآورده کند . یعنی اگر کسی برای مطلب خاصی وارد سایت شما شد بتواند هدف خود را در این سایت و صفحه مورد نظر پیدا کند و نتیجه دلخواه خود را بگیرد.</p><p>به صفحه اول گوگل در کلمه مورد نظر خود نگاه بیندازید مردم بیشتر دنبال چه چیزی هستند و دنبال چه چیزی می گردند. بنابراین متن خود را براساس آن بنویسید و درنهایت مشاهده خواهید کرد که در صفحه اول گوگل خواهید بود.</p><p>برای مطلب مورد نظر خود یک محتوای طولانی و جامع ایجاد کنید که تمامی نیازهای مخاطبان شما را برآورده کند و به طور کامل موضوع شما را تحت پوشش قرار دهد .</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/copy-main_1599209065.jpg\" alt=\"بهینه سازی و سئو سایت\"><figcaption>بهینه سازی و سئو سایت</figcaption></figure><p>&nbsp;</p><h3>استفاده از کلمات کلیدی در مطالب</h3><p>استفاده از کلمات کلیدی در محتوا و مطالب شما یکی از مهم ترین بخش های این کار است تا مطالب خود را بتوانید به بهترین شکل سئو کنید. شاید سوال شما این باشد که چندبار باید از کلمات کلیدی خود در متن استفاده کنید؟</p><p>تراکم کلمات کلیدی از نظر گوگل وجود ندارد یا در اصل گوگل به آن توجهی نمیکند. نکته مهمی که وجود دارد این است که مکان استفاده از کلمات کلیدی مهم تر از تعداد استفاده آن در سایت و محتوا شما است. مکان های که شما می توانید از آن استفاده کنید:</p><ul><li>آدرس سایت شما URL</li><li>برچسب عنوان شما</li><li>100 کلمه اول صفحه شما</li><li>در یک برچسب H1</li><li>در یک برچسب H2</li></ul><p>شما باید کلمات کلیدی خود را در آدرس صفحه خود قرار دهید &nbsp;و از کلمه کلیدی خود در برچسب عنوان استفاده نمایید. بهترین راه این است که از این کلمه یک بار در عنوان استفاده شود و استفاده بیشتر از آن از نظر گوگل مناسب نیست . همچنین شما می توانید از این کلمات برای بهینه سازی محتوای خود در 100 تا 150 کلمه اول استفاده کنید.&nbsp;</p><p>عنوان من شامل کلمه کلیدی من است که H1 می باشد. تنها نکته ای که باید به خاطر داشته باشید این است که یکبار از H1&nbsp; در محتوای خود استفاده کنید زیرا استفاده بیشتر موجب گیج شدن موتورهای جستجو می شود. در نهایت می توانید از کلمات کلیدی در h2 نیز استفاده کنید . عنوان های h2 تمرکز کلمه کلیدی شما را نشان می دهد و همینطور موجب سئو متن شما می شود.&nbsp;</p><p>&nbsp;</p><h3>بهینه سازی عنوان و متا توضیحات سایت</h3><p>&nbsp;</p><p>برای رتبه گرفتن یک مطلب نیاز به دریافت سیگنال می باشد و هر چه میزان کلیک در آن بیشتر باشد CTR بالا رفته و رتبه سایت نیز بالا تر خواهد رفت . باز اضافه کردن کلمه کلیدی خود در عنوان سایت شما می توانید آن را برای گرفتن امتیاز بیشتر در CTR بهینه کنید و کلیک های بیشتری داشته باشید. مثلا می توانید از اعداد در عنوان سایت خود استفاده کنید.&nbsp;</p><p>بخش بعدی توضیحات متا سایت است که اگر چه بر روی رتبه بندی گوگل تاثیر مستقیم ندارند اما اگر متن مناسبی را برای این بخش انتخاب کنید شما می توانید مخاطبان بیشتری را برای مشاهده مطالب خود جذب کنید.برای هر صفحه از سایت خود یک meta description جداگانه و همینطور منحصر بفرد بنویسید تا میزان کلیک شما افزایش یابد.&nbsp;</p><p>&nbsp;</p><h3>استفاده از لینک سازی داخلی</h3><p>استفاده از لینک سازی داخلی بهترین روش برای بهینه سازی محتوای شما می باشد زیرا از این طریق کاربران و همینطور موتورهای جستجو می توانند به صفحات دیگر سایت شما دسترسی پیدا کنند و محتوای مرتبط را پیدا کنند . &nbsp;به همین علت است که وجود لینک های داخلی در سایت شما بسیار مفید است. صفحات سایت را فهرست بندی می کنند و ساختار و معماری سایت را مشخص می کنند. بهترین کار این است که برای هر محتوا خود 4 الی 5 لینک داخلی &nbsp;ایجاد کنید.</p><p>&nbsp;</p><h3>پیوند و لینک به سایت های خارجی</h3><p>براساس نتایج بده دست آمده از بررسی سایت هایی که در صفحه اول موتورهای جستجو هستند استفاده از پیوندهای خروجی باعث بهبود در رتبه بندی صفحه سایت در گوگل می شود. از نظر گوگل محتواهایی که دارای متن های کامل و مشخص هستند و نتیجه مورد نظر را به کاربران می دهند بسیار مفید هستند و می خواهد افراد را به سمتی هدایت کند که نیاز مخاطب را برطرف کند. &nbsp;بنابراین با افزودن پیوندهای خارجی به سایت های معتبر ، محتوای خود را به بهترین شکل سئو می کنید. شما می توانید از لینک سازی خارجی به تعداد زیاد در مطالب خود استفاده کنید تا مخاطبان شما بتوانند به بهترین شکل از آن استفاده کنند.</p><p>&nbsp;</p><h3>استفاده از کلمات مرتبط با کلمات کلیدی</h3><p>کلمات کلیدی LSI &nbsp;به کلماتی گفته می شود که با موضوع شما ارتباط نزدیکی دارند . استفاده از این کلمات در سئو متن شما تاثیر بسیار زیادی دارد و بسیار عالی است .این کلمات کمک می کنند که گوگل و موتورهای جستجو موضوع مقاله شما را بهتر متوجه شوند. شما کلمه کلیدی هدف خود را در برچسب عنوان و URL خود می بینید. برای اینکه موضوع را به طور کامل پوشش دهید کلمات کلیدی مرتبط LSI &nbsp;به شما کمک می کنند و به این صورت شما متن خود را برای کلمات کلیدی مرتبط نیز بهینه می کنید. برای پیدا کردن کلمات کلیدی LSI می توانید از ابزاری رایگان به نام <strong>LSIKeywords.com</strong> &nbsp;استفاده کنید. کلمه کلیدی اصلی خود را در آن وارد کرده و کلمه مرتبط را دریافت کنید.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/seo-content-writing_1599210389.jpg\" alt=\"سئو محتوا\"></figure><p>&nbsp;</p><h3>استفاده از تصویر و ویدئو در متن</h3><p>&nbsp;</p><p>استفاده از تصاویر و ویدئو یا پادکست ممکن است کاملاً در بخش \"نوشتن سئو\" قرار نگیرد &nbsp;اما تصاویر ، اینفوگرافیک ها و فیلم ها برای سئو بسیار مهم هستند و علاوه بر این محتوا شما را جذاب می کنند. در هر زمانی از چند رسانه ای ها در محتوا خود استفاده کنید. این کار علاوه بر افزایش میزان جذابیت می تواند موجب می شود نوشته شما تاثیر بیشتری بر روی مخاطب داشته باشد.</p><p>&nbsp;</p><h3>استراتژی تبلیغ برای معرفی متن</h3><p>حقیقت این است که بعد از انتشار یک محتوا شما در گوگل رتبه ای نخواهید داشت برای اینکه بتوانید رتبه مورد نظر خود را کسب کنید نیاز به تبلیغ محتوا دارید. برای این کار نیاز به استراتژی در این زمینه دارید. شما از روش هایی می توانید برای این کار استفاده کنید مثلا شما می توانید این متن و مقاله را برای افرادی که به آن علاقمند هستند و یا نیاز دارند ارسال کنید. از طریق ایمیل می توانید مخاطبان خود را برای انتشار مطلب جدید آماده کنید.&nbsp;</p><p>از هر وسیله تبلیغاتی برای معرفی محتوا خود استفاده کنید از جمله ایمیل - شبکه های اجتماعی لینکدین - فیس بوک - اینستاگرام و ... . این بخش از فعالیت شما کمک زیادی برای معرفی شما به مخاطب خواهد کرد. همچنین می توانید مخاطبان رقیبان خود را پیدا کرده و محتوای خود را برای آن ها نیز تبلیغ کنید. در صورتی که محتوا شما بهتر باشد شما این شانس را دادری که کاربران را جذب کنید. برای این کار از ahrefs می توانید استفاده کنید که البته این ابزار رایگان نیست و برای افراد مبتدی بهتر است از ابزار &nbsp;Open Link Profiler در ابتدای کار خود استفاده کنند.&nbsp;</p><p>&nbsp;</p></div></div></div>', 51, NULL, 'بهینه سازی مقاله,سئو مقاله,سئو مطالب,بهینه سازی مطلب', 'مطالب خود را برای سئو بهینه سازی کنید. در این مقاله ما به شما آموزش می دهیم که چگونه برای مطالب خود کلمه کلیدی و هدف پیدا کنید و از آن در مقالات خود استفاده کنید. با این ابزارها در طرح و وب آشنا شوید.', '{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/copy-main.jpg\",\"300\":\"\\/upload\\/images\\/2020\\/300_copy-main.jpg\",\"600\":\"\\/upload\\/images\\/2020\\/600_copy-main.jpg\",\"900\":\"\\/upload\\/images\\/2020\\/900_copy-main.jpg\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_copy-main.jpg\"}', 416, 0, 'article', '{\"rate\":null}', '2020-09-02', 1, '2020-09-01 14:00:59', '2023-03-02 07:18:59'),
(60, 'چرا باید به سئو سایت اهمیت بدهم', 2, 'چرا-باید-به-سئو-سایت-اهمیت-بدهم', '<p>چرا سئو ویا بهینه سازی سایت در سالهای اخیر اهمیت زیادی پیدا کرده است؟ در یک جمله می توان گفت که جستجو منبع بزرگی از ترافیک تعریف می شود.در عکس زیر می بینید که بیشترین ترافیک به سایت ها در دنیا از کدام منابع صورت گرفته است….</p>', '<div class=\"row\"><div class=\"col-lg-12 col-sm-12 column\"><div class=\"ge-content ge-content-type-ckeditor\" data-ge-content-type=\"ckeditor\"><p>در یک جمله می توان گفت که جستجو منبع بزرگی از ترافیک تعریف می شود.در عکس زیر می بینید که بیشترین ترافیک به سایت ها در دنیا از کدام منابع صورت گرفته است.همانطور که می بینید تقریبا ۶۰ ٪ از ترافیک سایت ها از گوگل شروع می شود و اگر سایر موتور های جستجو مانند&nbsp;Bing, Yahoo &nbsp;را هم اضافه کنیم ۷۰ ٪ کل ترافیک سایت از&nbsp;موتورهای جستجو سرچشمه می گیرد.</p><figure class=\"table\"><table><tbody><tr><td><figure class=\"image image_resized\" style=\"width:75%;\"><img src=\"https://www.tarhoweb.com/upload/images/2020/10-1-traffic-data-referrer_1602155178.jpg\"></figure></td><td><figure class=\"image image_resized\" style=\"width:75%;\"><img src=\"https://www.tarhoweb.com/upload/images/2020/10-2-web-traffic-sources_1602155191.jpg\"></figure></td></tr></tbody></table></figure><h3>چرا سئو ویا بهینه سازی سایت در سالهای اخیر اهمیت زیادی پیدا کرده است؟</h3><p>خوب بیایید با یک مثال اهمیت سئو را بیان کنیم.</p><p>فرض کنید شما یک شرکت در زمینه سئو راه اندازی کرده اید.&nbsp;بر طبق ابزار&nbsp;Google Keyword Planner هر ماه&nbsp;کلمه&nbsp;“سئو” ۲۱ میلیون بار سرچ می شود.حالا با توجه به اینکه ۲۰٪ از کل کلیک های سرچ گوگل مختص رتبه اول می باشد&nbsp;, در نتیجه هر ماه حدود ۴ میلیون نفر وارد سایت شما می شوند به شرط اینکه رتبه اول باشد.</p><p>حالا این سوال پیش می آید که این بازدید کنندگان چقدر ارزش برای سایت شما به ارمغان می آورند؟</p><p>فرض کنید متوسط هزینه ای که یک تبلیغ کننده برای کلیک روی سایت خود را می دهد حدود ۱ دلار باشد وقتی ۴ میلیون بازدید کننده در ماه بروی سایت شما کلیک می کند یعنی ارزش ۴میلیون ترافیک وب سایت حدود ۴ میلیون دلار در ماه خواهد بود و این فقط برای یک کلمه کلیدی سرچ شده است .اگر سایت شما&nbsp;SEO-friendly باشد مطمئنا می توانید صدها و یا هزاران کلمه کلیدی مختلف رتبه بندی کنید.</p><p>در بعضی از کلمات ممکن است ارزش هر کلیک فرق کند و بیشتر از ۱ دلار باشد.</p></div></div></div>', 50, 'اهمیت سئو | چرا سئو مهم است | چرا باید به سئو سایت اهمیت بدهم', 'اهمیت سئو,اصول سئو,چرا سئو', 'چرا سئو ویا بهینه سازی سایت در سالهای اخیر اهمیت زیادی پیدا کرده است؟در یک جمله می توان گفت که جستجو منبع بزرگی از ترافیک تعریف می شود.در عکس زیر می بینید که بیشترین ترافیک به سایت ها در دنیا از کدام منابع صورت گرفته است.همانطور که می بینید تقریبا ۶۰ ٪ از ترافیک سایت ها از گوگل شروع می شود و اگر سایر موتور های جستجو مانند Bing, Yahoo  را هم اضافه کنیم ۷۰ ٪ کل ترافیک سایت از موتورهای جستجو سرچشمه می گیرد.', '{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/Importance-of-SEO.jpg\",\"300\":\"\\/upload\\/images\\/2020\\/300_Importance-of-SEO.jpg\",\"600\":\"\\/upload\\/images\\/2020\\/600_Importance-of-SEO.jpg\",\"900\":\"\\/upload\\/images\\/2020\\/900_Importance-of-SEO.jpg\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_Importance-of-SEO.jpg\"}', 449, 0, 'article', '{\"rate\":null}', '2020-09-09', 1, '2020-09-09 15:24:13', '2023-02-26 20:36:47'),
(61, 'آشنایی با ابزار بهینه سازی SEMrush', 2, 'آشنایی-با-ابزار-بهینه-سازی-SEMrush', '<p style=\"text-align:justify;\"><span style=\"color:black;\">یکی از مهمترین ابزار بهینه سازی سایت که در بین دیجیتال مارکترها و سئوکار ها کاملا شناخته شده است ابزار&nbsp;SEMrush میباشد.با کمک این ابزار خطاهای موجود مانند لینک هایی که در صفحات ۴۰۴تعریف شده اند و یا یکی بودن&nbsp;h1 های دو صفحه در سایت که نقش به سزایی در بالا بردن رتبه شما در نتایج گوگل دارند.</span></p>', '<div class=\"row\"><div class=\"col-lg-12 col-sm-12 column\"><div class=\"ge-content ge-content-type-ckeditor\" data-ge-content-type=\"ckeditor\"><p style=\"text-align:justify;\"><span style=\"color:black;\">یکی از مهمترین ابزار بهینه سازی سایت که در بین دیجیتال مارکترها و سئوکار ها کاملا شناخته شده است ابزار&nbsp;SEMrush میباشد.با کمک این ابزار خطاهای موجود مانند لینک هایی که در صفحات ۴۰۴تعریف شده اند و یا یکی بودن&nbsp;h1 های دو صفحه در سایت که نقش به سزایی در بالا بردن رتبه شما در نتایج گوگل دارند.</span></p><h3 style=\"text-align:justify;\">SEMrush چیست و کاربرد آن در بهینه سازی و سئو سایت (قسمت اول)</h3><p style=\"text-align:justify;\"><span style=\"color:black;\">معمولا اطلاعات اولیه از گوگل گرفته می شود بسیاری از کاربراین بعد کار با سمراش براین عقیده هستند که اطلاعات آنالیز شده در&nbsp;SEMrush از گوگل آنالیتیکس و&nbsp;webmastertools نیز کاربردی تر است.</span></p><p style=\"text-align:justify;\"><span style=\"color:black;\">آنالیز سئو پایه به صورت رایگان در اختیار شما قرار می گیرد و بقیه موارد و سئو تکنیکال به صورت پولی گزارش ها را ارائه می دهند.</span></p><p style=\"text-align:justify;\"><span style=\"color:black;\">پس کار با ابزار&nbsp;SEMrush را آغاز می کنیم.</span></p><p style=\"text-align:justify;\">منوی Domain Analytics بخش Overview :</p><figure class=\"image image_resized\" style=\"width:50%;\"><img src=\"https://www.tarhoweb.com/upload/images/2020/semrush1_1602952485.png\"></figure><p style=\"text-align:justify;\">&nbsp;</p><p style=\"text-align:justify;\"><span style=\"color:black;\">همانطور که در عکس بالا می بینید زمانی که در صفحه&nbsp;&nbsp;Domain Analytics&nbsp;هستید در ستون سمت چپ تب مربوط به آن صفحه به رنگ نارنجی در می آید. در این صفحه شما می توانید آدرس دامنه مورد نظر را وارد کنید و دکمه سبز رنگ&nbsp;search&nbsp;&nbsp;را بزنید تا تمامی گزارشات و آنالیز های کلی را به شما نمایش دهد که در عکس زیر دقیق تر می توانید آن ها را ببینید .</span></p><p style=\"text-align:justify;\">&nbsp;</p><p style=\"text-align:justify;\"><span style=\"color:black;\">منوی&nbsp;orgnic research&nbsp;&nbsp;:</span></p><p style=\"text-align:justify;\"><span style=\"color:black;\">اگر در ستون سمت چپ توجه کنید زیر تب فعال&nbsp;overview در بخش&nbsp;&nbsp;domain Analytic گزینه&nbsp;organic Research&nbsp;&nbsp;واقع شده است .اگر بر روی آن کلیک کنید وارد صفحه زیر می شوید.&nbsp;</span></p><p style=\"text-align:justify;\"><span style=\"color:black;\">حالا دقت کنید که این بخش شامل تب های&nbsp;Overview&nbsp;,&nbsp;position</span></p><p style=\"text-align:justify;\"><span style=\"color:black;\">می باشد که با خط های قرمز زیر آنها اشاره شده است.</span></p><p style=\"text-align:justify;\"><span style=\"color:black;\">در تب&nbsp;overview اولین نمودار مربوط به&nbsp;organic Keyword trends می باشد که شما ...</span></p></div></div></div>', 52, 'SEMrush چیست؟ - آموزش SEMRush و کاربرد آن در بهینه سازی سایت', 'سمراش,SEMrush,ابزار بهینه سازی', 'یکی از مهمترین ابزار بهینه سازی سایت که در بین دیجیتال مارکترها و سئوکار ها کاملا شناخته شده است ابزار SEMrush میباشد.با کمک این ابزار خطاهای موجود مانند لینک هایی که در صفحات ۴۰۴تعریف شده اند و یا یکی بودن h1 های دو صفحه در سایت که نقش به سزایی در بالا بردن رتبه شما در نتایج گوگل دارند.', '{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/semrush-red_1200x1200-300x300.jpg\",\"300\":\"\\/upload\\/images\\/2020\\/300_semrush-red_1200x1200-300x300.jpg\",\"600\":\"\\/upload\\/images\\/2020\\/600_semrush-red_1200x1200-300x300.jpg\",\"900\":\"\\/upload\\/images\\/2020\\/900_semrush-red_1200x1200-300x300.jpg\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_semrush-red_1200x1200-300x300.jpg\"}', 701, 0, 'article', '{\"rate\":null}', '2020-08-26', 1, '2020-09-09 20:32:10', '2023-02-27 00:14:01'),
(62, 'تجربه کاربری در سئو', 1, 'تجربه-کاربری-در-سئو', '<p>در اولین روزهای سئو ، گوگل سایت ها را براساس بک لینک و سئو داخلی ارزیابی می کرد. اما امروزه گوگل تجربه کاربری را نیز در الگوریتم های خود قرار داده است. تعامل کاربر با سایت را در نظر گرفته و از آن برای ارزیابی استفاده می کنند. در این بخش متوجه می شوید که رابطه کاربری بر روی چه چیزهایی تاثیر می گذارد و سایت های موفق چگونه رابط کاربری خود را بهینه می کنند.</p>', '<p>در اولین روزهای سئو ، گوگل سایت ها را براساس بک لینک و سئو داخلی ارزیابی می کرد. اما امروزه گوگل تجربه کاربری را نیز در الگوریتم های خود قرار داده است. تعامل کاربر با سایت را در نظر گرفته و از آن برای ارزیابی استفاده می کنند. در این بخش متوجه می شوید که رابطه کاربری بر روی چه چیزهایی تاثیر می گذارد و سایت های موفق چگونه رابط کاربری خود را بهینه می کنند.</p><p>در این بخش ما به شما کمک می کنیم تا تجربه کاربری UX &nbsp;سایت خود را بهینه کنید و رتبه بهتری را در گوگل کسب کنید.</p>', 44, 'تجربه کاربری', 'تجربه کاربری', 'در اولین روزهای سئو ، گوگل سایت ها را براساس بک لینک و سئو داخلی ارزیابی می کرد. اما امروزه گوگل تجربه کاربری را نیز در الگوریتم های خود قرار داده است. تعامل کاربر با سایت را در نظر گرفته و از آن برای ارزیابی استفاده می کنند. در این بخش متوجه می شوید که رابطه کاربری بر روی چه چیزهایی تاثیر می گذارد و سایت های موفق چگونه رابط کاربری خود را بهینه می کنند.', '\"\"', 463, 0, NULL, NULL, '2020-09-14', 1, '2020-09-13 14:33:39', '2023-03-03 01:37:32'),
(63, 'زمان حضور کاربر در سایت', 2, 'زمان-حضور-کاربر-در-سایت', '<p>زمانی که شما یک کلمه را در گوگل جستجو می کنید و وارد صفحه شما می شود ، مدت زمانی را که در سایت شما حضور دارد و قبل از بازگشت به صفحه&nbsp;serp را زمان حضور کاربر در سایت یا به اصطلاح&nbsp;Dwell Time می گویند.</p>', '<div class=\"row\"><div class=\"col-lg-12 col-sm-12 column\"><div class=\"ge-content ge-content-type-ckeditor\" data-ge-content-type=\"ckeditor\"><h3>DWELL TIME یا همان زمان حضور در سایت چیست؟</h3><p>زمانی که شما یک کلمه را در گوگل جستجو می کنید و وارد صفحه شما می شود ، مدت زمانی را که در سایت شما حضور دارد و قبل از بازگشت به صفحه&nbsp;serp را زمان حضور کاربر در سایت یا به اصطلاح&nbsp;Dwell Time می گویند.</p><p>شما یک کلمه را در گوگل سرچ می کنید و نتیجه اول به نظر شما مطلوب می باشد و بر روی آن کلیک میکنید اما زمانی که وارد سایت می شوید از نظر ظاهری مناسب نیست و خواسته شما را برآورده نمی کند و محتوای مفیدی در آن پیدا نمی کنید بنابراین در کوتاه ترین زمان و قبل از 5 ثانیه از آن خارج شده و روی گزینه دیگری کلیک می کنید.&nbsp;</p><p>زمان حصور شما در این سایت 5 ثانیه بوده است و گوگل به این نتیجه می رسد که شما از نتیجه راضی نیستید و این سایت برای شما مفید نبوده است.</p><p>-</p><p>در حالت دوم شما بعد از جستجو روی گزینه دوم کلیک کرده اید و این بار محتوا برای شما مفید بوده است و به نتیجه ای می خواسته اید رسیدیدو علاوه بر ظاهر مناسب شما می توانید مطالب مفیدی را نیز مشاهده کنید. در سایت به مدت 4 الی 5 دقیقه مانده اید و مطالب آن را مطالعه کرده اید. سپس دوباره بر روی گزینه بعدی برای جستجو کلیک میکنید.</p><p>از آنجایی که شما زمان طولانی را در این سایت بوده اید گوگل امتیاز بیشتری را برای این سایت در نظر گرفته و به آن رتبه می دهد. اما مورد دیگری می توانیم به آن اشاره کنیم:</p><p>زمان حضور کاربر در سایت &nbsp;&nbsp;Dwell Timeو دیگری ضریب بازگشت&nbsp;bounce rate می باشد.</p><p>&nbsp;&nbsp;bounce rate یا همان زمان بازگشت به معنی این است که یک فرد وارد سایت شده است و بدون اینکه بر روی گزینه ای کلیک کند دکمه بازگشت را می زند ، اگر فرد دوباره بر روی این نتیجه کلیک کند در اصلاح ضریب بازگشت یا همان&nbsp;bounce rate داشته است.</p><p>این دو عامل با هم می تواند باعث شود تا شما در رتبه بندی موتور های جستجو رتبه بالاتری را کسب کنید.&nbsp;</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/1_1600777959.JPG\"></figure><h3>چرا زمان حضور کاربر مهم است؟</h3><p>موتورهای جستجو در الگوریتم خود از این بخش برای رتبه دهی به سایت ها استفاده می کنند. اگر سوال شما این است که آیا زمان حضور کاربر در سایت برای گوگل مهم است؟ در هیچ زمانی این نکته را گوگل تائید و یا تکذیب نکرده است. اما براساس مشاهدات و نتایج این گونه به نظر می رسد که گوگل از زمان حضور کاربر در سایت به عنوان یک سیگنال استفاده می کند.</p><p>مثلا در الگوریتم رنک برین&nbsp;rank brain کاملا گفته شده است که گوگل به زمان حضور شخص در یک سایت توجه می کند و یک خاصیت جدیدی که گوگل به کاربران داده این است که شما می توانید وب سایت خاصی را از نتایج گوگل حذف کنید. در صورتی که شما سریع از یک سایت عبور کنید گوگل تصمیم میگیرد سایت را برای شما مسدود کند.</p><p>و در پایان براساس مطالعاتی که در سایت&nbsp;moz انجام شده است ، این مطلب را نشان می دهد که زمان حضور کاربر در سایت شما رابطه مستقیمی با رتبه سایت شما دارد.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/2_1600777988.JPG\"></figure><p>&nbsp;</p><h3>بهترین روش برای افزایش حضور کاربر در سایت</h3><p>اگر می خواهید افراد زمان طولانی تری را در سایت شما باید کاری کنید آنها در سایت شما مطالب جالبی را پیدا کنند و زمان بیشتری را در آن بمانند. در اینجا شما می توانید از روش&nbsp;PPT استفاده کنید.&nbsp;</p><p>در اولین خط محتوا خود، مختصری در مورد مطالبی که در این مقاله وجود قرار دهید. این به کاربران و جستجو گران گوگل نشان می دهد که این دقیقا مطلبی است که آن ها دنبال آن بوده اند.</p><p>به این صورت کاربر وارد بخش بعدی سایت شما و محتوای اصلی می شود. در بخش بعدی شما می توانید در مطالب خود از ویدئو استفاده کنید. این کار زمان حضور در سایت شما را به صورت شگفت انگیزی زیاد خواهد کرد.</p><p>در رابطه با مقاله و مطلب خود یک ویدئو آماده کنیدو آن را در سایت خود قرار دهید به این صورت زمان حضور کاربر در سایت افزایش خواهد داشت.</p><p>در مرحله بعدی شما باید مقاله طولانی تری را برای سایت خود بنویسید کاملا مشخص است که خواندن یک محتوا با 3000 کلمه از یک محتوا با 500 کلمه زمان بیشتری خواهد برد. اما باید در نظر داشته باشید که محتوای شما با کیفیت باشد.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/3_1600778001.JPG\"></figure><h3>افزایش حضورکاربر و بالا بردن سرعت سایت</h3><p>زمانی که در صفحه شما بخش گفتگو و قرار دادن کامنت فعال باشد شما می توانید رتبه بهتری را کسب کنید. به همین دلیل قرار گرفتن نظر افراد در سایت موجب میشود تا زمان بیشتری را در سایت حضور داشته باشند. اگر زمان لود شدن و بارگیری سایت شما زمان طولانی تری را داشته باشد افراد سریعا در سایت شما خارج می شوند. بنابراین یکی از راه های حفظ کاربر در سایت این است که سرعت سایت خود را بهینه کنید. سیگنال بهینه سازی سایت در رتبه بندی سایت شما نقش بسیار مهمی دارد.&nbsp;</p><p>&nbsp;</p><h3>کوتاه کردن مطالب به بخش های مختلف</h3><p>محتوای خود را در مقاله های طولانی به بخش های مختلف کوتاه تر کنید و از تگ های&nbsp;h2 برای جدا کردن هر بخش استفاده کنید.&nbsp;</p><p>شما می توانید از فهرست بندی برای مشخص تر شدن مطالب خود استفاده کنید و همینطور از تصاویر در میان محتوای خود استفاده کنید. این مطالب به مردم کمک می کند تا مطالب را بهتر درک کنند.</p><p>&nbsp;</p><h3>بهینه سازی برای موبایل</h3><p>یکی از مهم ترین نکات برای سایت شما بهینه سازی برای موبایل و تلفن های همراه می باشد. از طریق کنسول جدید گوگل شما می توانید متوجه شوید آیا سایت شما برای موبایل بهینه سازی شده است یا نه. شما می توانید ببینید کدام صفحات بری تجربه کاربری خوب و یا بد هستند. شما می توانید مشکل را پیدا کرده و حتی راه حل آن را نیز پیدا کنید.</p><p>و به شما اطلاع خواهد داد که&nbsp;Google کدام یک از صفحات سایت شما را تجربه کاربر بد موبایل می داند:</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/Capture_1600778046.JPG\"></figure><p>&nbsp;</p><h3>اندازه گیری زمان حضور کاربر</h3><p>برای اینکه زمان حضور کاربر در سایت را اندازه گیری کنید باید وارد گوگل انالیتیکس شوید و میانگین زمان حضور در سایت را مشاهده کنید. این میانگین زمانی است که کسی پس از ورود در صفحه در سایت شما می گذراند.</p><p>برای این کار&nbsp;ابتدا وارد&nbsp;Google Analytics شوید و روی بخش \"Behavior \" → \"&nbsp;Site Content \" -&gt; \"&nbsp;Landing Pages \" کلیک کنید و تنظیمات را به صورتی قرار دهید که ترافیک سایت خود را ببینید. در این حالت شما می توانید مدت زمان حضور کاربر را ببینید.</p><p>نگاه کنید کدام قسمت در سایت شما طرفدار بیشتری داشته است و کاربر بیشتری را جذب کرده است در این حالت شما می توانید صفحات دیگر را نیز بر اساس آن تنظیم کنید. و صفحاتی که مناسب نیستند را نیز بهبود ببخشید.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/_1600778068.JPG\"></figure><h3>زمان مناسب چیست؟</h3><p>در اینکه یک سایت زمان مناسب داشته باشد عوامل زیادی موثر است از جمله :</p><p>یک زمان خوب \"خوب\" به ده ها عامل از جمله:</p><p>توضیحات مختصر ، محتوای شما ، کلمه ای که کاربران برای پیدا کردن سایت شما استفاده می کنند و ... . بنابراین بهترین روش این است که از استراتژی هایی که آموخته اید استفاده کنید و زمان حضور کاربر را در سایت خود بالا ببرید.</p><figure class=\"image\"><img src=\"https://tarhoweb.com/upload/images/2020/_1600778079.JPG\"></figure></div></div></div>', 62, 'زمان حضور کاربر در سایت چیست؟ بهینه سازی dwell time', 'زمان حضور کاربر,dwell time', 'زمانی که شما یک کلمه را در گوگل جستجو می کنید و وارد صفحه شما می شود ، مدت زمانی را که در سایت شما حضور دارد و قبل از بازگشت به صفحه serp را زمان حضور کاربر در سایت یا به اصطلاح Dwell Time می گویند.', '\"\"', 445, 0, 'article', '{\"rate\":null}', '2020-09-14', 1, '2020-09-13 14:33:57', '2023-02-28 17:30:11'),
(64, 'طراحی سایت Seo Friendly', 2, 'طراحی-سایت-Seo-Friendly', '<p>طراحی یک وب سایت سئومحور یا Seo Friendly چیست؟ به وب سایت هایی که برای موتورهای جستجو بهینه شده است و قابلیت دسترسی و ایندکس را دارد وب سایت سئو محور و یا Seo Friendly می گویند.</p>', '<div class=\"row\"><div class=\"col-lg-12 col-sm-12 column\"><div class=\"ge-content ge-content-type-ckeditor\" data-ge-content-type=\"ckeditor\"><h3>طراحی سایت سئو دوستانه یا Seo Friendly چیست؟</h3><p>سایت هایی که برای سئو بهینه سازی شده است دارای بازدید بیشتری هستند زیرا این وب سایت ها برای موتورهای جستجو بهینه شده هستند. شما باید کاربران خود را در الویت قرار دهید . سایت های خود را برای کاربران و همینطور موتورهای جستجو طراحی کنید .&nbsp;</p><h3>بهترین روش ها برای ایحاد صفحات سایت</h3><p>برای اینکه گوگل بتواند مطالب سایت شما را به طور کامل ایندکس کند شما باید سایت خود را در این زمینه بهینه سازی کنید.</p><p>&nbsp;اولین کاری که باید انجام دهید این است که برای تصویر خود alt قرار دهید تا گوگل بتواند تصاویر را شناسایی کند. اگر شما تعریفی از تصاویر خود قرار ندهید گوگل نمی تواند تصاویری که شما در سایت قرار داده اید را شناسایی کند. برای تصاویر خود نام متناسب با موضوع مورد نظر و همینطور توصیف ویژگی عکس ALT را تعریف کنید.&nbsp;</p><p>در برخی موارد محتوای پنهان شده در پشت برخی از قسمت ها مثلا پست فرم ها و منو ها ممکن است از دید موتورهای چستجو پنهان بماند. در طراحی وبسایت خود دقت کنید و مطالب را به صورتی قرار دهید که کاملا قابل خواندن باشند و گوگل به راحتی بتواند آنها را ایندکس کند.</p><p>در صورتی که شما از ویدئو و یا فایل صوتی در سایت خود استفاده میکنید در رابطه با این بخش حتما باید از متن مرتبط استفاده نمایید. بنابراین اگر فایل چندرسانه ای در سایت خود منتشر میکنید حتما اطلاعات مورد نظر در رابطه با آن را نیز در اختیار گوگل قرار دهید.</p><h3>صفحات مسدوده شده</h3><p>متا تگ \"noindex\" در Robots.txt به موتورهای جستجو می گوید که صفحه ای را فهرست نکنند و این صفحات یا در دست ساخت هستند یا فقط برای کارمندان داخلی طراحی شده اند . ولی باید دقت داشته باشید که در صفحات دیگر سایت شما و همینطور صفحاتی که مشتریان به آن دسترسی دارند نباید از این تگ استفاده کنید.</p><h3>از مرورگرSEO استفاده کنید</h3><p>آیا می خواهید 100٪ مطمئن شوید که محتوای شما ایندکس شده و ربات های گوگل در داخل سایت شما خزیده است؟ از مرورگر SEO استفاده کنید. مرورگر SEO به شما نشان می دهد که صفحه شما از نظر موتورهای جستجو چگونه به نظر می رسد.</p><p>من توصیه می کنم از مرورگر رایگان و مفید Zeo SEO استفاده کنید:</p><p>شما فقط باید یک URL از سایت خود در ابزار وارد کنید &nbsp;سپس سایت خود را از دیدگاه عنکبوت گوگل مشاهده خواهید کرد. اما اگر متوجه شدید بخش هایی از سایت شما قابل مشاهده نمی باشد بنابراین این قسمت ها برای گوگل هم قابل مشاهده نیستند.</p><h3>صفحات سایت خود را در وبمستر معرفی کنید</h3><p>کنسول جستجوی Google دارای ویژگی های خوب برای بازرسی URL است. اگر Google مشكلی در دسترسی به صفحه شما دارد ، به شما اطلاع می دهد. اگر همه چیز خوب باشد ، علامت سبز دریافت می کنید و اگر مشکلی در صفحات سایت شما وجود داشته باشد به صورت قرمز آن را خواهید دید.</p><h3>معماری ساده وب سایت</h3><p>ممکن است معماری وب سایت پیچیده به نظر برسد. اما اینطور نیست. معماری وب سایت به سادگی چگونگی پیوند کلیه صفحات سایت شما با یکدیگر است. به طور کلی شما باید معماری وب سایت خود را ساده نگه دارید در صورتی که معماری مشخصی در سایت خود نداشته باشید پیدا کردن صفحات در سایت شما مشکل خواهد شد و گوگل به خوبی نمی تواند سایت شما را ایندکس کند.</p><h3>محتوای بی نظیر</h3><p>گوگل از محتوای های تکراری متنفر است و در واقع اگر سایتی را با محتوای تکراری پیدا کند ، رتبه بندی سایت دچار مشکل می شود و یا سایت از فهرست گوگل به طور کلی حذف شود. به همین منظور ما باید محتوای باکیفیت برای سایت خود ایجاد کنید.&nbsp;</p><p>بنابراین برای تمامی محصولات ، مقالات و یا هر بخش دیگری که در سایت خود دارید محتوای جدید استفاده کنید.</p><h3>از تگ کنونیکال استفاده کنید</h3><p>در صورتی که در سایت خود چندین صفحه مختلف ولی با محتوای مشابه دارید از تگ کنونیکال استفاده کنید. در این صورت فقط صفحه ای که آن را کنونیکا ل کرده اید در رتبه بندی گوگل خواهد امد. اگر چندین مطالب شبیه هم دارید این درست نیست که تمام این صفحات مشابه در گوگل رتبه بندی شود در صورتی که از این برچسب استفاده کنید به گوگل میگویید ارزش این صفحه از صفحات مشابه دیگر بیشتر است. بهترین نکته این کار این است که گوگل سایت را برای محتوای تکراری مجازات نمی کند.</p><p>&nbsp;</p><h3>ساختار آدرس صفحات سایت</h3><p>از ادرس صفحات مناسب با موضوع سایت خود استفاده کنید. در واقع از آنجایی که یادآوری url ها سخت است باید سعی کنید از ادرس سایتی استفاده کنید گه عجیب و غریب نباشد و کاربر را گیج نکند. گوگل برای اینکه به موضوع صفحات سایت شما پی ببرد از این بخش استفاده می کند. بنابراین از url هایی استفاده کنید که سایت شما را توصیف می کنند و به کاربران و موتورهای جستجو سرنخی از موضوع صفحه شما بدهد. و این به راحتی به خاطر سپرده می شود.</p><p>&nbsp;</p><p>&nbsp;</p></div></div></div>', 50, 'محتوای سایت سئو محور | سایت SEO FRIENDLY -  طرح و وب', 'سایت سئو محور,سایت مناسب سئو,بهینه سازی سایت,سایت seo friendly', 'طراحی یک وب سایت سئومحور یا Seo Friendly چیست؟ به وب سایت هایی که برای موتورهای جستجو بهینه شده است و قابلیت دسترسی و ایندکس را دارد وب سایت سئو محور و یا Seo Friendly می گویند.', '{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/\\u0637\\u0631\\u0627\\u062d\\u06cc \\u0633\\u0627\\u06cc\\u062aseo ffriendly.png\",\"300\":\"\\/upload\\/images\\/2020\\/300_\\u0637\\u0631\\u0627\\u062d\\u06cc \\u0633\\u0627\\u06cc\\u062aseo ffriendly.png\",\"600\":\"\\/upload\\/images\\/2020\\/600_\\u0637\\u0631\\u0627\\u062d\\u06cc \\u0633\\u0627\\u06cc\\u062aseo ffriendly.png\",\"900\":\"\\/upload\\/images\\/2020\\/900_\\u0637\\u0631\\u0627\\u062d\\u06cc \\u0633\\u0627\\u06cc\\u062aseo ffriendly.png\"},\"thumb\":\"\\/upload\\/images\\/2020\\/300_\\u0637\\u0631\\u0627\\u062d\\u06cc \\u0633\\u0627\\u06cc\\u062aseo ffriendly.png\"}', 450, 0, 'article', '{\"rate\":null}', '2020-10-10', 1, '2020-10-09 13:10:26', '2023-02-19 00:31:45'),
(66, 'سرعت صفحه و سئو سایت', 2, 'سرعت-صفحه-و-سئو-سایت', '<p>سرعت صفحه چیست؟ سرعت صفحه مدت زمانی است که برای بارگیری یک صفحه وب لازم است. سرعت بارگذاری یک صفحه توسط چندین عامل مختلف تعیین می شود ، از جمله سرور سایت ، اندازه فایل و صفحه و فشرده سازی تصویر.</p>', '<div class=\"row\"><div class=\"col-lg-12 col-sm-12 column\"><div class=\"ge-content ge-content-type-ckeditor\" data-ge-content-type=\"ckeditor\"><p>سرعت صفحه و سئو سایت همانطور که به نظر می رسد ساده نیست.به این دلیل که روشهای مختلفی برای اندازه گیری سرعت صفحه وجود دارد. در اینجا سه ​​مورد از رایج ترین موارد ذکر شده است:</p><p>Fully Loaded Page: این مدت زمانی است که 100٪ کلیه منابع یک صفحه بارگیری می شود. این ساده ترین راه برای تعیین سرعت بارگیری یک صفحه است.</p><p>Time to First Byte: این زمان شروع یک مرحله برای بارگیری یک صفحه را اندازه گیری می کند. اگر تا به حال روی صفحه ای فرود آمده اید و چند ثانیه به صفحه سفید خیره شده اید ، این TTFB در کار است.</p><p>First Meaningful Paint / اولین رنگ زمینه: این مدت زمانی است که برای بارگیری لازم است تا منابع آن به اندازه کافی بارگیری شود تا محتوای صفحه شما واقعاً خوانده شود.</p><p>به عنوان مثال ، بگذارید بگوییم شما یک پست وبلاگ دارید که بارگیری کامل آن 10 ثانیه طول می کشد. این مدت طولانی است ... اگر فقط به مدت زمان بارگیری کل صفحه نگاه کنید. از طرف دیگر ، توجه به First Meaningful Paint گاهی اوقات نحوه تعامل کاربران با صفحه شما هنگام بارگیری را بهتر نشان می دهد.</p><p>به عنوان مثال ، بیایید دوباره به صفحه ای نگاه کنیم که بارگیری تمام منابع صفحه 10 ثانیه طول می کشد. حتی اگر مدتی طول بکشد تا کل صفحه بارگیری شود ، هنگامی که کاربر برای اولین بار روی صفحه فرود می آید ، پس از 1.5 ثانیه \"اولین رنگ معنی دار\" را دریافت می کند. این بدان معنی است که آنها می توانند بلافاصله شروع به تعامل با صفحه شما کنند. بنابراین برای یک کاربر ، صفحه شما سریع است.</p><p>روشهای مختلفی برای اندازه گیری سرعت صفحه وجود دارد. و هیچ معیار \"درستی\" وجود ندارد که همه دیگر را شکست دهد. همه آنها موافقان و مخالفانی دارند. در عوض ، برای بهبود سرعت بارگیری صفحه خود برای همه معیارهایی که پیدا می کنید ، تمرکز کنید.</p><h3>چرا سرعت صفحه برای سئو سایت مهم است؟</h3><p>گوگل از سال 2010 سرعت صفحه را به عنوان عامل رتبه بندی معرفی کرده است و در سال 2018 گوگل با به روزرسانی \"Speed\" اهمیت سرعت صفحه را افزایش داد. یک وب سایت بارگیری آهسته می تواند به رتبه بندی Google شما آسیب برساند.</p><p>با توجه به اینکه آنها در ابزار PageSpeed Insights خود در مورد همه این معیارها گزارش می دهند ،احتمالاً گوگل از ترکیبی از اندازه گیری های مختلف سرعت صفحه استفاده می کنند. با استفاده از این ، در اینجا چگونگی بهبود سرعت بارگذاری سایت خود آورده شده است.</p><h3>فشرده سازی تصاویر</h3><p>من این را اولویت قرار می دهم زیرا این معمولا بزرگترین برد است. از این گذشته ، تصاویر معمولاً 50-90٪ از اندازه صفحه را اشغال می کنند. بنابراین هرچه بیشتر بتوانید تصاویر خود را فشرده کنید ، صفحه شما سریعتر بارگیری می شود.</p><p>چطور؟</p><p>اگر سایت شما با وردپرس اجرا می شود ، من افزونه ای به نام WP Smush را بسیار توصیه می کنم: این به طور خودکار هر تصویری را که در کتابخانه رسانه وردپرس بارگذاری می کنید ، فشرده می کند. و حداقل طبق گفته سازندگان افزونه ، این می تواند اندازه پرونده تصویری شما را 14.2٪ کاهش دهد.</p><p>از وردپرس استفاده نمی کنید؟ هنوز گزینه های زیادی برای فشرده سازی تصویر وجود دارد. برخلاف زمان گذشته ، اکنون بیشتر ابزارهای فشرده سازی یا از فشرده سازی بدون افت استفاده می کنند یا فقط کیفیت تصویر را تا جایی کاهش می دهند که به سختی قابل مشاهده است.</p><h3>کد خود را تمیز و فشرده کنید</h3><p>منابع یافت شده در صفحه خود را کوچک کنید. این شامل:</p><p>&nbsp; &nbsp;HTML</p><p>&nbsp; &nbsp;CSS</p><p>&nbsp; &nbsp;جاوا اسکریپت</p><p>&nbsp; &nbsp;و هر کد دیگری که در صفحه شما یافت می شود.</p><p>اولین قدم شما باید پاکسازی هر کد نفوذی در صفحه خود باشد. این کد اضافی می تواند از ویژگی هایی باشد که دیگر در سایت خود ندارید. در هر صورت هرچه کد شما تمیزتر باشد ، سرعت بارگیری سریعتر انجام می شود. سپس ، با استفاده از برنامه ای مانند GZip کد خود را فشرده کنید.</p><h3>هاستیگ خود را ارتقا دهید</h3><p>این یک نکته است که نمی بینم افراد کافی درباره آن صحبت می کنند. اما می توانم بگویم که به عنوان یک قاعده کلی: وقتی صحبت از میزبانی می شود ، آنچه را که برای آن هزینه می کنید دریافت می کنید. بنابراین اگر در بهبود سرعت بارگذاری سایت خود جدی هستید ، ممکن است زمان ارتقا به یک میزبان برتر یا یک سرور اختصاصی فرا رسیده باشد.</p><h3>فعال کردن مرورگر مرورگر</h3><p>با این کار کاربران می توانند قسمتهایی از صفحه شما را در حافظه پنهان مرورگر خود ذخیره کنند. بنابراین دفعه بعدی که آنها از سایت شما بازدید می کنند ، خیلی سریعتر بارگیری می شود. متأسفانه ، این امر به بارگیری سریعتر صفحه شما برای بازدیدکنندگان اولین بار کمک نمی کند. اما برای بهبود سرعت بارگیری برای افرادی که قبلاً از سایت شما بازدید کرده اند بسیار عالی است. می توانید حافظه پنهان مرورگر را در پرونده .htaccess خود تنظیم کنید یا با یک افزونه وردپرس.</p><h3>اجرای CDN</h3><p>شبکه تحویل محتوا (CDN) یکی از ساده ترین راه ها برای افزایش سرعت بارگذاری سایت شماست. CDN ها با درک اینکه بازدید کننده شما از نظر فیزیکی در کجاست کار می کنند و سپس منابع سایت خود را از یک سرور نزدیک به آنها تأمین می کنند.</p><h3>با ابزارهای تست سرعت چند صفحه تست کنید</h3><p>اکنون که این مراحل را اجرا کرده اید ، وقت آن است که ببینیم چگونه کار می کنید و من توصیه می کنم سرعت صفحه خود را با استفاده از دو ابزار مختلف آزمایش کنید. اولین مورد Google PageSpeed ​​Insights است این ابزار Google کد صفحه شما را برای مشکلات اسکن می کند ... . گوگل یک ویژگی اضافه کرده است که گزارش می دهد مدت زمان بارگیری سایت شما برای کاربران واقعی انسان (با استفاده از داده های مرورگر Google Chrome) طول می کشد.</p><p>در مرحله بعدی ، ما WebPageTest.org را داریم. جالب در مورد WebPageTest این است که صفحه شما را در یک مرورگر واقعی بارگیری می کند. و به شما اجازه می دهد تا در مورد قسمتهای خاصی از صفحه خود که بارگیری آنها مدت زمان زیادی طول می کشد ، مطلع شوید.</p></div></div></div>', 47, '5 راه های بالا بردن سرعت صفحه و سئو سایت | طرح و وب', 'سرعت صفحه,سرعت سایت,سئو سایت,بالا بردن سرعت سایت', 'سرعت صفحه چیست؟ سرعت صفحه مدت زمانی است که برای بارگیری یک صفحه وب لازم است. سرعت بارگذاری یک صفحه توسط چندین عامل مختلف تعیین می شود ، از جمله سرور سایت ، اندازه فایل و صفحه و فشرده سازی تصویر.', '{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/large_\\u0633\\u0631\\u0639\\u062a \\u0633\\u0627\\u06cc\\u062a.png\",\"small\":\"\\/upload\\/images\\/2020\\/small_large_\\u0633\\u0631\\u0639\\u062a \\u0633\\u0627\\u06cc\\u062a.png\",\"medium\":\"\\/upload\\/images\\/2020\\/medium_large_\\u0633\\u0631\\u0639\\u062a \\u0633\\u0627\\u06cc\\u062a.png\",\"large\":\"\\/upload\\/images\\/2020\\/large_large_\\u0633\\u0631\\u0639\\u062a \\u0633\\u0627\\u06cc\\u062a.png\"},\"thumb\":\"\\/upload\\/images\\/2020\\/small_large_\\u0633\\u0631\\u0639\\u062a \\u0633\\u0627\\u06cc\\u062a.png\"}', 395, 0, 'article', '{\"rate\":null}', '2020-11-08', 1, '2020-11-08 17:15:10', '2023-03-03 03:40:29');
INSERT INTO `contents` (`id`, `title`, `type`, `slug`, `brief_description`, `description`, `parent_id`, `meta_title`, `meta_keywords`, `meta_description`, `images`, `viewCount`, `commentCount`, `attr_type`, `attr`, `publish_date`, `status`, `created_at`, `updated_at`) VALUES
(68, 'آشنایی با اصطلاحات سئو', 2, 'آشنایی-با-اصطلاحات-سئو', '<p>برای آموزش سئو نیاز دارید تا با اصطلاحات اون هم آشنا بشید. در این مقاله تمامی اصطلاحات on page و بهینه سازی داخلی یک وب سایت برای کسب رتبه و همینطور off page که فرآیندی خارج از سایت است را یاد میگیرید.&nbsp;</p>', '<div class=\"row\"><div class=\"col-lg-12 col-sm-12 column\"><div class=\"ge-content ge-content-type-ckeditor\" data-ge-content-type=\"ckeditor\"><h3>آشنایی با اصطلاحات ON PAGE</h3><p>متا تگ (meta tag) : اطلاعات در رابطه با موضوع مقالات برای موتور های جستجو</p><p>تگ عنوان ( titlle tag) : عنوان سایت&nbsp;</p><p>توضیحات سایت ( Meta descripton) : متا توضیحات خلاصه مطالب موجود در سایت برای مشاهده کاربران و آشنایی با مقاله</p><p>تگ heading : تگ های h1 تا h6 است که به عنوان تیتر داخلی سایت استفاده می شود.</p><p>url : نام صفحات انتخابی برای دامنه می باشد که کوتاه و مختصر بودن آن برای صفحه سایت بهتر است.</p><p>keyword : کلمات کلیدی مناسب و هدفمند&nbsp;</p><p>LSI : مترادف کلمه کلیدی و کلمات هم معنا با کلمه کلیدی</p><p>internal link : لینک سازی داخلی به پیج های اصلی و لینک دادن آن به زیر پیج ها سایت</p><p>ALT : بهینه سازی تصاویر سایت و قرار دادن متن برای معرفی تصاویر به موتور جستجو</p><p>AMP : صفحه واکنشگرا به موبایل</p><h3>آشنایی با اصطلاحات OFF PAGE</h3><p>Alternative : لینک به صفحات با زبان دیگر</p><p>Author : ارجاع به نویسنده مقالات</p><p>Bookmark : عدم تغییر لینک و ذخیره مقاله</p><p>Help : آموزش یک صفحه در صفحه دیگر</p><p>License : راهنمایی به صفحه کپی رایت مقاله</p><p>Next : لینک به مقاله بعدی</p><p>Prev : لینک به مقاله قبلی</p><p>Nofollow ک لینک هایی که دنبال نمی شوند</p><p>Follow &nbsp;یا &nbsp;Do follow : لینک های دنبال شونده</p><p>Search : امکان جستجو مقاله در لینک</p><p>Tag : نشان دهنده تگ یا کلمه کلیدی در مقاله</p><p>Backlink : پیوندهایی که وب سایت های دیگر را به وب سایت شما می فرستد.</p><h3>اصطلاحات رایج در سئو</h3><p>ایندکس و یا crowl سایت که نشان می دهد صفحات سایت شما توسط خزنده های گوگل بررسی شده است یا خیر.</p><p>Robot.txt برای محدود کردن دسترسی های سایت از این بخش استفاده می شود.</p><p>sitemap یا همان نقشه سایت است که حاوی تمام فایل ها و آدرس های سایت است.</p><p>Hreflang برایمشخص کردن زبان سایت استفاده می شود.</p><p>time on site : زمان ماندگاری در سایت&nbsp;</p><p>page view : گردش در سایت</p><p>bounce rate : کاهش فرار از سایت</p><p>serp : &nbsp;برررسی و یافتن کلمات کلیدی در گوگل</p><p>UI / UX : رابط کاربری / تجربه کاربری</p><p>duplicate content : کپی از مطالب دیگران و یا چند آدرس با مطلب یکسان</p><p>Page authority : میزان اعتبار سایت</p><p>Co-citation : لینک سازی در سایت های دیگر - کلمات کلیدی قبل و بعد از لینک</p><p>boot strap : ابزار رایگان برای ایجاد صفحات وب شامل HTML و جاوا و CSS</p><p>inband marketing : &nbsp;بازاریابی باری جذب مشتری ، تولید محتوا و پاسخگویی نیاز مشتری</p><p>anchor text : لینک برای اتصال به صفحات دیگر</p><p>seo semantic : جستجو عبارت که نتایج با مفهومی را تولید می کند.</p><p>ریپوتاژ آگهی : مقاله ای که در سایت دیگر به سایت شما لینک می شود.</p><p>cpc : هزینه به ازای هر کلیک&nbsp;</p><p>ppc : پرداخت به ازای هر کلیک</p><p>inbound link : لینک از سایت ما به سایت های دگیر</p><p>outbound link : لینک از سایت دیگر به سمت سایت ما</p><p>linking domain : لینک ها به سمت سایت ما</p><p>&nbsp;</p></div></div></div>', 50, 'آشنایی با اصطلاحات OFF PAGE و ON PAGE | طرح و وب', 'اصطلاحات سئو,آشنایی با اصطلاحات OFF PAGE,آشنایی با اصطلاحات ON PAGE', 'برای آموزش سئو نیاز دارید تا با اصطلاحات اون هم آشنا بشید. در این مقاله تمامی اصطلاحات on page و بهینه سازی داخلی یک وب سایت برای کسب رتبه و همینطور off page که فرآیندی خارج از سایت است را یاد میگیرید.', '{\"images\":{\"original\":\"\\/upload\\/images\\/2020\\/\\u0627\\u0635\\u0637\\u0644\\u0627\\u062d\\u0627\\u062a-\\u0633\\u0626\\u0648.jpg\",\"small\":\"\\/upload\\/images\\/2020\\/small_\\u0627\\u0635\\u0637\\u0644\\u0627\\u062d\\u0627\\u062a-\\u0633\\u0626\\u0648.jpg\",\"medium\":\"\\/upload\\/images\\/2020\\/medium_\\u0627\\u0635\\u0637\\u0644\\u0627\\u062d\\u0627\\u062a-\\u0633\\u0626\\u0648.jpg\",\"large\":\"\\/upload\\/images\\/2020\\/large_\\u0627\\u0635\\u0637\\u0644\\u0627\\u062d\\u0627\\u062a-\\u0633\\u0626\\u0648.jpg\"},\"thumb\":\"\\/upload\\/images\\/2020\\/small_\\u0627\\u0635\\u0637\\u0644\\u0627\\u062d\\u0627\\u062a-\\u0633\\u0626\\u0648.jpg\"}', 484, 0, 'article', '{\"rate\":null}', '2020-12-04', 1, '2020-12-04 13:10:09', '2023-02-25 18:10:05'),
(69, 'آموزش برنامه نویسی', 1, 'آموزش-برنامه-نویسی', '<p>آموزش برنامه نویسی پیشرفته و آموزش نکات ضرروری بر پایه seo</p>', NULL, 44, NULL, NULL, NULL, '\"\"', 344, 0, NULL, NULL, '2020-12-04', 1, '2020-12-04 13:51:49', '2023-03-02 19:20:57'),
(70, 'معرفی ابزار های چک لیست سئو', 2, 'معرفی-ابزار-های-چک-لیست-سئو', '<p><span style=\"color:#000000;\">در این مقاله شما را با ابزار ها و سایت های برای سئو آشنا می کنیم . سایت های کاربردی که به وسیله آن می توانید سایت خود را از نظر حجم ، سرعت ، سئو داخلی و سئو خارجی آن بررسی کنید.</span></p>', '<div class=\"row\"><div class=\"col-lg-12 col-sm-12 column\"><div class=\"ge-content ge-content-type-ckeditor\" data-ge-content-type=\"ckeditor\"><p><span style=\"color:#000000;\">در این مقاله شما را با ابزار ها و سایت های برای سئو آشنا می کنیم . سایت های کاربردی که به وسیله آن می توانید سایت خود را از نظر حجم ، سرعت ، سئو داخلی و سئو خارجی آن بررسی کنید.</span></p><p><span style=\"color:#000000;\">بعد از شناسایی مشکلات سایت بهترین کار رفع مشکلات برای بدست آوردن رتبه بهتر در گوگل است .</span></p><h2><span style=\"color:#000000;\">سایت های کاربردی برای سئو</span></h2><ul><li><span style=\"color:#000000;\">www.downnotofier.com : تست آپتایم بودن سایت&nbsp;</span></li><li><span style=\"color:#000000;\">Tools.pingdom.com : تست برای افزایش سرعت سایت - کم کردن حجم سایت و افزونه های بی استفاده</span></li><li><span style=\"color:#000000;\">Gtmetrix : تست سرعت سایت ، مشخص کردن مشکلات سایت و راه حل برای رفع آنها</span></li><li><span style=\"color:#000000;\">Adwords.google.com :&nbsp; پیدا کردن کلمات کلیدی و میزان جستجو آن ها</span></li><li><span style=\"color:#000000;\">Woorank : بررسی سئو سایت</span></li><li><span style=\"color:#000000;\">Vary : بررسی رایگان سئو سایت</span></li><li><span style=\"color:#000000;\">Screaming frog seospider&nbsp; : بررسی سایت و ارائه گزارش</span></li><li><span style=\"color:#000000;\">Removeem : شناسایی و حذف لینک های اسپم و نامعتبر</span></li><li><span style=\"color:#000000;\">Founds seo audit : پیدا کردن مشکلات کلمات کلیدی ، توضیحات متا و سایت مپ</span></li><li><span style=\"color:#000000;\">Web site grader : استاندارد بودن ربات و سرعت بارگذاری سایت&nbsp;</span></li><li><span style=\"color:#000000;\">Seo report card : گزارش رتبه سایت - کلمات کلیدی و تعداد صفحات ایندکس شده در تمامی موتور های جستجو</span></li><li><span style=\"color:#000000;\">Check my link : شناسایی لینک های سالم و شکسته</span></li></ul><h2><span style=\"color:#000000;\">ابزار های چک لیست سئو</span></h2><ul><li><span style=\"color:#000000;\">وبسمتر</span></li><li><span style=\"color:#000000;\">گوگل آنالیتیکس</span></li><li><span style=\"color:#000000;\">سیمیلار وب (&nbsp; تحلیل رقبا )</span></li><li><span style=\"color:#000000;\">الکسا ALEXA</span></li><li><span style=\"color:#000000;\">Semrush ابزار برای سئو</span></li><li><span style=\"color:#000000;\">Google ads</span></li><li><span style=\"color:#000000;\">Kwfinde &nbsp; برای پیدا کردن کلمات کلیدی</span></li><li><span style=\"color:#000000;\">Google page speed insight تست سرعت سایت</span></li><li><span style=\"color:#000000;\">Adjust بزار برای بازاریابی اپلیکیشن</span></li><li><span style=\"color:#000000;\">Buzz sumo ابزاری برای بازاریابی محتوا سایت&nbsp;</span></li><li><span style=\"color:#000000;\">Trello&nbsp; ابزار کار و مدیریت&nbsp;</span></li><li><span style=\"color:#000000;\">Millerlight ابزاری برای بازاریابی ایمیلی</span></li><li><span style=\"color:#000000;\">Canva ابزاری برای ساخت بنر و پوستر سایت</span></li><li><span style=\"color:#000000;\">Bitly ابزار کوتاه کننده لینک ها</span></li></ul><h2><span style=\"color:#000000;\">چک لیست سئو تکنیکال&nbsp;</span></h2><ul><li><span style=\"color:#000000;\">از بین بردن خطاهای سایت در وبمستر</span></li><li><span style=\"color:#000000;\">بالا بردن سرعت سایت&nbsp;</span></li><li><span style=\"color:#000000;\">درست کردن لینک های شکسته&nbsp;</span></li><li><span style=\"color:#000000;\">بهینه سازی سایت برای موبایل</span></li><li><span style=\"color:#000000;\">انتقال سایت به HTTPS&nbsp;</span></li><li><span style=\"color:#000000;\">درست کردن محتواهای تکراری</span></li><li><span style=\"color:#000000;\">بررسی امنیت سایت</span></li></ul><h2><span style=\"color:#000000;\">چک لیست لینک سازی</span></h2><ul><li><span style=\"color:#000000;\">بک لینک های رقبا خود را پیدا کنید و به آن ها لینک دهید</span></li><li><span style=\"color:#000000;\">لینک های از بین رفته را دوباره ایجاد کنید</span></li><li><span style=\"color:#000000;\">در سایت هایی که از نام شما استفاده کرده اند بخواهید به سایت شما لینک دهند.</span></li></ul></div></div></div>', 52, 'معرفی ابزار های چک لیست سئو', 'چک لیست سئو,ابزار چک لیست سئو,سایت های کاربردی برای سئو,ابزار های چک لیست سئو', 'در این مقاله شما را با ابزار ها و سایت های برای سئو آشنا می کنیم . سایت های کاربردی که به وسیله آن می توانید سایت خود را از نظر حجم ، سرعت ، سئو داخلی و سئو خارجی آن بررسی کنید.', '{\"images\":{\"original\":\"\\/upload\\/images\\/2021\\/\\u0686\\u06a9 \\u0644\\u06cc\\u0633\\u062a \\u0633\\u0626\\u0648.png\",\"small\":\"\\/upload\\/images\\/2021\\/small_\\u0686\\u06a9 \\u0644\\u06cc\\u0633\\u062a \\u0633\\u0626\\u0648.png\",\"medium\":\"\\/upload\\/images\\/2021\\/medium_\\u0686\\u06a9 \\u0644\\u06cc\\u0633\\u062a \\u0633\\u0626\\u0648.png\",\"large\":\"\\/upload\\/images\\/2021\\/large_\\u0686\\u06a9 \\u0644\\u06cc\\u0633\\u062a \\u0633\\u0626\\u0648.png\"},\"thumb\":\"\\/upload\\/images\\/2021\\/small_\\u0686\\u06a9 \\u0644\\u06cc\\u0633\\u062a \\u0633\\u0626\\u0648.png\"}', 355, 0, 'article', '{\"rate\":null}', '2021-02-09', 1, '2021-02-09 09:55:02', '2023-03-02 17:30:57'),
(71, '7 مرحله ساده برای استراتژی SEO', 2, '7-مرحله-ساده-برای-استراتژی-SEO', '<p>شرکت شما وب سایت برای خدمات خود یک وب سایت ایجاد کرده است و شما مسئول محتوا و شما مسئول بهینه سازی موتور جستجو (SEO) نیز هستید. چه شما در حال تحویل گرفتن ، بهبود یا شروع &nbsp;استراتژی SEO خود باشید ، اصول SEO آنقدرها سخت نیست. با اینکه سئو دائما در حال پیشرفت است و دانش زیادی در زمینه سئو وجود دارد، موتورهای جستجو مانند گوگل در زمینه به روزرسانی الگوریتم های خود ، دائماً در حال تغییر است. &nbsp;این هفت روش ساده برای ایجاد یک استراتژی قوی SEO را بررسی کنید:&nbsp;</p>', '<div class=\"row\"><div class=\"col-lg-12 col-sm-12 column\"><div class=\"ge-content ge-content-type-ckeditor\" data-ge-content-type=\"ckeditor\"><h3>1. کلمات کلیدی خود را پیدا کنید</h3><p>اولین نکته مه ماین است که بدانید بازار هدف شما از چه کلمات کلیدی استفاده می کند. بنابراین در ابتدا کلمات کلیدی مورد نظر بازار هدف خود را پیدا کنید. این نیاز به کمی تحقیق دارد. از دید مشتری به &nbsp;محصول و خدمات خود نگاه کنید. چگونه می توانید راه حل هایی برای مشکل خود پیدا کنید؟ چه چیزی را در موتور جستجوی خود جستجو می کنید؟ به عنوان مثال ، اگر غذای ارگانیک سگ می فروشید ، مشتری احتمالی شما نگران سلامتی سگ خود است. شاید سگ او حساسیت غذایی داشته باشد و نگران مواد شیمیایی و محصولات جانبی موجود در بیشتر غذاهای سگ باشد. شروع به جستجو کنید. چه سایت هایی ظاهر می شوند؟ به کلمات استفاده شده در آن قطعه ها نگاه کنید.</p><p>در پرسش من در مورد \"سگ حساسیت غذایی دارد\" ، کلماتی مانند \"حساسیت\" ، \"طبیعی\" و \"متعادل\" نشان داده می شوند. فراموش نکنید که در مورد کلمات مرتبط ، مانند مترادف و گروه کلمات ، فکر کنید.شما می توانید عبارات کلیدی مانند \"حساسیت های غذایی\" ، \"تمام رژیم های طبیعی\" ، \"تغذیه کامل متعادل\" و \"فقط مواد طبیعی\" را در نظر بگیرید.</p><h3>2. نوشتن محتوای با کیفیت بالا</h3><p>نکته کلیدی در اینجا استفاده از حس تند و تیز بازاریابی و ایجاد محتوای جذاب است که برای بازار هدف شما ارزشمند است. محتوای ارزشمند شامل محتوایی است که به سوالات خریداران شما پاسخ می دهد ، بینش هایی را که می توانند استفاده کنند به آنها ارائه می دهد و به آنها آموزش می دهد تا در انجام کاری بهتر عمل کنند. در محتوای عالی که ایجاد می کنید ، به یاد داشته باشید که از کلمات کلیدی مناسب به طور طبیعی استفاده کنید. سعی نکنید صفحات خود را پر کنید (به عنوان مثال اصطلاحات کلمات کلیدی را بارها و بارها در محتوای خود ، در برچسب های متا ، در توضیحات Alt و غیره اضافه کنید) تا سعی کنید رتبه سایت خود را بهتر کنید. این به رتبه بندی جستجوی شما کمک نمی کند. اگر موتورهای جستجو شما را گیر بیاورند ، این کار باعث پایین آوردن رتبه شما یا حذف کامل سایت شما از فهرست آنها شده و &nbsp;سایت شما را جریمه میکنند. بعلاوه ، بازدیدکنندگان وب سایت شما را تحت تأثیر قرار نخواهد داد. چه کسی می خواهد همان کلمات را بارها و بارها بخواند: \"آیا به دنبال غذای ارگانیک سگ هستید؟ اگر به دنبال غذای ارگانیک سگ هستید ، دیگر نگاه نکنید. وب سایت غذای ارگانیک سگ ما بهترین مکان برای سفارش غذای ارگانیک سگ شماست. \" واقعیت را حفظ کنید و بدانید دارید برای شخصی می نویسید.</p><h3>3. از کلمات کلیدی در URL های صفحه وب سایت خود استفاده کنید</h3><p>مطمئن باشید که URL های صفحه خود را نادیده نمی گیرید زیرا برای SEO شما مهم هستند. اینجاست که تحقیق کلمات کلیدی شما مفید است. به عنوان مثال ، اگر صفحه ای در مورد محصول غذای ارگانیک سگ شما صحبت می کند ، پس URL آن صفحه باید محصولات / غذای ارگانیک سگ باشد. تمرکز خود را بر روی متداول ترین و پر جستجوترین کلمات کلیدی مناسب قرار دهید. اگر می خواهید بین \"غذای ارگانیک سگ\" و \"غذای سگ\" تصمیم بگیرید ، یکی را با بالاترین رتبه جستجو انتخاب کنید.</p><p>چند روش سریع و آسان برای بررسی رتبه بندی جستجو وجود دارد. یکی استفاده از Google AdWords Keyword Planner. به سادگی کلمات کلیدی خود را وارد کنید تا از میزان محبوبیت تاریخی آنها از نظر میزان جستجو مطلع شوید. همچنین می توانید از Google Trends که یک سایت واقعا سرگرم کننده برای کاوش است استفاده کنید. کلمات کلیدی مختلف را مقایسه کنید تا مقایسه گرافیکی سریع علاقه را با گذشت زمان مشاهده کنید.</p><p>&nbsp;</p><p style=\"text-align:center;\"><span style=\"color:hsl(0, 0%, 60%);font-size:20px;\"><strong>-------------------------------------------- با</strong></span><span style=\"color:hsl(0, 75%, 60%);font-size:20px;\"><strong> </strong></span><a href=\"https://tarhoweb.com/%D9%85%D8%B9%D8%B1%D9%81%DB%8C-%D8%A7%D8%A8%D8%B2%D8%A7%D8%B1-%D9%87%D8%A7%DB%8C-%DA%86%DA%A9-%D9%84%DB%8C%D8%B3%D8%AA-%D8%B3%D8%A6%D9%88\"><span style=\"color:hsl(0, 75%, 60%);font-size:20px;\"><strong>ابزار های سئو سایت</strong></span></a><span style=\"color:hsl(0, 75%, 60%);font-size:20px;\"><strong> </strong></span><span style=\"color:hsl(0, 0%, 60%);font-size:20px;\"><strong>آشنا شوید -------------------------------------------</strong></span></p><p style=\"text-align:center;\">&nbsp;</p><h3>4- عنوان صفحه را فراموش نکنید</h3><p>ایجاد عناوین جذاب و جالب برای صفحات وب بسیار مهم است. مطمئن باشید که آنها بازار هدف شما را به دست می گیرند. اگر اینگونه نباشد ، افراد قصد ندارند تمام مطالب را بخوانند. من متوجه شدم که در حال پاسخ دادن به \"چه چیزی برای من مفید است؟\" زیرا بازدیدکنندگان به من کمک می کنند تا روی موارد برجسته تمرکز کنم. از خود بپرسید: آنها از محتوای این صفحه چه سودی می برند و چرا باید به آنها اهمیت دهند؟ همین که این میخ را زدید ، عنوان خود را کوتاه کنید ، از کلمات قوی استفاده کنید. هنگام ایجاد این عناوین جالب توجه ، اطمینان حاصل کنید که کلمه کلیدی شما در عنوان (H1) و / یا زیرعنوان (H2) قرار دارد. با استفاده از مثال غذای ارگانیک سگ در بالا ، H1 شما ممکن است \"با کیفیت ترین غذای ارگانیک سگ\".</p><h3>5. برای قرار دادن کلید واژه های اضافی ، هر صفحه را مرور کنید</h3><p>اکنون که محتوای با کیفیت بالا و مورد نیاز بازار هدف خود را ایجاد کرده اید &nbsp;و دارای عناوین جالب توجه برای جلب توجه آنها و تشویق آنها برای مطالعه بیشتر هستید ، به عقب برگردید و همه آنچه را که نوشتید مرور کنید. در بررسی خود ، به دنبال مکانهای اضافی باشید که بتوانید به طور طبیعی کلمات کلیدی را در آنها قرار دهید. آیا می توانید یک جمله را تغییر دهید تا یک کلمه کلیدی در آن گنجانده شود؟ به عنوان مثال ، در صفحه ای در مورد اتوماسیون بازاریابی ، \"شناسایی بهترین مشتریان و تبدیل بیشتر\" می تواند به \"اتوماسیون بازاریابی به شما کمک می کند تا بهترین مشتریان را شناسایی کرده و به خریدار بیشتر تبدیل کنید.</p><h3>6. تجربه کاربر را بهبود ببخشید</h3><p>این فراتر از محتوای وب سایت است ، اما تجربه خوب کاربر در رتبه بندی قوی SEO هر روز اهمیت بیشتری می یابد. طبق گفته رابرت بریس در وبلاگ خود سه اصل UX که به وب سایت شما کمک می کند وظیفه خود را به درستی انجام دهد . \"طی دو سال گذشته ، گوگل پیشرفت کرده است تا تاکید بیشتری بر سایت هایی داشته باشد که تجربیات کاربر با کیفیت را در سیستم عامل ها و دستگاه ها ارائه می دهند. اگرچه عوامل رتبه بندی سنتی هنوز هم سلطان هستند ، اما بهینه سازی موتور جستجو به طور فزاینده ای به سمت بهینه سازی کاربر تبدیل می شود. بنابراین ، با برنامه نویسان وب خود کار کنید تا اطمینان حاصل کنید که مرور وب سایت شما آسان &nbsp;است و هر پیوندی کار می کند و بازدید کنندگان شما را به قسمت بعدی اطلاعاتی که بدنبال آن هستند هدایت می کند.</p><h3>7. یک متخصص استخدام کنید</h3><p>همانطور که قبلاً گفتم ، سئو اساسی عمدتا عقل سلیم است. با این حال ، اگر توانایی پرداخت آن را دارید ، عاقلانه است که برای اطمینان از بهینه سازی سایت خود ، یک متخصص SEO استخدام کنید. یک مشاور یا آژانس سئو می تواند سایت شما را بررسی کند و به بررسی عملکرد آن در برابر مهمترین کلمات کلیدی شما بپردازد. آنها لیست اولویت بندی شده از موارد اقدام را در اختیار شما قرار می دهند تا به شما کمک کنند سایت خود را به سطح بالاتری برسانید.</p><p>این یک خبر خوب است: شما لازم نیست که یک جادوگر SEO باشید تا مطمئن شوید وب سایت شما از نظر ارگانیک برای موتورهای جستجوگر قرار دارد. به سادگی از عقل سلیم و هفت نکته ساده ای که در بالا ذکر شد استفاده کنید.</p></div></div></div>', 50, '7 مرحله ساده برای استراتژی SEO | طرح و وب', 'استراتژی سئو,سئو,استراتژی برای سئو', 'با اینکه سئو دائما در حال پیشرفت است و دانش زیادی در زمینه سئو وجود دارد، موتورهای جستجو مانند گوگل در زمینه به روزرسانی الگوریتم های خود ، دائماً در حال تغییر است.  ما این هفت روش ساده را برای ایجاد یک استراتژی قوی SEO به شما معرفی می کنیم.', '{\"images\":{\"original\":\"\\/upload\\/images\\/2021\\/\\u0627\\u0633\\u062a\\u0631\\u0627\\u062a\\u0698\\u0650\\u06cc \\u0633\\u0626\\u0648.jpg\",\"small\":\"\\/upload\\/images\\/2021\\/small_\\u0627\\u0633\\u062a\\u0631\\u0627\\u062a\\u0698\\u0650\\u06cc \\u0633\\u0626\\u0648.jpg\",\"medium\":\"\\/upload\\/images\\/2021\\/medium_\\u0627\\u0633\\u062a\\u0631\\u0627\\u062a\\u0698\\u0650\\u06cc \\u0633\\u0626\\u0648.jpg\",\"large\":\"\\/upload\\/images\\/2021\\/large_\\u0627\\u0633\\u062a\\u0631\\u0627\\u062a\\u0698\\u0650\\u06cc \\u0633\\u0626\\u0648.jpg\"},\"thumb\":\"\\/upload\\/images\\/2021\\/small_\\u0627\\u0633\\u062a\\u0631\\u0627\\u062a\\u0698\\u0650\\u06cc \\u0633\\u0626\\u0648.jpg\"}', 402, 0, 'article', '{\"rate\":null}', '2021-04-06', 1, '2021-04-06 08:16:32', '2023-02-25 18:09:58');

-- --------------------------------------------------------

--
-- Table structure for table `contents_category`
--

CREATE TABLE `contents_category` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `cat_id` bigint(20) UNSIGNED NOT NULL DEFAULT '0',
  `content_id` bigint(20) UNSIGNED NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `contents_category`
--

INSERT INTO `contents_category` (`id`, `cat_id`, `content_id`, `created_at`, `updated_at`) VALUES
(1, 44, 71, NULL, NULL),
(2, 50, 71, NULL, NULL),
(3, 44, 70, NULL, NULL),
(4, 52, 70, NULL, NULL),
(5, 44, 68, NULL, NULL),
(6, 50, 68, NULL, NULL),
(7, 44, 66, NULL, NULL),
(8, 47, 66, NULL, NULL),
(9, 44, 63, NULL, NULL),
(10, 62, 63, NULL, NULL),
(11, 44, 64, NULL, NULL),
(12, 50, 64, NULL, NULL),
(13, 44, 61, NULL, NULL),
(14, 52, 61, NULL, NULL),
(15, 44, 60, NULL, NULL),
(16, 50, 60, NULL, NULL),
(17, 44, 59, NULL, NULL),
(18, 51, 59, NULL, NULL),
(19, 44, 58, NULL, NULL),
(20, 47, 58, NULL, NULL),
(21, 44, 57, NULL, NULL),
(22, 50, 57, NULL, NULL),
(23, 44, 56, NULL, NULL),
(24, 49, 56, NULL, NULL),
(25, 44, 54, NULL, NULL),
(26, 50, 54, NULL, NULL),
(27, 44, 53, NULL, NULL),
(28, 47, 53, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `menus`
--

CREATE TABLE `menus` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `label` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `link` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `parent` bigint(20) NOT NULL DEFAULT '0',
  `sort` int(11) NOT NULL DEFAULT '0',
  `class` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `menu` int(11) NOT NULL DEFAULT '1',
  `depth` int(11) NOT NULL DEFAULT '0',
  `type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'internal',
  `module` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `module_id` int(11) DEFAULT NULL,
  `depth_copy` int(11) NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `menus`
--

INSERT INTO `menus` (`id`, `label`, `link`, `parent`, `sort`, `class`, `menu`, `depth`, `type`, `module`, `module_id`, `depth_copy`, `created_at`, `updated_at`) VALUES
(1, 'خانه', '/', 0, 1, NULL, 1, 0, 'external', NULL, NULL, 0, NULL, NULL),
(2, 'وبلاگ', 'وبلاگ', 0, 2, NULL, 1, 0, 'internal', 'category', 44, 0, NULL, NULL),
(3, 'طراحی سایت', 'طراحی-سایت', 0, 3, NULL, 1, 0, 'internal', 'category', 34, 0, NULL, NULL),
(4, 'طراحی سایت حرفه ای', 'طراحی-سایت-حرفه-ای', 3, 1, NULL, 1, 0, 'internal', 'category', 37, 0, NULL, NULL),
(5, 'طراحی سایت وردپرس', 'طراحی-سایت', 3, 2, NULL, 1, 0, 'internal', 'category', 34, 0, NULL, NULL),
(6, 'نمونه طراحی سایت', 'نمونه-طراحی-سایت', 3, 3, NULL, 1, 0, 'internal', 'category', 38, 0, NULL, NULL),
(7, 'سئو سایت', 'سئو-سایت', 0, 4, NULL, 1, 0, 'internal', 'category', 42, 0, NULL, NULL),
(8, 'نمونه کار سئو', 'نمونه-کار-سئو', 7, 1, NULL, 1, 0, 'internal', 'category', 43, 0, NULL, NULL),
(9, 'تعرفه', 'تعرفه', 0, 5, NULL, 1, 0, 'internal', 'category', 39, 0, NULL, NULL),
(10, 'تعرفه سئو سایت', 'تعرفه-سئو-سایت', 9, 1, NULL, 1, 0, 'internal', 'category', 40, 0, NULL, NULL),
(11, 'تعرفه طراحی سایت', 'تعرفه-طراحی-سایت', 9, 2, NULL, 1, 0, 'internal', 'category', 41, 0, NULL, NULL),
(12, 'درباره ما', 'درباره-ما', 0, 6, NULL, 1, 0, 'internal', 'category', 35, 0, NULL, NULL),
(13, 'تماس با ما', 'تماس-با-ما', 0, 6, NULL, 1, 0, 'internal', 'category', 55, 0, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2017_08_11_073824_create_menus_wp_table', 1),
(4, '2019_08_19_000000_create_failed_jobs_table', 1),
(5, '2020_08_24_174652_redirect_url', 1),
(6, '2020_08_24_174652_website_setting', 1),
(7, '2020_11_12_111727_contents', 1),
(8, '2020_11_12_291531_create_comments_table', 1),
(9, '2020_11_12_291531_create_spiders_table', 1),
(10, '2020_12_15_100433_create_contacts_table', 1),
(12, '2021_03_06_102003_create_permission_tables', 2),
(13, '2021_03_17_094628_company', 2),
(14, '2020_12_15_100433_create_widgets_table', 3),
(15, '2021_04_05_091451_company_content', 4),
(16, '2021_04_26_190537_create_contents_category_table', 4);

-- --------------------------------------------------------

--
-- Table structure for table `model_has_permissions`
--

CREATE TABLE `model_has_permissions` (
  `permission_id` bigint(20) UNSIGNED NOT NULL,
  `model_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `model_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `model_has_roles`
--

CREATE TABLE `model_has_roles` (
  `role_id` bigint(20) UNSIGNED NOT NULL,
  `model_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `model_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `model_has_roles`
--

INSERT INTO `model_has_roles` (`role_id`, `model_type`, `model_id`) VALUES
(1, 'App\\Models\\User', 1);

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(151) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `permissions`
--

CREATE TABLE `permissions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `guard_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `redirect_url`
--

CREATE TABLE `redirect_url` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `url` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `redirect_to` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `roles`
--

CREATE TABLE `roles` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `guard_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `roles`
--

INSERT INTO `roles` (`id`, `name`, `guard_name`, `created_at`, `updated_at`) VALUES
(1, 'super admin', 'web', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `role_has_permissions`
--

CREATE TABLE `role_has_permissions` (
  `permission_id` bigint(20) UNSIGNED NOT NULL,
  `role_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `spiders`
--

CREATE TABLE `spiders` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `url` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `image_url` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `attr` text COLLATE utf8mb4_unicode_ci,
  `price` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `category` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(151) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email_verified_at` datetime DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `email_verified_at`, `password`, `remember_token`, `date`) VALUES
(1, 'admin', 'm@m.m', NULL, '$2y$10$CXDC/iH/ugEG4zCZdfgZLuNUB3rZ.opJoLH.dbEL7mPurnKMtHlTS', NULL, '2020-12-29 08:36:31');

-- --------------------------------------------------------

--
-- Table structure for table `website_setting`
--

CREATE TABLE `website_setting` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `variable` varchar(300) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `value` varchar(300) COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `website_setting`
--

INSERT INTO `website_setting` (`id`, `variable`, `value`) VALUES
(1, 'meta_title', 'بهینه سازی سئو و مشاوره | طرح و وب'),
(2, 'meta_description', 'در این سایت به بهینه سازی سئو و مشاوره پرداخته می شود. طراحی وبسایت و پشتبانی سئو هم پذیرفته میشود. مشاوره رایگان سئو به صورت تلفنی و واتس آپ'),
(3, 'meta_keywords', 'بهینه سازی سئو و مشاوره ، آموزش سئو ، سئو تکنیکال ، on page , off Page'),
(6, 'url', '/'),
(7, 'og:type', 'website');

-- --------------------------------------------------------

--
-- Table structure for table `widgets`
--

CREATE TABLE `widgets` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `attr` longtext COLLATE utf8mb4_unicode_ci,
  `file_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `widgets`
--

INSERT INTO `widgets` (`id`, `attr`, `file_name`, `created_at`, `updated_at`) VALUES
(1, '{\\\"news\\\":{\\\"parent_id\\\":\\\"0\\\",\\\"sort\\\":\\\"viewCount asc\\\",\\\"type\\\":\\\"post\\\",\\\"count\\\":\\\"3\\\"},\\\"bestCategory\\\":{\\\"parent_id\\\":\\\"36\\\",\\\"sort\\\":\\\"publish_date desc\\\",\\\"type\\\":\\\"category\\\",\\\"count\\\":\\\"3\\\"},\\\"product\\\":{\\\"parent_id\\\":\\\"34\\\",\\\"sort\\\":\\\"publish_date desc\\\",\\\"type\\\":\\\"product\\\",\\\"count\\\":\\\"3\\\"}}', 'Home', NULL, NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `comments_content_id_foreign` (`content_id`);

--
-- Indexes for table `companies`
--
ALTER TABLE `companies`
  ADD PRIMARY KEY (`id`),
  ADD KEY `companies_user_id_foreign` (`user_id`);

--
-- Indexes for table `company_contents`
--
ALTER TABLE `company_contents`
  ADD PRIMARY KEY (`id`),
  ADD KEY `company_contents_company_id_foreign` (`company_id`),
  ADD KEY `company_contents_content_id_foreign` (`content_id`);

--
-- Indexes for table `contacts`
--
ALTER TABLE `contacts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `contents`
--
ALTER TABLE `contents`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `contents_category`
--
ALTER TABLE `contents_category`
  ADD PRIMARY KEY (`id`),
  ADD KEY `contents_category_cat_id_foreign` (`cat_id`),
  ADD KEY `contents_category_content_id_foreign` (`content_id`);

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `menus`
--
ALTER TABLE `menus`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `model_has_permissions`
--
ALTER TABLE `model_has_permissions`
  ADD PRIMARY KEY (`permission_id`,`model_id`,`model_type`),
  ADD KEY `model_has_permissions_model_id_model_type_index` (`model_id`,`model_type`);

--
-- Indexes for table `model_has_roles`
--
ALTER TABLE `model_has_roles`
  ADD PRIMARY KEY (`role_id`,`model_id`,`model_type`),
  ADD KEY `model_has_roles_model_id_model_type_index` (`model_id`,`model_type`);

--
-- Indexes for table `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Indexes for table `permissions`
--
ALTER TABLE `permissions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `permissions_name_guard_name_unique` (`name`,`guard_name`);

--
-- Indexes for table `redirect_url`
--
ALTER TABLE `redirect_url`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `roles_name_guard_name_unique` (`name`,`guard_name`);

--
-- Indexes for table `role_has_permissions`
--
ALTER TABLE `role_has_permissions`
  ADD PRIMARY KEY (`permission_id`,`role_id`),
  ADD KEY `role_has_permissions_role_id_foreign` (`role_id`);

--
-- Indexes for table `spiders`
--
ALTER TABLE `spiders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- Indexes for table `website_setting`
--
ALTER TABLE `website_setting`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `widgets`
--
ALTER TABLE `widgets`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `comments`
--
ALTER TABLE `comments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `companies`
--
ALTER TABLE `companies`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `company_contents`
--
ALTER TABLE `company_contents`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `contacts`
--
ALTER TABLE `contacts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `contents`
--
ALTER TABLE `contents`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=72;

--
-- AUTO_INCREMENT for table `contents_category`
--
ALTER TABLE `contents_category`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `menus`
--
ALTER TABLE `menus`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `permissions`
--
ALTER TABLE `permissions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `redirect_url`
--
ALTER TABLE `redirect_url`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `roles`
--
ALTER TABLE `roles`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `spiders`
--
ALTER TABLE `spiders`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `website_setting`
--
ALTER TABLE `website_setting`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `widgets`
--
ALTER TABLE `widgets`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `comments`
--
ALTER TABLE `comments`
  ADD CONSTRAINT `comments_content_id_foreign` FOREIGN KEY (`content_id`) REFERENCES `contents` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `companies`
--
ALTER TABLE `companies`
  ADD CONSTRAINT `companies_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `company_contents`
--
ALTER TABLE `company_contents`
  ADD CONSTRAINT `company_contents_company_id_foreign` FOREIGN KEY (`company_id`) REFERENCES `companies` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `company_contents_content_id_foreign` FOREIGN KEY (`content_id`) REFERENCES `contents` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `contents_category`
--
ALTER TABLE `contents_category`
  ADD CONSTRAINT `contents_category_cat_id_foreign` FOREIGN KEY (`cat_id`) REFERENCES `contents` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `contents_category_content_id_foreign` FOREIGN KEY (`content_id`) REFERENCES `contents` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `model_has_permissions`
--
ALTER TABLE `model_has_permissions`
  ADD CONSTRAINT `model_has_permissions_permission_id_foreign` FOREIGN KEY (`permission_id`) REFERENCES `permissions` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `model_has_roles`
--
ALTER TABLE `model_has_roles`
  ADD CONSTRAINT `model_has_roles_role_id_foreign` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `role_has_permissions`
--
ALTER TABLE `role_has_permissions`
  ADD CONSTRAINT `role_has_permissions_permission_id_foreign` FOREIGN KEY (`permission_id`) REFERENCES `permissions` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `role_has_permissions_role_id_foreign` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
